0xastro/fmcw-RADAR/mmwave_sdk/packages/ti/drivers/soc/include/reg_dspicfg.h
/**
 *  @file    reg_dspicfg.h
 *
 *  @brief
 *    This file gives register definitions of DSP_ICFG module.
 *
 *  This file is auto-generated on 3/7/2017.
 *
 */

 /*
 *   (C) Copyright 2016, Texas Instruments Incorporated. - TI web address www.ti.com
 *---------------------------------------------------------------------------------------
 *
 *  Redistribution and use in source and binary forms, with or without modification,
 *  are permitted provided that the following conditions are met:
 *
 *    Redistributions of source code must retain the above copyright notice,
 *    this list of conditions and the following disclaimer.
 *
 *    Redistributions in binary form must reproduce the above copyright notice,
 *    this list of conditions and the following disclaimer in the documentation
 *    and/or other materials provided with the distribution.
 *
 *    Neither the name of Texas Instruments Incorporated nor the names of its
 *    contributors may be used to endorse or promote products derived from this
 *    software without specific prior written permission.
 *
 *  THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 *  AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO,
 *  THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
 *  PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT  OWNER OR CONTRIBUTORS
 *  BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 *  CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
 *  SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
 *  INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
 *  CONTRACT,  STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
 *  ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
 *  POSSIBILITY OF SUCH DAMAGE.
 */

#ifndef REG_DSPICFG_H
#define REG_DSPICFG_H

/****************************************************************************************
 * INCLUDE FILES
 ****************************************************************************************/
#include <stdint.h>

#ifdef __cplusplus
extern "C" {
#endif

/* Definition for field EF in Register EVTFLAG0 */
#define EVTFLAG0_EF_BIT_START                               0U
#define EVTFLAG0_EF_BIT_END                                 31U

/* Definition for field EF in Register EVTFLAG1 */
#define EVTFLAG1_EF_BIT_START                               0U
#define EVTFLAG1_EF_BIT_END                                 31U

/* Definition for field EF in Register EVTFLAG2 */
#define EVTFLAG2_EF_BIT_START                               0U
#define EVTFLAG2_EF_BIT_END                                 31U

/* Definition for field EF in Register EVTFLAG3 */
#define EVTFLAG3_EF_BIT_START                               0U
#define EVTFLAG3_EF_BIT_END                                 31U

/* Definition for field ES in Register EVTSET0 */
#define EVTSET0_ES_BIT_START                                0U
#define EVTSET0_ES_BIT_END                                  31U

/* Definition for field ES in Register EVTSET1 */
#define EVTSET1_ES_BIT_START                                0U
#define EVTSET1_ES_BIT_END                                  31U

/* Definition for field ES in Register EVTSET2 */
#define EVTSET2_ES_BIT_START                                0U
#define EVTSET2_ES_BIT_END                                  31U

/* Definition for field ES in Register EVTSET3 */
#define EVTSET3_ES_BIT_START                                0U
#define EVTSET3_ES_BIT_END                                  31U

/* Definition for field EC in Register EVTCLR0 */
#define EVTCLR0_EC_BIT_START                                0U
#define EVTCLR0_EC_BIT_END                                  31U

/* Definition for field EC in Register EVTCLR1 */
#define EVTCLR1_EC_BIT_START                                0U
#define EVTCLR1_EC_BIT_END                                  31U

/* Definition for field EC in Register EVTCLR2 */
#define EVTCLR2_EC_BIT_START                                0U
#define EVTCLR2_EC_BIT_END                                  31U

/* Definition for field EC in Register EVTCLR3 */
#define EVTCLR3_EC_BIT_START                                0U
#define EVTCLR3_EC_BIT_END                                  31U

/* Definition for field EM in Register EVTMASK0 */
#define EVTMASK0_EM_BIT_START                               0U
#define EVTMASK0_EM_BIT_END                                 31U

/* Definition for field EM in Register EVTMASK1 */
#define EVTMASK1_EM_BIT_START                               0U
#define EVTMASK1_EM_BIT_END                                 31U

/* Definition for field EM in Register EVTMASK2 */
#define EVTMASK2_EM_BIT_START                               0U
#define EVTMASK2_EM_BIT_END                                 31U

/* Definition for field EM in Register EVTMASK3 */
#define EVTMASK3_EM_BIT_START                               0U
#define EVTMASK3_EM_BIT_END                                 31U

/* Definition for field MEVTFLAG in Register MEVTFLAG0 */
#define MEVTFLAG0_MEVTFLAG_BIT_START                        0U
#define MEVTFLAG0_MEVTFLAG_BIT_END                          31U

/* Definition for field MEVTFLAG in Register MEVTFLAG1 */
#define MEVTFLAG1_MEVTFLAG_BIT_START                        0U
#define MEVTFLAG1_MEVTFLAG_BIT_END                          31U

/* Definition for field MEVTFLAG in Register MEVTFLAG2 */
#define MEVTFLAG2_MEVTFLAG_BIT_START                        0U
#define MEVTFLAG2_MEVTFLAG_BIT_END                          31U

/* Definition for field MEVTFLAG in Register MEVTFLAG3 */
#define MEVTFLAG3_MEVTFLAG_BIT_START                        0U
#define MEVTFLAG3_MEVTFLAG_BIT_END                          31U

/* Definition for field XM in Register EXPMASK0 */
#define EXPMASK0_XM_BIT_START                               0U
#define EXPMASK0_XM_BIT_END                                 31U

/* Definition for field XM in Register EXPMASK1 */
#define EXPMASK1_XM_BIT_START                               0U
#define EXPMASK1_XM_BIT_END                                 31U

