0xastro/fmcw-RADAR/mmwave_sdk/packages/ti/drivers/soc/include/reg_dspicfg.h
/* Definition for field XM in Register EXPMASK2 */
#define EXPMASK2_XM_BIT_START                               0U
#define EXPMASK2_XM_BIT_END                                 31U

/* Definition for field XM in Register EXPMASK3 */
#define EXPMASK3_XM_BIT_START                               0U
#define EXPMASK3_XM_BIT_END                                 31U

/* Definition for field MEXPFLAG in Register MEXPFLAG0 */
#define MEXPFLAG0_MEXPFLAG_BIT_START                        0U
#define MEXPFLAG0_MEXPFLAG_BIT_END                          31U

/* Definition for field MEXPFLAG in Register MEXPFLAG1 */
#define MEXPFLAG1_MEXPFLAG_BIT_START                        0U
#define MEXPFLAG1_MEXPFLAG_BIT_END                          31U

/* Definition for field MEXPFLAG in Register MEXPFLAG2 */
#define MEXPFLAG2_MEXPFLAG_BIT_START                        0U
#define MEXPFLAG2_MEXPFLAG_BIT_END                          31U

/* Definition for field MEXPFLAG in Register MEXPFLAG3 */
#define MEXPFLAG3_MEXPFLAG_BIT_START                        0U
#define MEXPFLAG3_MEXPFLAG_BIT_END                          31U

/* Definition for field _RESV3 in Register INTMUX1 */
#define INTMUX1__RESV3_BIT_START                            31U
#define INTMUX1__RESV3_BIT_END                              31U

/* Definition for field INTSEL7 in Register INTMUX1 */
#define INTMUX1_INTSEL7_BIT_START                           24U
#define INTMUX1_INTSEL7_BIT_END                             30U

/* Definition for field _RESV2 in Register INTMUX1 */
#define INTMUX1__RESV2_BIT_START                            23U
#define INTMUX1__RESV2_BIT_END                              23U

/* Definition for field INTSEL6 in Register INTMUX1 */
#define INTMUX1_INTSEL6_BIT_START                           16U
#define INTMUX1_INTSEL6_BIT_END                             22U

/* Definition for field _RESV1 in Register INTMUX1 */
#define INTMUX1__RESV1_BIT_START                            15U
#define INTMUX1__RESV1_BIT_END                              15U

/* Definition for field INTSEL5 in Register INTMUX1 */
#define INTMUX1_INTSEL5_BIT_START                           8U
#define INTMUX1_INTSEL5_BIT_END                             14U

/* Definition for field _RESV0 in Register INTMUX1 */
#define INTMUX1__RESV0_BIT_START                            7U
#define INTMUX1__RESV0_BIT_END                              7U

/* Definition for field INTSEL4 in Register INTMUX1 */
#define INTMUX1_INTSEL4_BIT_START                           0U
#define INTMUX1_INTSEL4_BIT_END                             6U

/* Definition for field _RESV3 in Register INTMUX2 */
#define INTMUX2__RESV3_BIT_START                            31U
#define INTMUX2__RESV3_BIT_END                              31U

/* Definition for field INTSEL11 in Register INTMUX2 */
#define INTMUX2_INTSEL11_BIT_START                          24U
#define INTMUX2_INTSEL11_BIT_END                            30U

/* Definition for field _RESV2 in Register INTMUX2 */
#define INTMUX2__RESV2_BIT_START                            23U
#define INTMUX2__RESV2_BIT_END                              23U

/* Definition for field INTSEL10 in Register INTMUX2 */
#define INTMUX2_INTSEL10_BIT_START                          16U
#define INTMUX2_INTSEL10_BIT_END                            22U

/* Definition for field _RESV1 in Register INTMUX2 */
#define INTMUX2__RESV1_BIT_START                            15U
#define INTMUX2__RESV1_BIT_END                              15U

/* Definition for field INTSEL9 in Register INTMUX2 */
#define INTMUX2_INTSEL9_BIT_START                           8U
#define INTMUX2_INTSEL9_BIT_END                             14U

/* Definition for field _RESV0 in Register INTMUX2 */
#define INTMUX2__RESV0_BIT_START                            7U
#define INTMUX2__RESV0_BIT_END                              7U

/* Definition for field INTSEL8 in Register INTMUX2 */
#define INTMUX2_INTSEL8_BIT_START                           0U
#define INTMUX2_INTSEL8_BIT_END                             6U

/* Definition for field _RESV3 in Register INTMUX3 */
#define INTMUX3__RESV3_BIT_START                            31U
#define INTMUX3__RESV3_BIT_END                              31U

/* Definition for field INTSEL15 in Register INTMUX3 */
#define INTMUX3_INTSEL15_BIT_START                          24U
#define INTMUX3_INTSEL15_BIT_END                            30U

/* Definition for field _RESV2 in Register INTMUX3 */
#define INTMUX3__RESV2_BIT_START                            23U
#define INTMUX3__RESV2_BIT_END                              23U

/* Definition for field INTSEL14 in Register INTMUX3 */
#define INTMUX3_INTSEL14_BIT_START                          16U
#define INTMUX3_INTSEL14_BIT_END                            22U

/* Definition for field _RESV1 in Register INTMUX3 */
#define INTMUX3__RESV1_BIT_START                            15U
#define INTMUX3__RESV1_BIT_END                              15U

/* Definition for field INTSEL13 in Register INTMUX3 */
#define INTMUX3_INTSEL13_BIT_START                          8U
#define INTMUX3_INTSEL13_BIT_END                            14U

/* Definition for field _RESV0 in Register INTMUX3 */
#define INTMUX3__RESV0_BIT_START                            7U
#define INTMUX3__RESV0_BIT_END                              7U

/* Definition for field INTSEL12 in Register INTMUX3 */
#define INTMUX3_INTSEL12_BIT_START                          0U
#define INTMUX3_INTSEL12_BIT_END                            6U

/* Definition for field RES1 in Register AEGMUX0 */
#define AEGMUX0_RES1_BIT_START                              31U
#define AEGMUX0_RES1_BIT_END                                31U

/* Definition for field AEGSEL3 in Register AEGMUX0 */
#define AEGMUX0_AEGSEL3_BIT_START                           24U
#define AEGMUX0_AEGSEL3_BIT_END                             30U

/* Definition for field RES2 in Register AEGMUX0 */
#define AEGMUX0_RES2_BIT_START                              23U
#define AEGMUX0_RES2_BIT_END                                23U

/* Definition for field AEGSEL2 in Register AEGMUX0 */
#define AEGMUX0_AEGSEL2_BIT_START                           16U
#define AEGMUX0_AEGSEL2_BIT_END                             22U

/* Definition for field RES3 in Register AEGMUX0 */
#define AEGMUX0_RES3_BIT_START                              15U
#define AEGMUX0_RES3_BIT_END                                15U

/* Definition for field AEGSEL1 in Register AEGMUX0 */
#define AEGMUX0_AEGSEL1_BIT_START                           8U
#define AEGMUX0_AEGSEL1_BIT_END                             14U

/* Definition for field RES4 in Register AEGMUX0 */
#define AEGMUX0_RES4_BIT_START                              7U
#define AEGMUX0_RES4_BIT_END                                7U

/* Definition for field AEGSEL0 in Register AEGMUX0 */
#define AEGMUX0_AEGSEL0_BIT_START                           0U
#define AEGMUX0_AEGSEL0_BIT_END                             6U

