0xastro/fmcw-RADAR/mmwave_sdk/packages/ti/drivers/soc/include/reg_dspicfg.h
/* Definition for field RES5 in Register AEGMUX1 */
#define AEGMUX1_RES5_BIT_START                              31U
#define AEGMUX1_RES5_BIT_END                                31U

/* Definition for field AEGSEL7 in Register AEGMUX1 */
#define AEGMUX1_AEGSEL7_BIT_START                           24U
#define AEGMUX1_AEGSEL7_BIT_END                             30U

/* Definition for field RES6 in Register AEGMUX1 */
#define AEGMUX1_RES6_BIT_START                              23U
#define AEGMUX1_RES6_BIT_END                                23U

/* Definition for field AEGSEL6 in Register AEGMUX1 */
#define AEGMUX1_AEGSEL6_BIT_START                           16U
#define AEGMUX1_AEGSEL6_BIT_END                             22U

/* Definition for field RES7 in Register AEGMUX1 */
#define AEGMUX1_RES7_BIT_START                              15U
#define AEGMUX1_RES7_BIT_END                                15U

/* Definition for field AEGSEL5 in Register AEGMUX1 */
#define AEGMUX1_AEGSEL5_BIT_START                           8U
#define AEGMUX1_AEGSEL5_BIT_END                             14U

/* Definition for field RES8 in Register AEGMUX1 */
#define AEGMUX1_RES8_BIT_START                              7U
#define AEGMUX1_RES8_BIT_END                                7U

/* Definition for field AEGSEL4 in Register AEGMUX1 */
#define AEGMUX1_AEGSEL4_BIT_START                           0U
#define AEGMUX1_AEGSEL4_BIT_END                             6U

/* Definition for field SYSINT in Register INTXSTAT */
#define INTXSTAT_SYSINT_BIT_START                           24U
#define INTXSTAT_SYSINT_BIT_END                             31U

/* Definition for field CPUINT in Register INTXSTAT */
#define INTXSTAT_CPUINT_BIT_START                           16U
#define INTXSTAT_CPUINT_BIT_END                             23U

/* Definition for field _RESV3 in Register INTXSTAT */
#define INTXSTAT__RESV3_BIT_START                           1U
#define INTXSTAT__RESV3_BIT_END                             15U

/* Definition for field DROP in Register INTXSTAT */
#define INTXSTAT_DROP_BIT_START                             0U
#define INTXSTAT_DROP_BIT_END                               0U

/* Definition for field _RESV3 in Register INTXCLR */
#define INTXCLR__RESV3_BIT_START                            1U
#define INTXCLR__RESV3_BIT_END                              31U

/* Definition for field CLEAR in Register INTXCLR */
#define INTXCLR_CLEAR_BIT_START                             0U
#define INTXCLR_CLEAR_BIT_END                               0U

/* Definition for field _RESV1 in Register INTDMASK */
#define INTDMASK__RESV1_BIT_START                           16U
#define INTDMASK__RESV1_BIT_END                             31U

/* Definition for field IDM in Register INTDMASK */
#define INTDMASK_IDM_BIT_START                              4U
#define INTDMASK_IDM_BIT_END                                15U

/* Definition for field _RESV0 in Register INTDMASK */
#define INTDMASK__RESV0_BIT_START                           0U
#define INTDMASK__RESV0_BIT_END                             3U

/* Definition for field MRA in Register EVTASRT */
#define EVTASRT_MRA_BIT_START                               31U
#define EVTASRT_MRA_BIT_END                                 31U

/* Definition for field SRA in Register EVTASRT */
#define EVTASRT_SRA_BIT_START                               30U
#define EVTASRT_SRA_BIT_END                                 30U

/* Definition for field CRA in Register EVTASRT */
#define EVTASRT_CRA_BIT_START                               29U
#define EVTASRT_CRA_BIT_END                                 29U

/* Definition for field LRA in Register EVTASRT */
#define EVTASRT_LRA_BIT_START                               28U
#define EVTASRT_LRA_BIT_END                                 28U

/* Definition for field _RESV0 in Register EVTASRT */
#define EVTASRT__RESV0_BIT_START                            8U
#define EVTASRT__RESV0_BIT_END                              27U

/* Definition for field EA in Register EVTASRT */
#define EVTASRT_EA_BIT_START                                0U
#define EVTASRT_EA_BIT_END                                  7U

/* Definition for field RESV_1 in Register PDCCMD */
#define PDCCMD_RESV_1_BIT_START                             17U
#define PDCCMD_RESV_1_BIT_END                               31U

/* Definition for field GEMPD in Register PDCCMD */
#define PDCCMD_GEMPD_BIT_START                              16U
#define PDCCMD_GEMPD_BIT_END                                16U

/* Definition for field RESV_2 in Register PDCCMD */
#define PDCCMD_RESV_2_BIT_START                             14U
#define PDCCMD_RESV_2_BIT_END                               15U

/* Definition for field EMCLOG in Register PDCCMD */
#define PDCCMD_EMCLOG_BIT_START                             12U
#define PDCCMD_EMCLOG_BIT_END                               13U

/* Definition for field RESV_3 in Register PDCCMD */
#define PDCCMD_RESV_3_BIT_START                             10U
#define PDCCMD_RESV_3_BIT_END                               11U

/* Definition for field UMCLOG in Register PDCCMD */
#define PDCCMD_UMCLOG_BIT_START                             8U
#define PDCCMD_UMCLOG_BIT_END                               9U

/* Definition for field DMCMEM in Register PDCCMD */
#define PDCCMD_DMCMEM_BIT_START                             6U
#define PDCCMD_DMCMEM_BIT_END                               7U

/* Definition for field DMCLOG in Register PDCCMD */
#define PDCCMD_DMCLOG_BIT_START                             4U
#define PDCCMD_DMCLOG_BIT_END                               5U

/* Definition for field PMCMEM in Register PDCCMD */
#define PDCCMD_PMCMEM_BIT_START                             2U
#define PDCCMD_PMCMEM_BIT_END                               3U

/* Definition for field PMCLOG in Register PDCCMD */
#define PDCCMD_PMCLOG_BIT_START                             0U
#define PDCCMD_PMCLOG_BIT_END                               1U

/* Definition for field MM_REVID in Register MM_REVID */
#define MM_REVID_MM_REVID_BIT_START                         0U
#define MM_REVID_MM_REVID_BIT_END                           31U

/* Definition for field _RESV1 in Register IDMA0_STAT */
#define IDMA0_STAT__RESV1_BIT_START                         2U
#define IDMA0_STAT__RESV1_BIT_END                           31U

/* Definition for field PEND in Register IDMA0_STAT */
#define IDMA0_STAT_PEND_BIT_START                           1U
#define IDMA0_STAT_PEND_BIT_END                             1U

/* Definition for field ACTV in Register IDMA0_STAT */
#define IDMA0_STAT_ACTV_BIT_START                           0U
#define IDMA0_STAT_ACTV_BIT_END                             0U

