0xastro/fmcw-RADAR/mmwave_sdk/packages/ti/drivers/soc/include/reg_dspicfg.h
/* Definition for field MASK in Register IDMA0_MASK */
#define IDMA0_MASK_MASK_BIT_START                           0U
#define IDMA0_MASK_MASK_BIT_END                             31U

/* Definition for field SOURCEADDR in Register IDMA0_SOURCE */
#define IDMA0_SOURCE_SOURCEADDR_BIT_START                   5U
#define IDMA0_SOURCE_SOURCEADDR_BIT_END                     31U

/* Definition for field _RESV1 in Register IDMA0_SOURCE */
#define IDMA0_SOURCE__RESV1_BIT_START                       0U
#define IDMA0_SOURCE__RESV1_BIT_END                         4U

/* Definition for field DESTADDR in Register IDMA0_DEST */
#define IDMA0_DEST_DESTADDR_BIT_START                       5U
#define IDMA0_DEST_DESTADDR_BIT_END                         31U

/* Definition for field _RESV1 in Register IDMA0_DEST */
#define IDMA0_DEST__RESV1_BIT_START                         0U
#define IDMA0_DEST__RESV1_BIT_END                           4U

/* Definition for field _RESV1 in Register IDMA0_COUNT */
#define IDMA0_COUNT__RESV1_BIT_START                        29U
#define IDMA0_COUNT__RESV1_BIT_END                          31U

/* Definition for field INT in Register IDMA0_COUNT */
#define IDMA0_COUNT_INT_BIT_START                           28U
#define IDMA0_COUNT_INT_BIT_END                             28U

/* Definition for field _RESV2 in Register IDMA0_COUNT */
#define IDMA0_COUNT__RESV2_BIT_START                        4U
#define IDMA0_COUNT__RESV2_BIT_END                          27U

/* Definition for field COUNT in Register IDMA0_COUNT */
#define IDMA0_COUNT_COUNT_BIT_START                         0U
#define IDMA0_COUNT_COUNT_BIT_END                           3U

/* Definition for field _RESV1 in Register IDMA1_STAT */
#define IDMA1_STAT__RESV1_BIT_START                         2U
#define IDMA1_STAT__RESV1_BIT_END                           31U

/* Definition for field PEND in Register IDMA1_STAT */
#define IDMA1_STAT_PEND_BIT_START                           1U
#define IDMA1_STAT_PEND_BIT_END                             1U

/* Definition for field ACTV in Register IDMA1_STAT */
#define IDMA1_STAT_ACTV_BIT_START                           0U
#define IDMA1_STAT_ACTV_BIT_END                             0U

/* Definition for field SOURCEADDR in Register IDMA1_SOURCE */
#define IDMA1_SOURCE_SOURCEADDR_BIT_START                   2U
#define IDMA1_SOURCE_SOURCEADDR_BIT_END                     31U

/* Definition for field _RESV1 in Register IDMA1_SOURCE */
#define IDMA1_SOURCE__RESV1_BIT_START                       0U
#define IDMA1_SOURCE__RESV1_BIT_END                         1U

/* Definition for field DESTADDR in Register IDMA1_DEST */
#define IDMA1_DEST_DESTADDR_BIT_START                       2U
#define IDMA1_DEST_DESTADDR_BIT_END                         31U

/* Definition for field _RESV1 in Register IDMA1_DEST */
#define IDMA1_DEST__RESV1_BIT_START                         0U
#define IDMA1_DEST__RESV1_BIT_END                           1U

/* Definition for field PRI in Register IDMA1_COUNT */
#define IDMA1_COUNT_PRI_BIT_START                           29U
#define IDMA1_COUNT_PRI_BIT_END                             31U

/* Definition for field INT in Register IDMA1_COUNT */
#define IDMA1_COUNT_INT_BIT_START                           28U
#define IDMA1_COUNT_INT_BIT_END                             28U

/* Definition for field _RESV1 in Register IDMA1_COUNT */
#define IDMA1_COUNT__RESV1_BIT_START                        17U
#define IDMA1_COUNT__RESV1_BIT_END                          27U

/* Definition for field FILL in Register IDMA1_COUNT */
#define IDMA1_COUNT_FILL_BIT_START                          16U
#define IDMA1_COUNT_FILL_BIT_END                            16U

/* Definition for field COUNT in Register IDMA1_COUNT */
#define IDMA1_COUNT_COUNT_BIT_START                         2U
#define IDMA1_COUNT_COUNT_BIT_END                           15U

/* Definition for field _RESV2 in Register IDMA1_COUNT */
#define IDMA1_COUNT__RESV2_BIT_START                        0U
#define IDMA1_COUNT__RESV2_BIT_END                          1U

/* Definition for field RESV_1 in Register CPUARBE */
#define CPUARBE_RESV_1_BIT_START                            19U
#define CPUARBE_RESV_1_BIT_END                              31U

/* Definition for field PRI in Register CPUARBE */
#define CPUARBE_PRI_BIT_START                               16U
#define CPUARBE_PRI_BIT_END                                 18U

/* Definition for field RESV_2 in Register CPUARBE */
#define CPUARBE_RESV_2_BIT_START                            6U
#define CPUARBE_RESV_2_BIT_END                              15U

/* Definition for field MAXWAIT in Register CPUARBE */
#define CPUARBE_MAXWAIT_BIT_START                           0U
#define CPUARBE_MAXWAIT_BIT_END                             5U

/* Definition for field RESV_1 in Register IDMAARBE */
#define IDMAARBE_RESV_1_BIT_START                           6U
#define IDMAARBE_RESV_1_BIT_END                             31U

/* Definition for field MAXWAIT in Register IDMAARBE */
#define IDMAARBE_MAXWAIT_BIT_START                          0U
#define IDMAARBE_MAXWAIT_BIT_END                            5U

/* Definition for field RESV_1 in Register SDMAARBE */
#define SDMAARBE_RESV_1_BIT_START                           6U
#define SDMAARBE_RESV_1_BIT_END                             31U

/* Definition for field MAXWAIT in Register SDMAARBE */
#define SDMAARBE_MAXWAIT_BIT_START                          0U
#define SDMAARBE_MAXWAIT_BIT_END                            5U

/* Definition for field RESV_2 in Register ECFGARBE */
#define ECFGARBE_RESV_2_BIT_START                           19U
#define ECFGARBE_RESV_2_BIT_END                             31U

/* Definition for field PRI in Register ECFGARBE */
#define ECFGARBE_PRI_BIT_START                              16U
#define ECFGARBE_PRI_BIT_END                                18U

/* Definition for field RESV_1 in Register ECFGARBE */
#define ECFGARBE_RESV_1_BIT_START                           0U
#define ECFGARBE_RESV_1_BIT_END                             15U

/* Definition for field ADDR in Register ICFGMPFAR */
#define ICFGMPFAR_ADDR_BIT_START                            0U
#define ICFGMPFAR_ADDR_BIT_END                              31U

/* Definition for field RESV_1 in Register ICFGMPFSR */
#define ICFGMPFSR_RESV_1_BIT_START                          16U
#define ICFGMPFSR_RESV_1_BIT_END                            31U

