0xastro/fmcw-RADAR/mmwave_sdk/packages/ti/drivers/soc/include/reg_dspicfg.h
/* Definition for field FID in Register ICFGMPFSR */
#define ICFGMPFSR_FID_BIT_START                             8U
#define ICFGMPFSR_FID_BIT_END                               15U

/* Definition for field SECE in Register ICFGMPFSR */
#define ICFGMPFSR_SECE_BIT_START                            7U
#define ICFGMPFSR_SECE_BIT_END                              7U

/* Definition for field RESV_2 in Register ICFGMPFSR */
#define ICFGMPFSR_RESV_2_BIT_START                          6U
#define ICFGMPFSR_RESV_2_BIT_END                            6U

/* Definition for field SR in Register ICFGMPFSR */
#define ICFGMPFSR_SR_BIT_START                              5U
#define ICFGMPFSR_SR_BIT_END                                5U

/* Definition for field SW in Register ICFGMPFSR */
#define ICFGMPFSR_SW_BIT_START                              4U
#define ICFGMPFSR_SW_BIT_END                                4U

/* Definition for field SX in Register ICFGMPFSR */
#define ICFGMPFSR_SX_BIT_START                              3U
#define ICFGMPFSR_SX_BIT_END                                3U

/* Definition for field UR in Register ICFGMPFSR */
#define ICFGMPFSR_UR_BIT_START                              2U
#define ICFGMPFSR_UR_BIT_END                                2U

/* Definition for field UW in Register ICFGMPFSR */
#define ICFGMPFSR_UW_BIT_START                              1U
#define ICFGMPFSR_UW_BIT_END                                1U

/* Definition for field UX in Register ICFGMPFSR */
#define ICFGMPFSR_UX_BIT_START                              0U
#define ICFGMPFSR_UX_BIT_END                                0U

/* Definition for field RESV_1 in Register ICFGMPFCR */
#define ICFGMPFCR_RESV_1_BIT_START                          1U
#define ICFGMPFCR_RESV_1_BIT_END                            31U

/* Definition for field MPFCLR in Register ICFGMPFCR */
#define ICFGMPFCR_MPFCLR_BIT_START                          0U
#define ICFGMPFCR_MPFCLR_BIT_END                            0U

/* Definition for field ERR in Register ECFGERR */
#define ECFGERR_ERR_BIT_START                               29U
#define ECFGERR_ERR_BIT_END                                 31U

/* Definition for field RESV_2 in Register ECFGERR */
#define ECFGERR_RESV_2_BIT_START                            12U
#define ECFGERR_RESV_2_BIT_END                              28U

/* Definition for field XID in Register ECFGERR */
#define ECFGERR_XID_BIT_START                               8U
#define ECFGERR_XID_BIT_END                                 11U

/* Definition for field RESV_1 in Register ECFGERR */
#define ECFGERR_RESV_1_BIT_START                            3U
#define ECFGERR_RESV_1_BIT_END                              7U

/* Definition for field STAT in Register ECFGERR */
#define ECFGERR_STAT_BIT_START                              0U
#define ECFGERR_STAT_BIT_END                                2U

/* Definition for field RESV_1 in Register ECFGERRCLR */
#define ECFGERRCLR_RESV_1_BIT_START                         1U
#define ECFGERRCLR_RESV_1_BIT_END                           31U

/* Definition for field CLR in Register ECFGERRCLR */
#define ECFGERRCLR_CLR_BIT_START                            0U
#define ECFGERRCLR_CLR_BIT_END                              0U

/* Definition for field _RESV1 in Register PAMAP0 */
#define PAMAP0__RESV1_BIT_START                             3U
#define PAMAP0__RESV1_BIT_END                               31U

/* Definition for field AID in Register PAMAP0 */
#define PAMAP0_AID_BIT_START                                0U
#define PAMAP0_AID_BIT_END                                  2U

/* Definition for field _RESV1 in Register PAMAP1 */
#define PAMAP1__RESV1_BIT_START                             3U
#define PAMAP1__RESV1_BIT_END                               31U

/* Definition for field AID in Register PAMAP1 */
#define PAMAP1_AID_BIT_START                                0U
#define PAMAP1_AID_BIT_END                                  2U

/* Definition for field _RESV1 in Register PAMAP2 */
#define PAMAP2__RESV1_BIT_START                             3U
#define PAMAP2__RESV1_BIT_END                               31U

/* Definition for field AID in Register PAMAP2 */
#define PAMAP2_AID_BIT_START                                0U
#define PAMAP2_AID_BIT_END                                  2U

/* Definition for field _RESV1 in Register PAMAP3 */
#define PAMAP3__RESV1_BIT_START                             3U
#define PAMAP3__RESV1_BIT_END                               31U

/* Definition for field AID in Register PAMAP3 */
#define PAMAP3_AID_BIT_START                                0U
#define PAMAP3_AID_BIT_END                                  2U

/* Definition for field _RESV1 in Register PAMAP4 */
#define PAMAP4__RESV1_BIT_START                             3U
#define PAMAP4__RESV1_BIT_END                               31U

/* Definition for field AID in Register PAMAP4 */
#define PAMAP4_AID_BIT_START                                0U
#define PAMAP4_AID_BIT_END                                  2U

/* Definition for field _RESV1 in Register PAMAP5 */
#define PAMAP5__RESV1_BIT_START                             3U
#define PAMAP5__RESV1_BIT_END                               31U

/* Definition for field AID in Register PAMAP5 */
#define PAMAP5_AID_BIT_START                                0U
#define PAMAP5_AID_BIT_END                                  2U

/* Definition for field _RESV1 in Register PAMAP6 */
#define PAMAP6__RESV1_BIT_START                             3U
#define PAMAP6__RESV1_BIT_END                               31U

/* Definition for field AID in Register PAMAP6 */
#define PAMAP6_AID_BIT_START                                0U
#define PAMAP6_AID_BIT_END                                  2U

/* Definition for field _RESV1 in Register PAMAP7 */
#define PAMAP7__RESV1_BIT_START                             3U
#define PAMAP7__RESV1_BIT_END                               31U

/* Definition for field AID in Register PAMAP7 */
#define PAMAP7_AID_BIT_START                                0U
#define PAMAP7_AID_BIT_END                                  2U

