0xastro/fmcw-RADAR/mmwave_sdk/packages/ti/drivers/soc/include/reg_dspicfg.h
/* Definition for field _RESV1 in Register PAMAP8 */
#define PAMAP8__RESV1_BIT_START                             3U
#define PAMAP8__RESV1_BIT_END                               31U

/* Definition for field AID in Register PAMAP8 */
#define PAMAP8_AID_BIT_START                                0U
#define PAMAP8_AID_BIT_END                                  2U

/* Definition for field _RESV1 in Register PAMAP9 */
#define PAMAP9__RESV1_BIT_START                             3U
#define PAMAP9__RESV1_BIT_END                               31U

/* Definition for field AID in Register PAMAP9 */
#define PAMAP9_AID_BIT_START                                0U
#define PAMAP9_AID_BIT_END                                  2U

/* Definition for field _RESV1 in Register PAMAP10 */
#define PAMAP10__RESV1_BIT_START                            3U
#define PAMAP10__RESV1_BIT_END                              31U

/* Definition for field AID in Register PAMAP10 */
#define PAMAP10_AID_BIT_START                               0U
#define PAMAP10_AID_BIT_END                                 2U

/* Definition for field _RESV1 in Register PAMAP11 */
#define PAMAP11__RESV1_BIT_START                            3U
#define PAMAP11__RESV1_BIT_END                              31U

/* Definition for field AID in Register PAMAP11 */
#define PAMAP11_AID_BIT_START                               0U
#define PAMAP11_AID_BIT_END                                 2U

/* Definition for field _RESV1 in Register PAMAP12 */
#define PAMAP12__RESV1_BIT_START                            3U
#define PAMAP12__RESV1_BIT_END                              31U

/* Definition for field AID in Register PAMAP12 */
#define PAMAP12_AID_BIT_START                               0U
#define PAMAP12_AID_BIT_END                                 2U

/* Definition for field _RESV1 in Register PAMAP13 */
#define PAMAP13__RESV1_BIT_START                            3U
#define PAMAP13__RESV1_BIT_END                              31U

/* Definition for field AID in Register PAMAP13 */
#define PAMAP13_AID_BIT_START                               0U
#define PAMAP13_AID_BIT_END                                 2U

/* Definition for field _RESV1 in Register PAMAP14 */
#define PAMAP14__RESV1_BIT_START                            3U
#define PAMAP14__RESV1_BIT_END                              31U

/* Definition for field AID in Register PAMAP14 */
#define PAMAP14_AID_BIT_START                               0U
#define PAMAP14_AID_BIT_END                                 2U

/* Definition for field _RESV1 in Register PAMAP15 */
#define PAMAP15__RESV1_BIT_START                            3U
#define PAMAP15__RESV1_BIT_END                              31U

/* Definition for field AID in Register PAMAP15 */
#define PAMAP15_AID_BIT_START                               0U
#define PAMAP15_AID_BIT_END                                 2U

/* Definition for field RESV_1 in Register L2CFG */
#define L2CFG_RESV_1_BIT_START                              28U
#define L2CFG_RESV_1_BIT_END                                31U

/* Definition for field NUM_MM in Register L2CFG */
#define L2CFG_NUM_MM_BIT_START                              24U
#define L2CFG_NUM_MM_BIT_END                                27U

/* Definition for field RESV_2 in Register L2CFG */
#define L2CFG_RESV_2_BIT_START                              20U
#define L2CFG_RESV_2_BIT_END                                23U

/* Definition for field MMID in Register L2CFG */
#define L2CFG_MMID_BIT_START                                16U
#define L2CFG_MMID_BIT_END                                  19U

/* Definition for field RESV_3 in Register L2CFG */
#define L2CFG_RESV_3_BIT_START                              10U
#define L2CFG_RESV_3_BIT_END                                15U

/* Definition for field IP in Register L2CFG */
#define L2CFG_IP_BIT_START                                  9U
#define L2CFG_IP_BIT_END                                    9U

/* Definition for field ID in Register L2CFG */
#define L2CFG_ID_BIT_START                                  8U
#define L2CFG_ID_BIT_END                                    8U

/* Definition for field RESV_4 in Register L2CFG */
#define L2CFG_RESV_4_BIT_START                              5U
#define L2CFG_RESV_4_BIT_END                                7U

/* Definition for field L2CC in Register L2CFG */
#define L2CFG_L2CC_BIT_START                                3U
#define L2CFG_L2CC_BIT_END                                  4U

/* Definition for field L2MODE in Register L2CFG */
#define L2CFG_L2MODE_BIT_START                              0U
#define L2CFG_L2MODE_BIT_END                                2U

/* Definition for field RESV_1 in Register L1PCFG */
#define L1PCFG_RESV_1_BIT_START                             3U
#define L1PCFG_RESV_1_BIT_END                               31U

/* Definition for field L1PMODE in Register L1PCFG */
#define L1PCFG_L1PMODE_BIT_START                            0U
#define L1PCFG_L1PMODE_BIT_END                              2U

/* Definition for field RESV_1 in Register L1PCC */
#define L1PCC_RESV_1_BIT_START                              19U
#define L1PCC_RESV_1_BIT_END                                31U

/* Definition for field POPER in Register L1PCC */
#define L1PCC_POPER_BIT_START                               16U
#define L1PCC_POPER_BIT_END                                 18U

/* Definition for field RESV_2 in Register L1PCC */
#define L1PCC_RESV_2_BIT_START                              3U
#define L1PCC_RESV_2_BIT_END                                15U

/* Definition for field OPER in Register L1PCC */
#define L1PCC_OPER_BIT_START                                0U
#define L1PCC_OPER_BIT_END                                  2U

/* Definition for field RESV_1 in Register L1DCFG */
#define L1DCFG_RESV_1_BIT_START                             3U
#define L1DCFG_RESV_1_BIT_END                               31U

/* Definition for field L1DMODE in Register L1DCFG */
#define L1DCFG_L1DMODE_BIT_START                            0U
#define L1DCFG_L1DMODE_BIT_END                              2U

/* Definition for field RESV_1 in Register L1DCC */
#define L1DCC_RESV_1_BIT_START                              19U
#define L1DCC_RESV_1_BIT_END                                31U

/* Definition for field POPER in Register L1DCC */
#define L1DCC_POPER_BIT_START                               16U
#define L1DCC_POPER_BIT_END                                 18U

/* Definition for field RESV_2 in Register L1DCC */
#define L1DCC_RESV_2_BIT_START                              3U
#define L1DCC_RESV_2_BIT_END                                15U

/* Definition for field OPER in Register L1DCC */
#define L1DCC_OPER_BIT_START                                0U
#define L1DCC_OPER_BIT_END                                  2U

/* Definition for field RESV_1 in Register CPUARBU */
#define CPUARBU_RESV_1_BIT_START                            19U
#define CPUARBU_RESV_1_BIT_END                              31U

/* Definition for field PRI in Register CPUARBU */
#define CPUARBU_PRI_BIT_START                               16U
#define CPUARBU_PRI_BIT_END                                 18U

/* Definition for field RESV_2 in Register CPUARBU */
#define CPUARBU_RESV_2_BIT_START                            6U
#define CPUARBU_RESV_2_BIT_END                              15U

/* Definition for field MAXWAIT in Register CPUARBU */
#define CPUARBU_MAXWAIT_BIT_START                           0U
#define CPUARBU_MAXWAIT_BIT_END                             5U

