0xastro/fmcw-RADAR/mmwave_sdk/packages/ti/drivers/soc/include/reg_dspicfg.h
/* Definition for field RESV_1 in Register IDMAARBU */
#define IDMAARBU_RESV_1_BIT_START                           6U
#define IDMAARBU_RESV_1_BIT_END                             31U

/* Definition for field MAXWAIT in Register IDMAARBU */
#define IDMAARBU_MAXWAIT_BIT_START                          0U
#define IDMAARBU_MAXWAIT_BIT_END                            5U

/* Definition for field RESV_1 in Register SDMAARBU */
#define SDMAARBU_RESV_1_BIT_START                           6U
#define SDMAARBU_RESV_1_BIT_END                             31U

/* Definition for field MAXWAIT in Register SDMAARBU */
#define SDMAARBU_MAXWAIT_BIT_START                          0U
#define SDMAARBU_MAXWAIT_BIT_END                            5U

/* Definition for field RESV_1 in Register UCARBU */
#define UCARBU_RESV_1_BIT_START                             6U
#define UCARBU_RESV_1_BIT_END                               31U

/* Definition for field MAXWAIT in Register UCARBU */
#define UCARBU_MAXWAIT_BIT_START                            0U
#define UCARBU_MAXWAIT_BIT_END                              5U

/* Definition for field RESV_1 in Register MDMAARBU */
#define MDMAARBU_RESV_1_BIT_START                           27U
#define MDMAARBU_RESV_1_BIT_END                             31U

/* Definition for field UPRI in Register MDMAARBU */
#define MDMAARBU_UPRI_BIT_START                             24U
#define MDMAARBU_UPRI_BIT_END                               26U

/* Definition for field RESV_2 in Register MDMAARBU */
#define MDMAARBU_RESV_2_BIT_START                           19U
#define MDMAARBU_RESV_2_BIT_END                             23U

/* Definition for field PRI in Register MDMAARBU */
#define MDMAARBU_PRI_BIT_START                              16U
#define MDMAARBU_PRI_BIT_END                                18U

/* Definition for field RESV_3 in Register MDMAARBU */
#define MDMAARBU_RESV_3_BIT_START                           0U
#define MDMAARBU_RESV_3_BIT_END                             15U

/* Definition for field RESV_1 in Register CPUARBD */
#define CPUARBD_RESV_1_BIT_START                            19U
#define CPUARBD_RESV_1_BIT_END                              31U

/* Definition for field PRI in Register CPUARBD */
#define CPUARBD_PRI_BIT_START                               16U
#define CPUARBD_PRI_BIT_END                                 18U

/* Definition for field RESV_2 in Register CPUARBD */
#define CPUARBD_RESV_2_BIT_START                            6U
#define CPUARBD_RESV_2_BIT_END                              15U

/* Definition for field MAXWAIT in Register CPUARBD */
#define CPUARBD_MAXWAIT_BIT_START                           0U
#define CPUARBD_MAXWAIT_BIT_END                             5U

/* Definition for field RESV_1 in Register IDMAARBD */
#define IDMAARBD_RESV_1_BIT_START                           6U
#define IDMAARBD_RESV_1_BIT_END                             31U

/* Definition for field MAXWAIT in Register IDMAARBD */
#define IDMAARBD_MAXWAIT_BIT_START                          0U
#define IDMAARBD_MAXWAIT_BIT_END                            5U

/* Definition for field RESV_1 in Register SDMAARBD */
#define SDMAARBD_RESV_1_BIT_START                           6U
#define SDMAARBD_RESV_1_BIT_END                             31U

/* Definition for field MAXWAIT in Register SDMAARBD */
#define SDMAARBD_MAXWAIT_BIT_START                          0U
#define SDMAARBD_MAXWAIT_BIT_END                            5U

/* Definition for field RESV_1 in Register UCARBD */
#define UCARBD_RESV_1_BIT_START                             6U
#define UCARBD_RESV_1_BIT_END                               31U

/* Definition for field MAXWAIT in Register UCARBD */
#define UCARBD_MAXWAIT_BIT_START                            0U
#define UCARBD_MAXWAIT_BIT_END                              5U

/* Definition for field ADDR in Register L2WBAR */
#define L2WBAR_ADDR_BIT_START                               0U
#define L2WBAR_ADDR_BIT_END                                 31U

/* Definition for field RESV_1 in Register L2WWC */
#define L2WWC_RESV_1_BIT_START                              16U
#define L2WWC_RESV_1_BIT_END                                31U

/* Definition for field WC in Register L2WWC */
#define L2WWC_WC_BIT_START                                  0U
#define L2WWC_WC_BIT_END                                    15U

/* Definition for field ADDR in Register L2WIBAR */
#define L2WIBAR_ADDR_BIT_START                              0U
#define L2WIBAR_ADDR_BIT_END                                31U

/* Definition for field RESV_1 in Register L2WIWC */
#define L2WIWC_RESV_1_BIT_START                             16U
#define L2WIWC_RESV_1_BIT_END                               31U

/* Definition for field WC in Register L2WIWC */
#define L2WIWC_WC_BIT_START                                 0U
#define L2WIWC_WC_BIT_END                                   15U

/* Definition for field ADDR in Register L2IBAR */
#define L2IBAR_ADDR_BIT_START                               0U
#define L2IBAR_ADDR_BIT_END                                 31U

/* Definition for field RESV_1 in Register L2IWC */
#define L2IWC_RESV_1_BIT_START                              16U
#define L2IWC_RESV_1_BIT_END                                31U

/* Definition for field WC in Register L2IWC */
#define L2IWC_WC_BIT_START                                  0U
#define L2IWC_WC_BIT_END                                    15U

/* Definition for field ADDR in Register L1PIBAR */
#define L1PIBAR_ADDR_BIT_START                              0U
#define L1PIBAR_ADDR_BIT_END                                31U

/* Definition for field RESV_1 in Register L1PIWC */
#define L1PIWC_RESV_1_BIT_START                             16U
#define L1PIWC_RESV_1_BIT_END                               31U

/* Definition for field WC in Register L1PIWC */
#define L1PIWC_WC_BIT_START                                 0U
#define L1PIWC_WC_BIT_END                                   15U

/* Definition for field ADDR in Register L1DWIBAR */
#define L1DWIBAR_ADDR_BIT_START                             0U
#define L1DWIBAR_ADDR_BIT_END                               31U

/* Definition for field RESV_1 in Register L1DWIWC */
#define L1DWIWC_RESV_1_BIT_START                            16U
#define L1DWIWC_RESV_1_BIT_END                              31U

