0xastro/fmcw-RADAR/mmwave_sdk/packages/ti/drivers/soc/include/reg_dspicfg.h
/* Definition for field WC in Register L1DWIWC */
#define L1DWIWC_WC_BIT_START                                0U
#define L1DWIWC_WC_BIT_END                                  15U

/* Definition for field ADDR in Register L1DWBAR */
#define L1DWBAR_ADDR_BIT_START                              0U
#define L1DWBAR_ADDR_BIT_END                                31U

/* Definition for field RESV_1 in Register L1DWWC */
#define L1DWWC_RESV_1_BIT_START                             16U
#define L1DWWC_RESV_1_BIT_END                               31U

/* Definition for field WC in Register L1DWWC */
#define L1DWWC_WC_BIT_START                                 0U
#define L1DWWC_WC_BIT_END                                   15U

/* Definition for field ADDR in Register L1DIBAR */
#define L1DIBAR_ADDR_BIT_START                              0U
#define L1DIBAR_ADDR_BIT_END                                31U

/* Definition for field RESV_1 in Register L1DIWC */
#define L1DIWC_RESV_1_BIT_START                             16U
#define L1DIWC_RESV_1_BIT_END                               31U

/* Definition for field WC in Register L1DIWC */
#define L1DIWC_WC_BIT_START                                 0U
#define L1DIWC_WC_BIT_END                                   15U

/* Definition for field C in Register L2WB */
#define L2WB_C_BIT_START                                    0U
#define L2WB_C_BIT_END                                      31U

/* Definition for field C in Register L2WBINV */
#define L2WBINV_C_BIT_START                                 0U
#define L2WBINV_C_BIT_END                                   31U

/* Definition for field I in Register L2INV */
#define L2INV_I_BIT_START                                   0U
#define L2INV_I_BIT_END                                     31U

/* Definition for field I in Register L1PINV */
#define L1PINV_I_BIT_START                                  0U
#define L1PINV_I_BIT_END                                    31U

/* Definition for field C in Register L1DWB */
#define L1DWB_C_BIT_START                                   0U
#define L1DWB_C_BIT_END                                     31U

/* Definition for field C in Register L1DWBINV */
#define L1DWBINV_C_BIT_START                                0U
#define L1DWBINV_C_BIT_END                                  31U

/* Definition for field I in Register L1DINV */
#define L1DINV_I_BIT_START                                  0U
#define L1DINV_I_BIT_END                                    31U

/* Definition for field RESV1 in Register L2EDSTAT */
#define L2EDSTAT_RESV1_BIT_START                            24U
#define L2EDSTAT_RESV1_BIT_END                              31U

/* Definition for field BITPOS in Register L2EDSTAT */
#define L2EDSTAT_BITPOS_BIT_START                           16U
#define L2EDSTAT_BITPOS_BIT_END                             23U

/* Definition for field RESV2 in Register L2EDSTAT */
#define L2EDSTAT_RESV2_BIT_START                            10U
#define L2EDSTAT_RESV2_BIT_END                              15U

/* Definition for field NERR in Register L2EDSTAT */
#define L2EDSTAT_NERR_BIT_START                             8U
#define L2EDSTAT_NERR_BIT_END                               9U

/* Definition for field VERR in Register L2EDSTAT */
#define L2EDSTAT_VERR_BIT_START                             7U
#define L2EDSTAT_VERR_BIT_END                               7U

/* Definition for field DMAERR in Register L2EDSTAT */
#define L2EDSTAT_DMAERR_BIT_START                           6U
#define L2EDSTAT_DMAERR_BIT_END                             6U

/* Definition for field PERR in Register L2EDSTAT */
#define L2EDSTAT_PERR_BIT_START                             5U
#define L2EDSTAT_PERR_BIT_END                               5U

/* Definition for field DERR in Register L2EDSTAT */
#define L2EDSTAT_DERR_BIT_START                             4U
#define L2EDSTAT_DERR_BIT_END                               4U

/* Definition for field SUSP in Register L2EDSTAT */
#define L2EDSTAT_SUSP_BIT_START                             3U
#define L2EDSTAT_SUSP_BIT_END                               3U

/* Definition for field DIS in Register L2EDSTAT */
#define L2EDSTAT_DIS_BIT_START                              2U
#define L2EDSTAT_DIS_BIT_END                                2U

/* Definition for field RESV3 in Register L2EDSTAT */
#define L2EDSTAT_RESV3_BIT_START                            1U
#define L2EDSTAT_RESV3_BIT_END                              1U

/* Definition for field EN in Register L2EDSTAT */
#define L2EDSTAT_EN_BIT_START                               0U
#define L2EDSTAT_EN_BIT_END                                 0U

/* Definition for field RESV1 in Register L2EDCMD */
#define L2EDCMD_RESV1_BIT_START                             8U
#define L2EDCMD_RESV1_BIT_END                               31U

/* Definition for field VCLR in Register L2EDCMD */
#define L2EDCMD_VCLR_BIT_START                              7U
#define L2EDCMD_VCLR_BIT_END                                7U

/* Definition for field DMACLR in Register L2EDCMD */
#define L2EDCMD_DMACLR_BIT_START                            6U
#define L2EDCMD_DMACLR_BIT_END                              6U

/* Definition for field PCLR in Register L2EDCMD */
#define L2EDCMD_PCLR_BIT_START                              5U
#define L2EDCMD_PCLR_BIT_END                                5U

/* Definition for field DCLR in Register L2EDCMD */
#define L2EDCMD_DCLR_BIT_START                              4U
#define L2EDCMD_DCLR_BIT_END                                4U

/* Definition for field SUSP in Register L2EDCMD */
#define L2EDCMD_SUSP_BIT_START                              3U
#define L2EDCMD_SUSP_BIT_END                                3U

/* Definition for field DIS in Register L2EDCMD */
#define L2EDCMD_DIS_BIT_START                               2U
#define L2EDCMD_DIS_BIT_END                                 2U

/* Definition for field RESV3 in Register L2EDCMD */
#define L2EDCMD_RESV3_BIT_START                             1U
#define L2EDCMD_RESV3_BIT_END                               1U

/* Definition for field EN in Register L2EDCMD */
#define L2EDCMD_EN_BIT_START                                0U
#define L2EDCMD_EN_BIT_END                                  0U

