0xastro/fmcw-RADAR/mmwave_sdk/packages/ti/drivers/soc/include/reg_dspicfg.h
/* Definition for field ADDR in Register L2EDADDR */
#define L2EDADDR_ADDR_BIT_START                             5U
#define L2EDADDR_ADDR_BIT_END                               31U

/* Definition for field WAY in Register L2EDADDR */
#define L2EDADDR_WAY_BIT_START                              3U
#define L2EDADDR_WAY_BIT_END                                4U

/* Definition for field RESV1 in Register L2EDADDR */
#define L2EDADDR_RESV1_BIT_START                            1U
#define L2EDADDR_RESV1_BIT_END                              2U

/* Definition for field RAM in Register L2EDADDR */
#define L2EDADDR_RAM_BIT_START                              0U
#define L2EDADDR_RAM_BIT_END                                0U

/* Definition for field L2EDPEN0 in Register L2EDPEN0 */
#define L2EDPEN0_L2EDPEN0_BIT_START                         0U
#define L2EDPEN0_L2EDPEN0_BIT_END                           31U

/* Definition for field L2EDPEN1 in Register L2EDPEN1 */
#define L2EDPEN1_L2EDPEN1_BIT_START                         0U
#define L2EDPEN1_L2EDPEN1_BIT_END                           31U

/* Definition for field RESV1 in Register L2EDCPEC */
#define L2EDCPEC_RESV1_BIT_START                            8U
#define L2EDCPEC_RESV1_BIT_END                              31U

/* Definition for field CNT in Register L2EDCPEC */
#define L2EDCPEC_CNT_BIT_START                              0U
#define L2EDCPEC_CNT_BIT_END                                7U

/* Definition for field RESV1 in Register L2EDCNEC */
#define L2EDCNEC_RESV1_BIT_START                            8U
#define L2EDCNEC_RESV1_BIT_END                              31U

/* Definition for field CNT in Register L2EDCNEC */
#define L2EDCNEC_CNT_BIT_START                              0U
#define L2EDCNEC_CNT_BIT_END                                7U

/* Definition for field ERR in Register MDMAERR */
#define MDMAERR_ERR_BIT_START                               29U
#define MDMAERR_ERR_BIT_END                                 31U

/* Definition for field RESV_2 in Register MDMAERR */
#define MDMAERR_RESV_2_BIT_START                            12U
#define MDMAERR_RESV_2_BIT_END                              28U

/* Definition for field XID in Register MDMAERR */
#define MDMAERR_XID_BIT_START                               8U
#define MDMAERR_XID_BIT_END                                 11U

/* Definition for field RESV_1 in Register MDMAERR */
#define MDMAERR_RESV_1_BIT_START                            3U
#define MDMAERR_RESV_1_BIT_END                              7U

/* Definition for field STAT in Register MDMAERR */
#define MDMAERR_STAT_BIT_START                              0U
#define MDMAERR_STAT_BIT_END                                2U

/* Definition for field RESV_1 in Register MDMAERRCLR */
#define MDMAERRCLR_RESV_1_BIT_START                         1U
#define MDMAERRCLR_RESV_1_BIT_END                           31U

/* Definition for field CLR in Register MDMAERRCLR */
#define MDMAERRCLR_CLR_BIT_START                            0U
#define MDMAERRCLR_CLR_BIT_END                              0U

/* Definition for field RESV1 in Register L2EDCEN */
#define L2EDCEN_RESV1_BIT_START                             5U
#define L2EDCEN_RESV1_BIT_END                               31U

/* Definition for field SDMAEN in Register L2EDCEN */
#define L2EDCEN_SDMAEN_BIT_START                            4U
#define L2EDCEN_SDMAEN_BIT_END                              4U

/* Definition for field PL2SEN in Register L2EDCEN */
#define L2EDCEN_PL2SEN_BIT_START                            3U
#define L2EDCEN_PL2SEN_BIT_END                              3U

/* Definition for field DL2SEN in Register L2EDCEN */
#define L2EDCEN_DL2SEN_BIT_START                            2U
#define L2EDCEN_DL2SEN_BIT_END                              2U

/* Definition for field PL2CEN in Register L2EDCEN */
#define L2EDCEN_PL2CEN_BIT_START                            1U
#define L2EDCEN_PL2CEN_BIT_END                              1U

/* Definition for field DL2CEN in Register L2EDCEN */
#define L2EDCEN_DL2CEN_BIT_START                            0U
#define L2EDCEN_DL2CEN_BIT_END                              0U

/* Definition for field RESV1 in Register L1PEDSTAT */
#define L1PEDSTAT_RESV1_BIT_START                           7U
#define L1PEDSTAT_RESV1_BIT_END                             31U

/* Definition for field DMAERR in Register L1PEDSTAT */
#define L1PEDSTAT_DMAERR_BIT_START                          6U
#define L1PEDSTAT_DMAERR_BIT_END                            6U

/* Definition for field PERR in Register L1PEDSTAT */
#define L1PEDSTAT_PERR_BIT_START                            5U
#define L1PEDSTAT_PERR_BIT_END                              5U

/* Definition for field RESV2 in Register L1PEDSTAT */
#define L1PEDSTAT_RESV2_BIT_START                           4U
#define L1PEDSTAT_RESV2_BIT_END                             4U

/* Definition for field SUSP in Register L1PEDSTAT */
#define L1PEDSTAT_SUSP_BIT_START                            3U
#define L1PEDSTAT_SUSP_BIT_END                              3U

/* Definition for field DIS in Register L1PEDSTAT */
#define L1PEDSTAT_DIS_BIT_START                             2U
#define L1PEDSTAT_DIS_BIT_END                               2U

/* Definition for field RESV3 in Register L1PEDSTAT */
#define L1PEDSTAT_RESV3_BIT_START                           1U
#define L1PEDSTAT_RESV3_BIT_END                             1U

/* Definition for field EN in Register L1PEDSTAT */
#define L1PEDSTAT_EN_BIT_START                              0U
#define L1PEDSTAT_EN_BIT_END                                0U

/* Definition for field RESV1 in Register L1PEDCMD */
#define L1PEDCMD_RESV1_BIT_START                            7U
#define L1PEDCMD_RESV1_BIT_END                              31U

/* Definition for field DMACLR in Register L1PEDCMD */
#define L1PEDCMD_DMACLR_BIT_START                           6U
#define L1PEDCMD_DMACLR_BIT_END                             6U

/* Definition for field PCLR in Register L1PEDCMD */
#define L1PEDCMD_PCLR_BIT_START                             5U
#define L1PEDCMD_PCLR_BIT_END                               5U

/* Definition for field RESV2 in Register L1PEDCMD */
#define L1PEDCMD_RESV2_BIT_START                            4U
#define L1PEDCMD_RESV2_BIT_END                              4U

/* Definition for field SUSP in Register L1PEDCMD */
#define L1PEDCMD_SUSP_BIT_START                             3U
#define L1PEDCMD_SUSP_BIT_END                               3U

