0xastro/fmcw-RADAR/mmwave_sdk/packages/ti/drivers/soc/include/reg_dspicfg.h
/* Definition for field DIS in Register L1PEDCMD */
#define L1PEDCMD_DIS_BIT_START                              2U
#define L1PEDCMD_DIS_BIT_END                                2U

/* Definition for field RESV3 in Register L1PEDCMD */
#define L1PEDCMD_RESV3_BIT_START                            1U
#define L1PEDCMD_RESV3_BIT_END                              1U

/* Definition for field EN in Register L1PEDCMD */
#define L1PEDCMD_EN_BIT_START                               0U
#define L1PEDCMD_EN_BIT_END                                 0U

/* Definition for field ADDR in Register L1PEDADDR */
#define L1PEDADDR_ADDR_BIT_START                            5U
#define L1PEDADDR_ADDR_BIT_END                              31U

/* Definition for field RESV1 in Register L1PEDADDR */
#define L1PEDADDR_RESV1_BIT_START                           1U
#define L1PEDADDR_RESV1_BIT_END                             4U

/* Definition for field RAM in Register L1PEDADDR */
#define L1PEDADDR_RAM_BIT_START                             0U
#define L1PEDADDR_RAM_BIT_END                               0U

#if 0
/* Definition for field RESV_1 in Register MAR_0 */
#define MAR_0_RESV_1_BIT_START                              4U
#define MAR_0_RESV_1_BIT_END                                31U

/* Definition for field PFX in Register MAR_0 */
#define MAR_0_PFX_BIT_START                                 3U
#define MAR_0_PFX_BIT_END                                   3U

/* Definition for field PCX in Register MAR_0 */
#define MAR_0_PCX_BIT_START                                 2U
#define MAR_0_PCX_BIT_END                                   2U

/* Definition for field WTE in Register MAR_0 */
#define MAR_0_WTE_BIT_START                                 1U
#define MAR_0_WTE_BIT_END                                   1U

/* Definition for field PC in Register MAR_0 */
#define MAR_0_PC_BIT_START                                  0U
#define MAR_0_PC_BIT_END                                    0U

/* Definition for field RESV_1 in Register MAR_1 */
#define MAR_1_RESV_1_BIT_START                              4U
#define MAR_1_RESV_1_BIT_END                                31U

/* Definition for field PFX in Register MAR_1 */
#define MAR_1_PFX_BIT_START                                 3U
#define MAR_1_PFX_BIT_END                                   3U

/* Definition for field PCX in Register MAR_1 */
#define MAR_1_PCX_BIT_START                                 2U
#define MAR_1_PCX_BIT_END                                   2U

/* Definition for field WTE in Register MAR_1 */
#define MAR_1_WTE_BIT_START                                 1U
#define MAR_1_WTE_BIT_END                                   1U

/* Definition for field PC in Register MAR_1 */
#define MAR_1_PC_BIT_START                                  0U
#define MAR_1_PC_BIT_END                                    0U

/* Definition for field RESV_1 in Register MAR_2 */
#define MAR_2_RESV_1_BIT_START                              4U
#define MAR_2_RESV_1_BIT_END                                31U

/* Definition for field PFX in Register MAR_2 */
#define MAR_2_PFX_BIT_START                                 3U
#define MAR_2_PFX_BIT_END                                   3U

/* Definition for field PCX in Register MAR_2 */
#define MAR_2_PCX_BIT_START                                 2U
#define MAR_2_PCX_BIT_END                                   2U

/* Definition for field WTE in Register MAR_2 */
#define MAR_2_WTE_BIT_START                                 1U
#define MAR_2_WTE_BIT_END                                   1U

/* Definition for field PC in Register MAR_2 */
#define MAR_2_PC_BIT_START                                  0U
#define MAR_2_PC_BIT_END                                    0U

/* Definition for field RESV_1 in Register MAR_3 */
#define MAR_3_RESV_1_BIT_START                              4U
#define MAR_3_RESV_1_BIT_END                                31U

/* Definition for field PFX in Register MAR_3 */
#define MAR_3_PFX_BIT_START                                 3U
#define MAR_3_PFX_BIT_END                                   3U

/* Definition for field PCX in Register MAR_3 */
#define MAR_3_PCX_BIT_START                                 2U
#define MAR_3_PCX_BIT_END                                   2U

/* Definition for field WTE in Register MAR_3 */
#define MAR_3_WTE_BIT_START                                 1U
#define MAR_3_WTE_BIT_END                                   1U

/* Definition for field PC in Register MAR_3 */
#define MAR_3_PC_BIT_START                                  0U
#define MAR_3_PC_BIT_END                                    0U

/* Definition for field RESV_1 in Register MAR_4 */
#define MAR_4_RESV_1_BIT_START                              4U
#define MAR_4_RESV_1_BIT_END                                31U

/* Definition for field PFX in Register MAR_4 */
#define MAR_4_PFX_BIT_START                                 3U
#define MAR_4_PFX_BIT_END                                   3U

/* Definition for field PCX in Register MAR_4 */
#define MAR_4_PCX_BIT_START                                 2U
#define MAR_4_PCX_BIT_END                                   2U

/* Definition for field WTE in Register MAR_4 */
#define MAR_4_WTE_BIT_START                                 1U
#define MAR_4_WTE_BIT_END                                   1U

/* Definition for field PC in Register MAR_4 */
#define MAR_4_PC_BIT_START                                  0U
#define MAR_4_PC_BIT_END                                    0U

/* Definition for field RESV_1 in Register MAR_5 */
#define MAR_5_RESV_1_BIT_START                              4U
#define MAR_5_RESV_1_BIT_END                                31U

/* Definition for field PFX in Register MAR_5 */
#define MAR_5_PFX_BIT_START                                 3U
#define MAR_5_PFX_BIT_END                                   3U

/* Definition for field PCX in Register MAR_5 */
#define MAR_5_PCX_BIT_START                                 2U
#define MAR_5_PCX_BIT_END                                   2U

/* Definition for field WTE in Register MAR_5 */
#define MAR_5_WTE_BIT_START                                 1U
#define MAR_5_WTE_BIT_END                                   1U

