0xastro/fmcw-RADAR/mmwave_sdk/packages/ti/drivers/soc/include/reg_dspicfg.h
/* Definition for field PC in Register MAR_5 */
#define MAR_5_PC_BIT_START                                  0U
#define MAR_5_PC_BIT_END                                    0U

/* Definition for field RESV_1 in Register MAR_6 */
#define MAR_6_RESV_1_BIT_START                              4U
#define MAR_6_RESV_1_BIT_END                                31U

/* Definition for field PFX in Register MAR_6 */
#define MAR_6_PFX_BIT_START                                 3U
#define MAR_6_PFX_BIT_END                                   3U

/* Definition for field PCX in Register MAR_6 */
#define MAR_6_PCX_BIT_START                                 2U
#define MAR_6_PCX_BIT_END                                   2U

/* Definition for field WTE in Register MAR_6 */
#define MAR_6_WTE_BIT_START                                 1U
#define MAR_6_WTE_BIT_END                                   1U

/* Definition for field PC in Register MAR_6 */
#define MAR_6_PC_BIT_START                                  0U
#define MAR_6_PC_BIT_END                                    0U

/* Definition for field RESV_1 in Register MAR_7 */
#define MAR_7_RESV_1_BIT_START                              4U
#define MAR_7_RESV_1_BIT_END                                31U

/* Definition for field PFX in Register MAR_7 */
#define MAR_7_PFX_BIT_START                                 3U
#define MAR_7_PFX_BIT_END                                   3U

/* Definition for field PCX in Register MAR_7 */
#define MAR_7_PCX_BIT_START                                 2U
#define MAR_7_PCX_BIT_END                                   2U

/* Definition for field WTE in Register MAR_7 */
#define MAR_7_WTE_BIT_START                                 1U
#define MAR_7_WTE_BIT_END                                   1U

/* Definition for field PC in Register MAR_7 */
#define MAR_7_PC_BIT_START                                  0U
#define MAR_7_PC_BIT_END                                    0U

/* Definition for field RESV_1 in Register MAR_8 */
#define MAR_8_RESV_1_BIT_START                              4U
#define MAR_8_RESV_1_BIT_END                                31U

/* Definition for field PFX in Register MAR_8 */
#define MAR_8_PFX_BIT_START                                 3U
#define MAR_8_PFX_BIT_END                                   3U

/* Definition for field PCX in Register MAR_8 */
#define MAR_8_PCX_BIT_START                                 2U
#define MAR_8_PCX_BIT_END                                   2U

/* Definition for field WTE in Register MAR_8 */
#define MAR_8_WTE_BIT_START                                 1U
#define MAR_8_WTE_BIT_END                                   1U

/* Definition for field PC in Register MAR_8 */
#define MAR_8_PC_BIT_START                                  0U
#define MAR_8_PC_BIT_END                                    0U

/* Definition for field RESV_1 in Register MAR_9 */
#define MAR_9_RESV_1_BIT_START                              4U
#define MAR_9_RESV_1_BIT_END                                31U

/* Definition for field PFX in Register MAR_9 */
#define MAR_9_PFX_BIT_START                                 3U
#define MAR_9_PFX_BIT_END                                   3U

/* Definition for field PCX in Register MAR_9 */
#define MAR_9_PCX_BIT_START                                 2U
#define MAR_9_PCX_BIT_END                                   2U

/* Definition for field WTE in Register MAR_9 */
#define MAR_9_WTE_BIT_START                                 1U
#define MAR_9_WTE_BIT_END                                   1U

/* Definition for field PC in Register MAR_9 */
#define MAR_9_PC_BIT_START                                  0U
#define MAR_9_PC_BIT_END                                    0U

/* Definition for field RESV_1 in Register MAR_10 */
#define MAR_10_RESV_1_BIT_START                             4U
#define MAR_10_RESV_1_BIT_END                               31U

/* Definition for field PFX in Register MAR_10 */
#define MAR_10_PFX_BIT_START                                3U
#define MAR_10_PFX_BIT_END                                  3U

/* Definition for field PCX in Register MAR_10 */
#define MAR_10_PCX_BIT_START                                2U
#define MAR_10_PCX_BIT_END                                  2U

/* Definition for field WTE in Register MAR_10 */
#define MAR_10_WTE_BIT_START                                1U
#define MAR_10_WTE_BIT_END                                  1U

/* Definition for field PC in Register MAR_10 */
#define MAR_10_PC_BIT_START                                 0U
#define MAR_10_PC_BIT_END                                   0U

/* Definition for field RESV_1 in Register MAR_11 */
#define MAR_11_RESV_1_BIT_START                             4U
#define MAR_11_RESV_1_BIT_END                               31U

/* Definition for field PFX in Register MAR_11 */
#define MAR_11_PFX_BIT_START                                3U
#define MAR_11_PFX_BIT_END                                  3U

/* Definition for field PCX in Register MAR_11 */
#define MAR_11_PCX_BIT_START                                2U
#define MAR_11_PCX_BIT_END                                  2U

/* Definition for field WTE in Register MAR_11 */
#define MAR_11_WTE_BIT_START                                1U
#define MAR_11_WTE_BIT_END                                  1U

/* Definition for field PC in Register MAR_11 */
#define MAR_11_PC_BIT_START                                 0U
#define MAR_11_PC_BIT_END                                   0U

/* Definition for field RESV_1 in Register MAR_12 */
#define MAR_12_RESV_1_BIT_START                             4U
#define MAR_12_RESV_1_BIT_END                               31U

/* Definition for field PFX in Register MAR_12 */
#define MAR_12_PFX_BIT_START                                3U
#define MAR_12_PFX_BIT_END                                  3U

/* Definition for field PCX in Register MAR_12 */
#define MAR_12_PCX_BIT_START                                2U
#define MAR_12_PCX_BIT_END                                  2U

/* Definition for field WTE in Register MAR_12 */
#define MAR_12_WTE_BIT_START                                1U
#define MAR_12_WTE_BIT_END                                  1U

