0xastro/fmcw-RADAR/mmwave_sdk/packages/ti/drivers/soc/include/reg_dspicfg.h
/* Definition for field PC in Register MAR_12 */
#define MAR_12_PC_BIT_START                                 0U
#define MAR_12_PC_BIT_END                                   0U

/* Definition for field RESV_1 in Register MAR_13 */
#define MAR_13_RESV_1_BIT_START                             4U
#define MAR_13_RESV_1_BIT_END                               31U

/* Definition for field PFX in Register MAR_13 */
#define MAR_13_PFX_BIT_START                                3U
#define MAR_13_PFX_BIT_END                                  3U

/* Definition for field PCX in Register MAR_13 */
#define MAR_13_PCX_BIT_START                                2U
#define MAR_13_PCX_BIT_END                                  2U

/* Definition for field WTE in Register MAR_13 */
#define MAR_13_WTE_BIT_START                                1U
#define MAR_13_WTE_BIT_END                                  1U

/* Definition for field PC in Register MAR_13 */
#define MAR_13_PC_BIT_START                                 0U
#define MAR_13_PC_BIT_END                                   0U

/* Definition for field RESV_1 in Register MAR_14 */
#define MAR_14_RESV_1_BIT_START                             4U
#define MAR_14_RESV_1_BIT_END                               31U

/* Definition for field PFX in Register MAR_14 */
#define MAR_14_PFX_BIT_START                                3U
#define MAR_14_PFX_BIT_END                                  3U

/* Definition for field PCX in Register MAR_14 */
#define MAR_14_PCX_BIT_START                                2U
#define MAR_14_PCX_BIT_END                                  2U

/* Definition for field WTE in Register MAR_14 */
#define MAR_14_WTE_BIT_START                                1U
#define MAR_14_WTE_BIT_END                                  1U

/* Definition for field PC in Register MAR_14 */
#define MAR_14_PC_BIT_START                                 0U
#define MAR_14_PC_BIT_END                                   0U

/* Definition for field RESV_1 in Register MAR_15 */
#define MAR_15_RESV_1_BIT_START                             4U
#define MAR_15_RESV_1_BIT_END                               31U

/* Definition for field PFX in Register MAR_15 */
#define MAR_15_PFX_BIT_START                                3U
#define MAR_15_PFX_BIT_END                                  3U

/* Definition for field PCX in Register MAR_15 */
#define MAR_15_PCX_BIT_START                                2U
#define MAR_15_PCX_BIT_END                                  2U

/* Definition for field WTE in Register MAR_15 */
#define MAR_15_WTE_BIT_START                                1U
#define MAR_15_WTE_BIT_END                                  1U

/* Definition for field PC in Register MAR_15 */
#define MAR_15_PC_BIT_START                                 0U
#define MAR_15_PC_BIT_END                                   0U

/* Definition for field RESV_1 in Register MAR_16 */
#define MAR_16_RESV_1_BIT_START                             4U
#define MAR_16_RESV_1_BIT_END                               31U

/* Definition for field PFX in Register MAR_16 */
#define MAR_16_PFX_BIT_START                                3U
#define MAR_16_PFX_BIT_END                                  3U

/* Definition for field PCX in Register MAR_16 */
#define MAR_16_PCX_BIT_START                                2U
#define MAR_16_PCX_BIT_END                                  2U

/* Definition for field WTE in Register MAR_16 */
#define MAR_16_WTE_BIT_START                                1U
#define MAR_16_WTE_BIT_END                                  1U

/* Definition for field PC in Register MAR_16 */
#define MAR_16_PC_BIT_START                                 0U
#define MAR_16_PC_BIT_END                                   0U

/* Definition for field RESV_1 in Register MAR_17 */
#define MAR_17_RESV_1_BIT_START                             4U
#define MAR_17_RESV_1_BIT_END                               31U

/* Definition for field PFX in Register MAR_17 */
#define MAR_17_PFX_BIT_START                                3U
#define MAR_17_PFX_BIT_END                                  3U

/* Definition for field PCX in Register MAR_17 */
#define MAR_17_PCX_BIT_START                                2U
#define MAR_17_PCX_BIT_END                                  2U

/* Definition for field WTE in Register MAR_17 */
#define MAR_17_WTE_BIT_START                                1U
#define MAR_17_WTE_BIT_END                                  1U

/* Definition for field PC in Register MAR_17 */
#define MAR_17_PC_BIT_START                                 0U
#define MAR_17_PC_BIT_END                                   0U

/* Definition for field RESV_1 in Register MAR_18 */
#define MAR_18_RESV_1_BIT_START                             4U
#define MAR_18_RESV_1_BIT_END                               31U

/* Definition for field PFX in Register MAR_18 */
#define MAR_18_PFX_BIT_START                                3U
#define MAR_18_PFX_BIT_END                                  3U

/* Definition for field PCX in Register MAR_18 */
#define MAR_18_PCX_BIT_START                                2U
#define MAR_18_PCX_BIT_END                                  2U

/* Definition for field WTE in Register MAR_18 */
#define MAR_18_WTE_BIT_START                                1U
#define MAR_18_WTE_BIT_END                                  1U

/* Definition for field PC in Register MAR_18 */
#define MAR_18_PC_BIT_START                                 0U
#define MAR_18_PC_BIT_END                                   0U

/* Definition for field RESV_1 in Register MAR_19 */
#define MAR_19_RESV_1_BIT_START                             4U
#define MAR_19_RESV_1_BIT_END                               31U

/* Definition for field PFX in Register MAR_19 */
#define MAR_19_PFX_BIT_START                                3U
#define MAR_19_PFX_BIT_END                                  3U

/* Definition for field PCX in Register MAR_19 */
#define MAR_19_PCX_BIT_START                                2U
#define MAR_19_PCX_BIT_END                                  2U

/* Definition for field WTE in Register MAR_19 */
#define MAR_19_WTE_BIT_START                                1U
#define MAR_19_WTE_BIT_END                                  1U

/* Definition for field PC in Register MAR_19 */
#define MAR_19_PC_BIT_START                                 0U
#define MAR_19_PC_BIT_END                                   0U

/* Definition for field RESV_1 in Register MAR_20 */
#define MAR_20_RESV_1_BIT_START                             4U
#define MAR_20_RESV_1_BIT_END                               31U

/* Definition for field PFX in Register MAR_20 */
#define MAR_20_PFX_BIT_START                                3U
#define MAR_20_PFX_BIT_END                                  3U

/* Definition for field PCX in Register MAR_20 */
#define MAR_20_PCX_BIT_START                                2U
#define MAR_20_PCX_BIT_END                                  2U

/* Definition for field WTE in Register MAR_20 */
#define MAR_20_WTE_BIT_START                                1U
#define MAR_20_WTE_BIT_END                                  1U

/* Definition for field PC in Register MAR_20 */
#define MAR_20_PC_BIT_START                                 0U
#define MAR_20_PC_BIT_END                                   0U

/* Definition for field RESV_1 in Register MAR_21 */
#define MAR_21_RESV_1_BIT_START                             4U
#define MAR_21_RESV_1_BIT_END                               31U

/* Definition for field PFX in Register MAR_21 */
#define MAR_21_PFX_BIT_START                                3U
#define MAR_21_PFX_BIT_END                                  3U

/* Definition for field PCX in Register MAR_21 */
#define MAR_21_PCX_BIT_START                                2U
#define MAR_21_PCX_BIT_END                                  2U

