0xastro/fmcw-RADAR/mmwave_sdk/packages/ti/drivers/soc/include/reg_dspicfg.h
/* Definition for field WTE in Register MAR_21 */
#define MAR_21_WTE_BIT_START                                1U
#define MAR_21_WTE_BIT_END                                  1U

/* Definition for field PC in Register MAR_21 */
#define MAR_21_PC_BIT_START                                 0U
#define MAR_21_PC_BIT_END                                   0U

/* Definition for field RESV_1 in Register MAR_22 */
#define MAR_22_RESV_1_BIT_START                             4U
#define MAR_22_RESV_1_BIT_END                               31U

/* Definition for field PFX in Register MAR_22 */
#define MAR_22_PFX_BIT_START                                3U
#define MAR_22_PFX_BIT_END                                  3U

/* Definition for field PCX in Register MAR_22 */
#define MAR_22_PCX_BIT_START                                2U
#define MAR_22_PCX_BIT_END                                  2U

/* Definition for field WTE in Register MAR_22 */
#define MAR_22_WTE_BIT_START                                1U
#define MAR_22_WTE_BIT_END                                  1U

/* Definition for field PC in Register MAR_22 */
#define MAR_22_PC_BIT_START                                 0U
#define MAR_22_PC_BIT_END                                   0U

/* Definition for field RESV_1 in Register MAR_23 */
#define MAR_23_RESV_1_BIT_START                             4U
#define MAR_23_RESV_1_BIT_END                               31U

/* Definition for field PFX in Register MAR_23 */
#define MAR_23_PFX_BIT_START                                3U
#define MAR_23_PFX_BIT_END                                  3U

/* Definition for field PCX in Register MAR_23 */
#define MAR_23_PCX_BIT_START                                2U
#define MAR_23_PCX_BIT_END                                  2U

/* Definition for field WTE in Register MAR_23 */
#define MAR_23_WTE_BIT_START                                1U
#define MAR_23_WTE_BIT_END                                  1U

/* Definition for field PC in Register MAR_23 */
#define MAR_23_PC_BIT_START                                 0U
#define MAR_23_PC_BIT_END                                   0U

/* Definition for field RESV_1 in Register MAR_24 */
#define MAR_24_RESV_1_BIT_START                             4U
#define MAR_24_RESV_1_BIT_END                               31U

/* Definition for field PFX in Register MAR_24 */
#define MAR_24_PFX_BIT_START                                3U
#define MAR_24_PFX_BIT_END                                  3U

/* Definition for field PCX in Register MAR_24 */
#define MAR_24_PCX_BIT_START                                2U
#define MAR_24_PCX_BIT_END                                  2U

/* Definition for field WTE in Register MAR_24 */
#define MAR_24_WTE_BIT_START                                1U
#define MAR_24_WTE_BIT_END                                  1U

/* Definition for field PC in Register MAR_24 */
#define MAR_24_PC_BIT_START                                 0U
#define MAR_24_PC_BIT_END                                   0U

/* Definition for field RESV_1 in Register MAR_25 */
#define MAR_25_RESV_1_BIT_START                             4U
#define MAR_25_RESV_1_BIT_END                               31U

/* Definition for field PFX in Register MAR_25 */
#define MAR_25_PFX_BIT_START                                3U
#define MAR_25_PFX_BIT_END                                  3U

/* Definition for field PCX in Register MAR_25 */
#define MAR_25_PCX_BIT_START                                2U
#define MAR_25_PCX_BIT_END                                  2U

/* Definition for field WTE in Register MAR_25 */
#define MAR_25_WTE_BIT_START                                1U
#define MAR_25_WTE_BIT_END                                  1U

/* Definition for field PC in Register MAR_25 */
#define MAR_25_PC_BIT_START                                 0U
#define MAR_25_PC_BIT_END                                   0U

/* Definition for field RESV_1 in Register MAR_26 */
#define MAR_26_RESV_1_BIT_START                             4U
#define MAR_26_RESV_1_BIT_END                               31U

/* Definition for field PFX in Register MAR_26 */
#define MAR_26_PFX_BIT_START                                3U
#define MAR_26_PFX_BIT_END                                  3U

/* Definition for field PCX in Register MAR_26 */
#define MAR_26_PCX_BIT_START                                2U
#define MAR_26_PCX_BIT_END                                  2U

/* Definition for field WTE in Register MAR_26 */
#define MAR_26_WTE_BIT_START                                1U
#define MAR_26_WTE_BIT_END                                  1U

/* Definition for field PC in Register MAR_26 */
#define MAR_26_PC_BIT_START                                 0U
#define MAR_26_PC_BIT_END                                   0U

/* Definition for field RESV_1 in Register MAR_27 */
#define MAR_27_RESV_1_BIT_START                             4U
#define MAR_27_RESV_1_BIT_END                               31U

/* Definition for field PFX in Register MAR_27 */
#define MAR_27_PFX_BIT_START                                3U
#define MAR_27_PFX_BIT_END                                  3U

/* Definition for field PCX in Register MAR_27 */
#define MAR_27_PCX_BIT_START                                2U
#define MAR_27_PCX_BIT_END                                  2U

/* Definition for field WTE in Register MAR_27 */
#define MAR_27_WTE_BIT_START                                1U
#define MAR_27_WTE_BIT_END                                  1U

/* Definition for field PC in Register MAR_27 */
#define MAR_27_PC_BIT_START                                 0U
#define MAR_27_PC_BIT_END                                   0U

/* Definition for field RESV_1 in Register MAR_28 */
#define MAR_28_RESV_1_BIT_START                             4U
#define MAR_28_RESV_1_BIT_END                               31U

/* Definition for field PFX in Register MAR_28 */
#define MAR_28_PFX_BIT_START                                3U
#define MAR_28_PFX_BIT_END                                  3U

/* Definition for field PCX in Register MAR_28 */
#define MAR_28_PCX_BIT_START                                2U
#define MAR_28_PCX_BIT_END                                  2U

/* Definition for field WTE in Register MAR_28 */
#define MAR_28_WTE_BIT_START                                1U
#define MAR_28_WTE_BIT_END                                  1U

