0xastro/fmcw-RADAR/mmwave_sdk/packages/ti/drivers/soc/include/reg_dspicfg.h
/* Definition for field PC in Register MAR_28 */
#define MAR_28_PC_BIT_START                                 0U
#define MAR_28_PC_BIT_END                                   0U

/* Definition for field RESV_1 in Register MAR_29 */
#define MAR_29_RESV_1_BIT_START                             4U
#define MAR_29_RESV_1_BIT_END                               31U

/* Definition for field PFX in Register MAR_29 */
#define MAR_29_PFX_BIT_START                                3U
#define MAR_29_PFX_BIT_END                                  3U

/* Definition for field PCX in Register MAR_29 */
#define MAR_29_PCX_BIT_START                                2U
#define MAR_29_PCX_BIT_END                                  2U

/* Definition for field WTE in Register MAR_29 */
#define MAR_29_WTE_BIT_START                                1U
#define MAR_29_WTE_BIT_END                                  1U

/* Definition for field PC in Register MAR_29 */
#define MAR_29_PC_BIT_START                                 0U
#define MAR_29_PC_BIT_END                                   0U

/* Definition for field RESV_1 in Register MAR_30 */
#define MAR_30_RESV_1_BIT_START                             4U
#define MAR_30_RESV_1_BIT_END                               31U

/* Definition for field PFX in Register MAR_30 */
#define MAR_30_PFX_BIT_START                                3U
#define MAR_30_PFX_BIT_END                                  3U

/* Definition for field PCX in Register MAR_30 */
#define MAR_30_PCX_BIT_START                                2U
#define MAR_30_PCX_BIT_END                                  2U

/* Definition for field WTE in Register MAR_30 */
#define MAR_30_WTE_BIT_START                                1U
#define MAR_30_WTE_BIT_END                                  1U

/* Definition for field PC in Register MAR_30 */
#define MAR_30_PC_BIT_START                                 0U
#define MAR_30_PC_BIT_END                                   0U

/* Definition for field RESV_1 in Register MAR_31 */
#define MAR_31_RESV_1_BIT_START                             4U
#define MAR_31_RESV_1_BIT_END                               31U

/* Definition for field PFX in Register MAR_31 */
#define MAR_31_PFX_BIT_START                                3U
#define MAR_31_PFX_BIT_END                                  3U

/* Definition for field PCX in Register MAR_31 */
#define MAR_31_PCX_BIT_START                                2U
#define MAR_31_PCX_BIT_END                                  2U

/* Definition for field WTE in Register MAR_31 */
#define MAR_31_WTE_BIT_START                                1U
#define MAR_31_WTE_BIT_END                                  1U

/* Definition for field PC in Register MAR_31 */
#define MAR_31_PC_BIT_START                                 0U
#define MAR_31_PC_BIT_END                                   0U

/* Definition for field RESV_1 in Register MAR_32 */
#define MAR_32_RESV_1_BIT_START                             4U
#define MAR_32_RESV_1_BIT_END                               31U

/* Definition for field PFX in Register MAR_32 */
#define MAR_32_PFX_BIT_START                                3U
#define MAR_32_PFX_BIT_END                                  3U

/* Definition for field PCX in Register MAR_32 */
#define MAR_32_PCX_BIT_START                                2U
#define MAR_32_PCX_BIT_END                                  2U

/* Definition for field WTE in Register MAR_32 */
#define MAR_32_WTE_BIT_START                                1U
#define MAR_32_WTE_BIT_END                                  1U

/* Definition for field PC in Register MAR_32 */
#define MAR_32_PC_BIT_START                                 0U
#define MAR_32_PC_BIT_END                                   0U

/* Definition for field RESV_1 in Register MAR_33 */
#define MAR_33_RESV_1_BIT_START                             4U
#define MAR_33_RESV_1_BIT_END                               31U

/* Definition for field PFX in Register MAR_33 */
#define MAR_33_PFX_BIT_START                                3U
#define MAR_33_PFX_BIT_END                                  3U

/* Definition for field PCX in Register MAR_33 */
#define MAR_33_PCX_BIT_START                                2U
#define MAR_33_PCX_BIT_END                                  2U

/* Definition for field WTE in Register MAR_33 */
#define MAR_33_WTE_BIT_START                                1U
#define MAR_33_WTE_BIT_END                                  1U

/* Definition for field PC in Register MAR_33 */
#define MAR_33_PC_BIT_START                                 0U
#define MAR_33_PC_BIT_END                                   0U

/* Definition for field RESV_1 in Register MAR_34 */
#define MAR_34_RESV_1_BIT_START                             4U
#define MAR_34_RESV_1_BIT_END                               31U

/* Definition for field PFX in Register MAR_34 */
#define MAR_34_PFX_BIT_START                                3U
#define MAR_34_PFX_BIT_END                                  3U

/* Definition for field PCX in Register MAR_34 */
#define MAR_34_PCX_BIT_START                                2U
#define MAR_34_PCX_BIT_END                                  2U

/* Definition for field WTE in Register MAR_34 */
#define MAR_34_WTE_BIT_START                                1U
#define MAR_34_WTE_BIT_END                                  1U

/* Definition for field PC in Register MAR_34 */
#define MAR_34_PC_BIT_START                                 0U
#define MAR_34_PC_BIT_END                                   0U

/* Definition for field RESV_1 in Register MAR_35 */
#define MAR_35_RESV_1_BIT_START                             4U
#define MAR_35_RESV_1_BIT_END                               31U

/* Definition for field PFX in Register MAR_35 */
#define MAR_35_PFX_BIT_START                                3U
#define MAR_35_PFX_BIT_END                                  3U

/* Definition for field PCX in Register MAR_35 */
#define MAR_35_PCX_BIT_START                                2U
#define MAR_35_PCX_BIT_END                                  2U

/* Definition for field WTE in Register MAR_35 */
#define MAR_35_WTE_BIT_START                                1U
#define MAR_35_WTE_BIT_END                                  1U

/* Definition for field PC in Register MAR_35 */
#define MAR_35_PC_BIT_START                                 0U
#define MAR_35_PC_BIT_END                                   0U

/* Definition for field RESV_1 in Register MAR_36 */
#define MAR_36_RESV_1_BIT_START                             4U
#define MAR_36_RESV_1_BIT_END                               31U

/* Definition for field PFX in Register MAR_36 */
#define MAR_36_PFX_BIT_START                                3U
#define MAR_36_PFX_BIT_END                                  3U

/* Definition for field PCX in Register MAR_36 */
#define MAR_36_PCX_BIT_START                                2U
#define MAR_36_PCX_BIT_END                                  2U

/* Definition for field WTE in Register MAR_36 */
#define MAR_36_WTE_BIT_START                                1U
#define MAR_36_WTE_BIT_END                                  1U

/* Definition for field PC in Register MAR_36 */
#define MAR_36_PC_BIT_START                                 0U
#define MAR_36_PC_BIT_END                                   0U

/* Definition for field RESV_1 in Register MAR_37 */
#define MAR_37_RESV_1_BIT_START                             4U
#define MAR_37_RESV_1_BIT_END                               31U

/* Definition for field PFX in Register MAR_37 */
#define MAR_37_PFX_BIT_START                                3U
#define MAR_37_PFX_BIT_END                                  3U

/* Definition for field PCX in Register MAR_37 */
#define MAR_37_PCX_BIT_START                                2U
#define MAR_37_PCX_BIT_END                                  2U

