0xastro/fmcw-RADAR/mmwave_sdk/packages/ti/drivers/soc/include/reg_dspicfg.h
/* Definition for field WTE in Register MAR_37 */
#define MAR_37_WTE_BIT_START                                1U
#define MAR_37_WTE_BIT_END                                  1U

/* Definition for field PC in Register MAR_37 */
#define MAR_37_PC_BIT_START                                 0U
#define MAR_37_PC_BIT_END                                   0U

/* Definition for field RESV_1 in Register MAR_38 */
#define MAR_38_RESV_1_BIT_START                             4U
#define MAR_38_RESV_1_BIT_END                               31U

/* Definition for field PFX in Register MAR_38 */
#define MAR_38_PFX_BIT_START                                3U
#define MAR_38_PFX_BIT_END                                  3U

/* Definition for field PCX in Register MAR_38 */
#define MAR_38_PCX_BIT_START                                2U
#define MAR_38_PCX_BIT_END                                  2U

/* Definition for field WTE in Register MAR_38 */
#define MAR_38_WTE_BIT_START                                1U
#define MAR_38_WTE_BIT_END                                  1U

/* Definition for field PC in Register MAR_38 */
#define MAR_38_PC_BIT_START                                 0U
#define MAR_38_PC_BIT_END                                   0U

/* Definition for field RESV_1 in Register MAR_39 */
#define MAR_39_RESV_1_BIT_START                             4U
#define MAR_39_RESV_1_BIT_END                               31U

/* Definition for field PFX in Register MAR_39 */
#define MAR_39_PFX_BIT_START                                3U
#define MAR_39_PFX_BIT_END                                  3U

/* Definition for field PCX in Register MAR_39 */
#define MAR_39_PCX_BIT_START                                2U
#define MAR_39_PCX_BIT_END                                  2U

/* Definition for field WTE in Register MAR_39 */
#define MAR_39_WTE_BIT_START                                1U
#define MAR_39_WTE_BIT_END                                  1U

/* Definition for field PC in Register MAR_39 */
#define MAR_39_PC_BIT_START                                 0U
#define MAR_39_PC_BIT_END                                   0U

/* Definition for field RESV_1 in Register MAR_40 */
#define MAR_40_RESV_1_BIT_START                             4U
#define MAR_40_RESV_1_BIT_END                               31U

/* Definition for field PFX in Register MAR_40 */
#define MAR_40_PFX_BIT_START                                3U
#define MAR_40_PFX_BIT_END                                  3U

/* Definition for field PCX in Register MAR_40 */
#define MAR_40_PCX_BIT_START                                2U
#define MAR_40_PCX_BIT_END                                  2U

/* Definition for field WTE in Register MAR_40 */
#define MAR_40_WTE_BIT_START                                1U
#define MAR_40_WTE_BIT_END                                  1U

/* Definition for field PC in Register MAR_40 */
#define MAR_40_PC_BIT_START                                 0U
#define MAR_40_PC_BIT_END                                   0U

/* Definition for field RESV_1 in Register MAR_41 */
#define MAR_41_RESV_1_BIT_START                             4U
#define MAR_41_RESV_1_BIT_END                               31U

/* Definition for field PFX in Register MAR_41 */
#define MAR_41_PFX_BIT_START                                3U
#define MAR_41_PFX_BIT_END                                  3U

/* Definition for field PCX in Register MAR_41 */
#define MAR_41_PCX_BIT_START                                2U
#define MAR_41_PCX_BIT_END                                  2U

/* Definition for field WTE in Register MAR_41 */
#define MAR_41_WTE_BIT_START                                1U
#define MAR_41_WTE_BIT_END                                  1U

/* Definition for field PC in Register MAR_41 */
#define MAR_41_PC_BIT_START                                 0U
#define MAR_41_PC_BIT_END                                   0U

/* Definition for field RESV_1 in Register MAR_42 */
#define MAR_42_RESV_1_BIT_START                             4U
#define MAR_42_RESV_1_BIT_END                               31U

/* Definition for field PFX in Register MAR_42 */
#define MAR_42_PFX_BIT_START                                3U
#define MAR_42_PFX_BIT_END                                  3U

/* Definition for field PCX in Register MAR_42 */
#define MAR_42_PCX_BIT_START                                2U
#define MAR_42_PCX_BIT_END                                  2U

/* Definition for field WTE in Register MAR_42 */
#define MAR_42_WTE_BIT_START                                1U
#define MAR_42_WTE_BIT_END                                  1U

/* Definition for field PC in Register MAR_42 */
#define MAR_42_PC_BIT_START                                 0U
#define MAR_42_PC_BIT_END                                   0U

/* Definition for field RESV_1 in Register MAR_43 */
#define MAR_43_RESV_1_BIT_START                             4U
#define MAR_43_RESV_1_BIT_END                               31U

/* Definition for field PFX in Register MAR_43 */
#define MAR_43_PFX_BIT_START                                3U
#define MAR_43_PFX_BIT_END                                  3U

/* Definition for field PCX in Register MAR_43 */
#define MAR_43_PCX_BIT_START                                2U
#define MAR_43_PCX_BIT_END                                  2U

/* Definition for field WTE in Register MAR_43 */
#define MAR_43_WTE_BIT_START                                1U
#define MAR_43_WTE_BIT_END                                  1U

/* Definition for field PC in Register MAR_43 */
#define MAR_43_PC_BIT_START                                 0U
#define MAR_43_PC_BIT_END                                   0U

/* Definition for field RESV_1 in Register MAR_44 */
#define MAR_44_RESV_1_BIT_START                             4U
#define MAR_44_RESV_1_BIT_END                               31U

/* Definition for field PFX in Register MAR_44 */
#define MAR_44_PFX_BIT_START                                3U
#define MAR_44_PFX_BIT_END                                  3U

/* Definition for field PCX in Register MAR_44 */
#define MAR_44_PCX_BIT_START                                2U
#define MAR_44_PCX_BIT_END                                  2U

/* Definition for field WTE in Register MAR_44 */
#define MAR_44_WTE_BIT_START                                1U
#define MAR_44_WTE_BIT_END                                  1U

