0xastro/fmcw-RADAR/mmwave_sdk/packages/ti/drivers/soc/include/reg_dspicfg.h
/* Definition for field PC in Register MAR_44 */
#define MAR_44_PC_BIT_START                                 0U
#define MAR_44_PC_BIT_END                                   0U

/* Definition for field RESV_1 in Register MAR_45 */
#define MAR_45_RESV_1_BIT_START                             4U
#define MAR_45_RESV_1_BIT_END                               31U

/* Definition for field PFX in Register MAR_45 */
#define MAR_45_PFX_BIT_START                                3U
#define MAR_45_PFX_BIT_END                                  3U

/* Definition for field PCX in Register MAR_45 */
#define MAR_45_PCX_BIT_START                                2U
#define MAR_45_PCX_BIT_END                                  2U

/* Definition for field WTE in Register MAR_45 */
#define MAR_45_WTE_BIT_START                                1U
#define MAR_45_WTE_BIT_END                                  1U

/* Definition for field PC in Register MAR_45 */
#define MAR_45_PC_BIT_START                                 0U
#define MAR_45_PC_BIT_END                                   0U

/* Definition for field RESV_1 in Register MAR_46 */
#define MAR_46_RESV_1_BIT_START                             4U
#define MAR_46_RESV_1_BIT_END                               31U

/* Definition for field PFX in Register MAR_46 */
#define MAR_46_PFX_BIT_START                                3U
#define MAR_46_PFX_BIT_END                                  3U

/* Definition for field PCX in Register MAR_46 */
#define MAR_46_PCX_BIT_START                                2U
#define MAR_46_PCX_BIT_END                                  2U

/* Definition for field WTE in Register MAR_46 */
#define MAR_46_WTE_BIT_START                                1U
#define MAR_46_WTE_BIT_END                                  1U

/* Definition for field PC in Register MAR_46 */
#define MAR_46_PC_BIT_START                                 0U
#define MAR_46_PC_BIT_END                                   0U

/* Definition for field RESV_1 in Register MAR_47 */
#define MAR_47_RESV_1_BIT_START                             4U
#define MAR_47_RESV_1_BIT_END                               31U

/* Definition for field PFX in Register MAR_47 */
#define MAR_47_PFX_BIT_START                                3U
#define MAR_47_PFX_BIT_END                                  3U

/* Definition for field PCX in Register MAR_47 */
#define MAR_47_PCX_BIT_START                                2U
#define MAR_47_PCX_BIT_END                                  2U

/* Definition for field WTE in Register MAR_47 */
#define MAR_47_WTE_BIT_START                                1U
#define MAR_47_WTE_BIT_END                                  1U

/* Definition for field PC in Register MAR_47 */
#define MAR_47_PC_BIT_START                                 0U
#define MAR_47_PC_BIT_END                                   0U

/* Definition for field RESV_1 in Register MAR_48 */
#define MAR_48_RESV_1_BIT_START                             4U
#define MAR_48_RESV_1_BIT_END                               31U

/* Definition for field PFX in Register MAR_48 */
#define MAR_48_PFX_BIT_START                                3U
#define MAR_48_PFX_BIT_END                                  3U

/* Definition for field PCX in Register MAR_48 */
#define MAR_48_PCX_BIT_START                                2U
#define MAR_48_PCX_BIT_END                                  2U

/* Definition for field WTE in Register MAR_48 */
#define MAR_48_WTE_BIT_START                                1U
#define MAR_48_WTE_BIT_END                                  1U

/* Definition for field PC in Register MAR_48 */
#define MAR_48_PC_BIT_START                                 0U
#define MAR_48_PC_BIT_END                                   0U

/* Definition for field RESV_1 in Register MAR_49 */
#define MAR_49_RESV_1_BIT_START                             4U
#define MAR_49_RESV_1_BIT_END                               31U

/* Definition for field PFX in Register MAR_49 */
#define MAR_49_PFX_BIT_START                                3U
#define MAR_49_PFX_BIT_END                                  3U

/* Definition for field PCX in Register MAR_49 */
#define MAR_49_PCX_BIT_START                                2U
#define MAR_49_PCX_BIT_END                                  2U

/* Definition for field WTE in Register MAR_49 */
#define MAR_49_WTE_BIT_START                                1U
#define MAR_49_WTE_BIT_END                                  1U

/* Definition for field PC in Register MAR_49 */
#define MAR_49_PC_BIT_START                                 0U
#define MAR_49_PC_BIT_END                                   0U

/* Definition for field RESV_1 in Register MAR_50 */
#define MAR_50_RESV_1_BIT_START                             4U
#define MAR_50_RESV_1_BIT_END                               31U

/* Definition for field PFX in Register MAR_50 */
#define MAR_50_PFX_BIT_START                                3U
#define MAR_50_PFX_BIT_END                                  3U

/* Definition for field PCX in Register MAR_50 */
#define MAR_50_PCX_BIT_START                                2U
#define MAR_50_PCX_BIT_END                                  2U

/* Definition for field WTE in Register MAR_50 */
#define MAR_50_WTE_BIT_START                                1U
#define MAR_50_WTE_BIT_END                                  1U

/* Definition for field PC in Register MAR_50 */
#define MAR_50_PC_BIT_START                                 0U
#define MAR_50_PC_BIT_END                                   0U

/* Definition for field RESV_1 in Register MAR_51 */
#define MAR_51_RESV_1_BIT_START                             4U
#define MAR_51_RESV_1_BIT_END                               31U

/* Definition for field PFX in Register MAR_51 */
#define MAR_51_PFX_BIT_START                                3U
#define MAR_51_PFX_BIT_END                                  3U

/* Definition for field PCX in Register MAR_51 */
#define MAR_51_PCX_BIT_START                                2U
#define MAR_51_PCX_BIT_END                                  2U

