0xastro/fmcw-RADAR/mmwave_sdk/packages/ti/drivers/soc/include/reg_dspicfg.h
/* Definition for field WTE in Register MAR_51 */
#define MAR_51_WTE_BIT_START                                1U
#define MAR_51_WTE_BIT_END                                  1U

/* Definition for field PC in Register MAR_51 */
#define MAR_51_PC_BIT_START                                 0U
#define MAR_51_PC_BIT_END                                   0U

/* Definition for field RESV_1 in Register MAR_52 */
#define MAR_52_RESV_1_BIT_START                             4U
#define MAR_52_RESV_1_BIT_END                               31U

/* Definition for field PFX in Register MAR_52 */
#define MAR_52_PFX_BIT_START                                3U
#define MAR_52_PFX_BIT_END                                  3U

/* Definition for field PCX in Register MAR_52 */
#define MAR_52_PCX_BIT_START                                2U
#define MAR_52_PCX_BIT_END                                  2U

/* Definition for field WTE in Register MAR_52 */
#define MAR_52_WTE_BIT_START                                1U
#define MAR_52_WTE_BIT_END                                  1U

/* Definition for field PC in Register MAR_52 */
#define MAR_52_PC_BIT_START                                 0U
#define MAR_52_PC_BIT_END                                   0U

/* Definition for field RESV_1 in Register MAR_53 */
#define MAR_53_RESV_1_BIT_START                             4U
#define MAR_53_RESV_1_BIT_END                               31U

/* Definition for field PFX in Register MAR_53 */
#define MAR_53_PFX_BIT_START                                3U
#define MAR_53_PFX_BIT_END                                  3U

/* Definition for field PCX in Register MAR_53 */
#define MAR_53_PCX_BIT_START                                2U
#define MAR_53_PCX_BIT_END                                  2U

/* Definition for field WTE in Register MAR_53 */
#define MAR_53_WTE_BIT_START                                1U
#define MAR_53_WTE_BIT_END                                  1U

/* Definition for field PC in Register MAR_53 */
#define MAR_53_PC_BIT_START                                 0U
#define MAR_53_PC_BIT_END                                   0U

/* Definition for field RESV_1 in Register MAR_54 */
#define MAR_54_RESV_1_BIT_START                             4U
#define MAR_54_RESV_1_BIT_END                               31U

/* Definition for field PFX in Register MAR_54 */
#define MAR_54_PFX_BIT_START                                3U
#define MAR_54_PFX_BIT_END                                  3U

/* Definition for field PCX in Register MAR_54 */
#define MAR_54_PCX_BIT_START                                2U
#define MAR_54_PCX_BIT_END                                  2U

/* Definition for field WTE in Register MAR_54 */
#define MAR_54_WTE_BIT_START                                1U
#define MAR_54_WTE_BIT_END                                  1U

/* Definition for field PC in Register MAR_54 */
#define MAR_54_PC_BIT_START                                 0U
#define MAR_54_PC_BIT_END                                   0U

/* Definition for field RESV_1 in Register MAR_55 */
#define MAR_55_RESV_1_BIT_START                             4U
#define MAR_55_RESV_1_BIT_END                               31U

/* Definition for field PFX in Register MAR_55 */
#define MAR_55_PFX_BIT_START                                3U
#define MAR_55_PFX_BIT_END                                  3U

/* Definition for field PCX in Register MAR_55 */
#define MAR_55_PCX_BIT_START                                2U
#define MAR_55_PCX_BIT_END                                  2U

/* Definition for field WTE in Register MAR_55 */
#define MAR_55_WTE_BIT_START                                1U
#define MAR_55_WTE_BIT_END                                  1U

/* Definition for field PC in Register MAR_55 */
#define MAR_55_PC_BIT_START                                 0U
#define MAR_55_PC_BIT_END                                   0U

/* Definition for field RESV_1 in Register MAR_56 */
#define MAR_56_RESV_1_BIT_START                             4U
#define MAR_56_RESV_1_BIT_END                               31U

/* Definition for field PFX in Register MAR_56 */
#define MAR_56_PFX_BIT_START                                3U
#define MAR_56_PFX_BIT_END                                  3U

/* Definition for field PCX in Register MAR_56 */
#define MAR_56_PCX_BIT_START                                2U
#define MAR_56_PCX_BIT_END                                  2U

/* Definition for field WTE in Register MAR_56 */
#define MAR_56_WTE_BIT_START                                1U
#define MAR_56_WTE_BIT_END                                  1U

/* Definition for field PC in Register MAR_56 */
#define MAR_56_PC_BIT_START                                 0U
#define MAR_56_PC_BIT_END                                   0U

/* Definition for field RESV_1 in Register MAR_57 */
#define MAR_57_RESV_1_BIT_START                             4U
#define MAR_57_RESV_1_BIT_END                               31U

/* Definition for field PFX in Register MAR_57 */
#define MAR_57_PFX_BIT_START                                3U
#define MAR_57_PFX_BIT_END                                  3U

/* Definition for field PCX in Register MAR_57 */
#define MAR_57_PCX_BIT_START                                2U
#define MAR_57_PCX_BIT_END                                  2U

/* Definition for field WTE in Register MAR_57 */
#define MAR_57_WTE_BIT_START                                1U
#define MAR_57_WTE_BIT_END                                  1U

/* Definition for field PC in Register MAR_57 */
#define MAR_57_PC_BIT_START                                 0U
#define MAR_57_PC_BIT_END                                   0U

/* Definition for field RESV_1 in Register MAR_58 */
#define MAR_58_RESV_1_BIT_START                             4U
#define MAR_58_RESV_1_BIT_END                               31U

/* Definition for field PFX in Register MAR_58 */
#define MAR_58_PFX_BIT_START                                3U
#define MAR_58_PFX_BIT_END                                  3U

/* Definition for field PCX in Register MAR_58 */
#define MAR_58_PCX_BIT_START                                2U
#define MAR_58_PCX_BIT_END                                  2U

/* Definition for field WTE in Register MAR_58 */
#define MAR_58_WTE_BIT_START                                1U
#define MAR_58_WTE_BIT_END                                  1U

