0xastro/fmcw-RADAR/mmwave_sdk/packages/ti/drivers/soc/include/reg_dspicfg.h
/* Definition for field PC in Register MAR_58 */
#define MAR_58_PC_BIT_START                                 0U
#define MAR_58_PC_BIT_END                                   0U

/* Definition for field RESV_1 in Register MAR_59 */
#define MAR_59_RESV_1_BIT_START                             4U
#define MAR_59_RESV_1_BIT_END                               31U

/* Definition for field PFX in Register MAR_59 */
#define MAR_59_PFX_BIT_START                                3U
#define MAR_59_PFX_BIT_END                                  3U

/* Definition for field PCX in Register MAR_59 */
#define MAR_59_PCX_BIT_START                                2U
#define MAR_59_PCX_BIT_END                                  2U

/* Definition for field WTE in Register MAR_59 */
#define MAR_59_WTE_BIT_START                                1U
#define MAR_59_WTE_BIT_END                                  1U

/* Definition for field PC in Register MAR_59 */
#define MAR_59_PC_BIT_START                                 0U
#define MAR_59_PC_BIT_END                                   0U

/* Definition for field RESV_1 in Register MAR_60 */
#define MAR_60_RESV_1_BIT_START                             4U
#define MAR_60_RESV_1_BIT_END                               31U

/* Definition for field PFX in Register MAR_60 */
#define MAR_60_PFX_BIT_START                                3U
#define MAR_60_PFX_BIT_END                                  3U

/* Definition for field PCX in Register MAR_60 */
#define MAR_60_PCX_BIT_START                                2U
#define MAR_60_PCX_BIT_END                                  2U

/* Definition for field WTE in Register MAR_60 */
#define MAR_60_WTE_BIT_START                                1U
#define MAR_60_WTE_BIT_END                                  1U

/* Definition for field PC in Register MAR_60 */
#define MAR_60_PC_BIT_START                                 0U
#define MAR_60_PC_BIT_END                                   0U

/* Definition for field RESV_1 in Register MAR_61 */
#define MAR_61_RESV_1_BIT_START                             4U
#define MAR_61_RESV_1_BIT_END                               31U

/* Definition for field PFX in Register MAR_61 */
#define MAR_61_PFX_BIT_START                                3U
#define MAR_61_PFX_BIT_END                                  3U

/* Definition for field PCX in Register MAR_61 */
#define MAR_61_PCX_BIT_START                                2U
#define MAR_61_PCX_BIT_END                                  2U

/* Definition for field WTE in Register MAR_61 */
#define MAR_61_WTE_BIT_START                                1U
#define MAR_61_WTE_BIT_END                                  1U

/* Definition for field PC in Register MAR_61 */
#define MAR_61_PC_BIT_START                                 0U
#define MAR_61_PC_BIT_END                                   0U

/* Definition for field RESV_1 in Register MAR_62 */
#define MAR_62_RESV_1_BIT_START                             4U
#define MAR_62_RESV_1_BIT_END                               31U

/* Definition for field PFX in Register MAR_62 */
#define MAR_62_PFX_BIT_START                                3U
#define MAR_62_PFX_BIT_END                                  3U

/* Definition for field PCX in Register MAR_62 */
#define MAR_62_PCX_BIT_START                                2U
#define MAR_62_PCX_BIT_END                                  2U

/* Definition for field WTE in Register MAR_62 */
#define MAR_62_WTE_BIT_START                                1U
#define MAR_62_WTE_BIT_END                                  1U

/* Definition for field PC in Register MAR_62 */
#define MAR_62_PC_BIT_START                                 0U
#define MAR_62_PC_BIT_END                                   0U

/* Definition for field RESV_1 in Register MAR_63 */
#define MAR_63_RESV_1_BIT_START                             4U
#define MAR_63_RESV_1_BIT_END                               31U

/* Definition for field PFX in Register MAR_63 */
#define MAR_63_PFX_BIT_START                                3U
#define MAR_63_PFX_BIT_END                                  3U

/* Definition for field PCX in Register MAR_63 */
#define MAR_63_PCX_BIT_START                                2U
#define MAR_63_PCX_BIT_END                                  2U

/* Definition for field WTE in Register MAR_63 */
#define MAR_63_WTE_BIT_START                                1U
#define MAR_63_WTE_BIT_END                                  1U

/* Definition for field PC in Register MAR_63 */
#define MAR_63_PC_BIT_START                                 0U
#define MAR_63_PC_BIT_END                                   0U

/* Definition for field RESV_1 in Register MAR_64 */
#define MAR_64_RESV_1_BIT_START                             4U
#define MAR_64_RESV_1_BIT_END                               31U

/* Definition for field PFX in Register MAR_64 */
#define MAR_64_PFX_BIT_START                                3U
#define MAR_64_PFX_BIT_END                                  3U

/* Definition for field PCX in Register MAR_64 */
#define MAR_64_PCX_BIT_START                                2U
#define MAR_64_PCX_BIT_END                                  2U

/* Definition for field WTE in Register MAR_64 */
#define MAR_64_WTE_BIT_START                                1U
#define MAR_64_WTE_BIT_END                                  1U

/* Definition for field PC in Register MAR_64 */
#define MAR_64_PC_BIT_START                                 0U
#define MAR_64_PC_BIT_END                                   0U

/* Definition for field RESV_1 in Register MAR_65 */
#define MAR_65_RESV_1_BIT_START                             4U
#define MAR_65_RESV_1_BIT_END                               31U

/* Definition for field PFX in Register MAR_65 */
#define MAR_65_PFX_BIT_START                                3U
#define MAR_65_PFX_BIT_END                                  3U

/* Definition for field PCX in Register MAR_65 */
#define MAR_65_PCX_BIT_START                                2U
#define MAR_65_PCX_BIT_END                                  2U

/* Definition for field WTE in Register MAR_65 */
#define MAR_65_WTE_BIT_START                                1U
#define MAR_65_WTE_BIT_END                                  1U

/* Definition for field PC in Register MAR_65 */
#define MAR_65_PC_BIT_START                                 0U
#define MAR_65_PC_BIT_END                                   0U

/* Definition for field RESV_1 in Register MAR_66 */
#define MAR_66_RESV_1_BIT_START                             4U
#define MAR_66_RESV_1_BIT_END                               31U

/* Definition for field PFX in Register MAR_66 */
#define MAR_66_PFX_BIT_START                                3U
#define MAR_66_PFX_BIT_END                                  3U

/* Definition for field PCX in Register MAR_66 */
#define MAR_66_PCX_BIT_START                                2U
#define MAR_66_PCX_BIT_END                                  2U

/* Definition for field WTE in Register MAR_66 */
#define MAR_66_WTE_BIT_START                                1U
#define MAR_66_WTE_BIT_END                                  1U

/* Definition for field PC in Register MAR_66 */
#define MAR_66_PC_BIT_START                                 0U
#define MAR_66_PC_BIT_END                                   0U

/* Definition for field RESV_1 in Register MAR_67 */
#define MAR_67_RESV_1_BIT_START                             4U
#define MAR_67_RESV_1_BIT_END                               31U

/* Definition for field PFX in Register MAR_67 */
#define MAR_67_PFX_BIT_START                                3U
#define MAR_67_PFX_BIT_END                                  3U

/* Definition for field PCX in Register MAR_67 */
#define MAR_67_PCX_BIT_START                                2U
#define MAR_67_PCX_BIT_END                                  2U

