0xastro/fmcw-RADAR/mmwave_sdk/packages/ti/drivers/soc/include/reg_dspicfg.h
/* Definition for field WTE in Register MAR_67 */
#define MAR_67_WTE_BIT_START                                1U
#define MAR_67_WTE_BIT_END                                  1U

/* Definition for field PC in Register MAR_67 */
#define MAR_67_PC_BIT_START                                 0U
#define MAR_67_PC_BIT_END                                   0U

/* Definition for field RESV_1 in Register MAR_68 */
#define MAR_68_RESV_1_BIT_START                             4U
#define MAR_68_RESV_1_BIT_END                               31U

/* Definition for field PFX in Register MAR_68 */
#define MAR_68_PFX_BIT_START                                3U
#define MAR_68_PFX_BIT_END                                  3U

/* Definition for field PCX in Register MAR_68 */
#define MAR_68_PCX_BIT_START                                2U
#define MAR_68_PCX_BIT_END                                  2U

/* Definition for field WTE in Register MAR_68 */
#define MAR_68_WTE_BIT_START                                1U
#define MAR_68_WTE_BIT_END                                  1U

/* Definition for field PC in Register MAR_68 */
#define MAR_68_PC_BIT_START                                 0U
#define MAR_68_PC_BIT_END                                   0U

/* Definition for field RESV_1 in Register MAR_69 */
#define MAR_69_RESV_1_BIT_START                             4U
#define MAR_69_RESV_1_BIT_END                               31U

/* Definition for field PFX in Register MAR_69 */
#define MAR_69_PFX_BIT_START                                3U
#define MAR_69_PFX_BIT_END                                  3U

/* Definition for field PCX in Register MAR_69 */
#define MAR_69_PCX_BIT_START                                2U
#define MAR_69_PCX_BIT_END                                  2U

/* Definition for field WTE in Register MAR_69 */
#define MAR_69_WTE_BIT_START                                1U
#define MAR_69_WTE_BIT_END                                  1U

/* Definition for field PC in Register MAR_69 */
#define MAR_69_PC_BIT_START                                 0U
#define MAR_69_PC_BIT_END                                   0U

/* Definition for field RESV_1 in Register MAR_70 */
#define MAR_70_RESV_1_BIT_START                             4U
#define MAR_70_RESV_1_BIT_END                               31U

/* Definition for field PFX in Register MAR_70 */
#define MAR_70_PFX_BIT_START                                3U
#define MAR_70_PFX_BIT_END                                  3U

/* Definition for field PCX in Register MAR_70 */
#define MAR_70_PCX_BIT_START                                2U
#define MAR_70_PCX_BIT_END                                  2U

/* Definition for field WTE in Register MAR_70 */
#define MAR_70_WTE_BIT_START                                1U
#define MAR_70_WTE_BIT_END                                  1U

/* Definition for field PC in Register MAR_70 */
#define MAR_70_PC_BIT_START                                 0U
#define MAR_70_PC_BIT_END                                   0U

/* Definition for field RESV_1 in Register MAR_71 */
#define MAR_71_RESV_1_BIT_START                             4U
#define MAR_71_RESV_1_BIT_END                               31U

/* Definition for field PFX in Register MAR_71 */
#define MAR_71_PFX_BIT_START                                3U
#define MAR_71_PFX_BIT_END                                  3U

/* Definition for field PCX in Register MAR_71 */
#define MAR_71_PCX_BIT_START                                2U
#define MAR_71_PCX_BIT_END                                  2U

/* Definition for field WTE in Register MAR_71 */
#define MAR_71_WTE_BIT_START                                1U
#define MAR_71_WTE_BIT_END                                  1U

/* Definition for field PC in Register MAR_71 */
#define MAR_71_PC_BIT_START                                 0U
#define MAR_71_PC_BIT_END                                   0U

/* Definition for field RESV_1 in Register MAR_72 */
#define MAR_72_RESV_1_BIT_START                             4U
#define MAR_72_RESV_1_BIT_END                               31U

/* Definition for field PFX in Register MAR_72 */
#define MAR_72_PFX_BIT_START                                3U
#define MAR_72_PFX_BIT_END                                  3U

/* Definition for field PCX in Register MAR_72 */
#define MAR_72_PCX_BIT_START                                2U
#define MAR_72_PCX_BIT_END                                  2U

/* Definition for field WTE in Register MAR_72 */
#define MAR_72_WTE_BIT_START                                1U
#define MAR_72_WTE_BIT_END                                  1U

/* Definition for field PC in Register MAR_72 */
#define MAR_72_PC_BIT_START                                 0U
#define MAR_72_PC_BIT_END                                   0U

/* Definition for field RESV_1 in Register MAR_73 */
#define MAR_73_RESV_1_BIT_START                             4U
#define MAR_73_RESV_1_BIT_END                               31U

/* Definition for field PFX in Register MAR_73 */
#define MAR_73_PFX_BIT_START                                3U
#define MAR_73_PFX_BIT_END                                  3U

/* Definition for field PCX in Register MAR_73 */
#define MAR_73_PCX_BIT_START                                2U
#define MAR_73_PCX_BIT_END                                  2U

/* Definition for field WTE in Register MAR_73 */
#define MAR_73_WTE_BIT_START                                1U
#define MAR_73_WTE_BIT_END                                  1U

/* Definition for field PC in Register MAR_73 */
#define MAR_73_PC_BIT_START                                 0U
#define MAR_73_PC_BIT_END                                   0U

/* Definition for field RESV_1 in Register MAR_74 */
#define MAR_74_RESV_1_BIT_START                             4U
#define MAR_74_RESV_1_BIT_END                               31U

/* Definition for field PFX in Register MAR_74 */
#define MAR_74_PFX_BIT_START                                3U
#define MAR_74_PFX_BIT_END                                  3U

/* Definition for field PCX in Register MAR_74 */
#define MAR_74_PCX_BIT_START                                2U
#define MAR_74_PCX_BIT_END                                  2U

/* Definition for field WTE in Register MAR_74 */
#define MAR_74_WTE_BIT_START                                1U
#define MAR_74_WTE_BIT_END                                  1U

