0xastro/fmcw-RADAR/mmwave_sdk/packages/ti/drivers/soc/include/reg_dspicfg.h
/* Definition for field PC in Register MAR_74 */
#define MAR_74_PC_BIT_START                                 0U
#define MAR_74_PC_BIT_END                                   0U

/* Definition for field RESV_1 in Register MAR_75 */
#define MAR_75_RESV_1_BIT_START                             4U
#define MAR_75_RESV_1_BIT_END                               31U

/* Definition for field PFX in Register MAR_75 */
#define MAR_75_PFX_BIT_START                                3U
#define MAR_75_PFX_BIT_END                                  3U

/* Definition for field PCX in Register MAR_75 */
#define MAR_75_PCX_BIT_START                                2U
#define MAR_75_PCX_BIT_END                                  2U

/* Definition for field WTE in Register MAR_75 */
#define MAR_75_WTE_BIT_START                                1U
#define MAR_75_WTE_BIT_END                                  1U

/* Definition for field PC in Register MAR_75 */
#define MAR_75_PC_BIT_START                                 0U
#define MAR_75_PC_BIT_END                                   0U

/* Definition for field RESV_1 in Register MAR_76 */
#define MAR_76_RESV_1_BIT_START                             4U
#define MAR_76_RESV_1_BIT_END                               31U

/* Definition for field PFX in Register MAR_76 */
#define MAR_76_PFX_BIT_START                                3U
#define MAR_76_PFX_BIT_END                                  3U

/* Definition for field PCX in Register MAR_76 */
#define MAR_76_PCX_BIT_START                                2U
#define MAR_76_PCX_BIT_END                                  2U

/* Definition for field WTE in Register MAR_76 */
#define MAR_76_WTE_BIT_START                                1U
#define MAR_76_WTE_BIT_END                                  1U

/* Definition for field PC in Register MAR_76 */
#define MAR_76_PC_BIT_START                                 0U
#define MAR_76_PC_BIT_END                                   0U

/* Definition for field RESV_1 in Register MAR_77 */
#define MAR_77_RESV_1_BIT_START                             4U
#define MAR_77_RESV_1_BIT_END                               31U

/* Definition for field PFX in Register MAR_77 */
#define MAR_77_PFX_BIT_START                                3U
#define MAR_77_PFX_BIT_END                                  3U

/* Definition for field PCX in Register MAR_77 */
#define MAR_77_PCX_BIT_START                                2U
#define MAR_77_PCX_BIT_END                                  2U

/* Definition for field WTE in Register MAR_77 */
#define MAR_77_WTE_BIT_START                                1U
#define MAR_77_WTE_BIT_END                                  1U

/* Definition for field PC in Register MAR_77 */
#define MAR_77_PC_BIT_START                                 0U
#define MAR_77_PC_BIT_END                                   0U

/* Definition for field RESV_1 in Register MAR_78 */
#define MAR_78_RESV_1_BIT_START                             4U
#define MAR_78_RESV_1_BIT_END                               31U

/* Definition for field PFX in Register MAR_78 */
#define MAR_78_PFX_BIT_START                                3U
#define MAR_78_PFX_BIT_END                                  3U

/* Definition for field PCX in Register MAR_78 */
#define MAR_78_PCX_BIT_START                                2U
#define MAR_78_PCX_BIT_END                                  2U

/* Definition for field WTE in Register MAR_78 */
#define MAR_78_WTE_BIT_START                                1U
#define MAR_78_WTE_BIT_END                                  1U

/* Definition for field PC in Register MAR_78 */
#define MAR_78_PC_BIT_START                                 0U
#define MAR_78_PC_BIT_END                                   0U

/* Definition for field RESV_1 in Register MAR_79 */
#define MAR_79_RESV_1_BIT_START                             4U
#define MAR_79_RESV_1_BIT_END                               31U

/* Definition for field PFX in Register MAR_79 */
#define MAR_79_PFX_BIT_START                                3U
#define MAR_79_PFX_BIT_END                                  3U

/* Definition for field PCX in Register MAR_79 */
#define MAR_79_PCX_BIT_START                                2U
#define MAR_79_PCX_BIT_END                                  2U

/* Definition for field WTE in Register MAR_79 */
#define MAR_79_WTE_BIT_START                                1U
#define MAR_79_WTE_BIT_END                                  1U

/* Definition for field PC in Register MAR_79 */
#define MAR_79_PC_BIT_START                                 0U
#define MAR_79_PC_BIT_END                                   0U

/* Definition for field RESV_1 in Register MAR_80 */
#define MAR_80_RESV_1_BIT_START                             4U
#define MAR_80_RESV_1_BIT_END                               31U

/* Definition for field PFX in Register MAR_80 */
#define MAR_80_PFX_BIT_START                                3U
#define MAR_80_PFX_BIT_END                                  3U

/* Definition for field PCX in Register MAR_80 */
#define MAR_80_PCX_BIT_START                                2U
#define MAR_80_PCX_BIT_END                                  2U

/* Definition for field WTE in Register MAR_80 */
#define MAR_80_WTE_BIT_START                                1U
#define MAR_80_WTE_BIT_END                                  1U

/* Definition for field PC in Register MAR_80 */
#define MAR_80_PC_BIT_START                                 0U
#define MAR_80_PC_BIT_END                                   0U

/* Definition for field RESV_1 in Register MAR_81 */
#define MAR_81_RESV_1_BIT_START                             4U
#define MAR_81_RESV_1_BIT_END                               31U

/* Definition for field PFX in Register MAR_81 */
#define MAR_81_PFX_BIT_START                                3U
#define MAR_81_PFX_BIT_END                                  3U

/* Definition for field PCX in Register MAR_81 */
#define MAR_81_PCX_BIT_START                                2U
#define MAR_81_PCX_BIT_END                                  2U

/* Definition for field WTE in Register MAR_81 */
#define MAR_81_WTE_BIT_START                                1U
#define MAR_81_WTE_BIT_END                                  1U

/* Definition for field PC in Register MAR_81 */
#define MAR_81_PC_BIT_START                                 0U
#define MAR_81_PC_BIT_END                                   0U

/* Definition for field RESV_1 in Register MAR_82 */
#define MAR_82_RESV_1_BIT_START                             4U
#define MAR_82_RESV_1_BIT_END                               31U

