0xastro/fmcw-RADAR/mmwave_sdk/packages/ti/drivers/soc/include/reg_dspicfg.h
/* Definition for field PFX in Register MAR_82 */
#define MAR_82_PFX_BIT_START                                3U
#define MAR_82_PFX_BIT_END                                  3U

/* Definition for field PCX in Register MAR_82 */
#define MAR_82_PCX_BIT_START                                2U
#define MAR_82_PCX_BIT_END                                  2U

/* Definition for field WTE in Register MAR_82 */
#define MAR_82_WTE_BIT_START                                1U
#define MAR_82_WTE_BIT_END                                  1U

/* Definition for field PC in Register MAR_82 */
#define MAR_82_PC_BIT_START                                 0U
#define MAR_82_PC_BIT_END                                   0U

/* Definition for field RESV_1 in Register MAR_83 */
#define MAR_83_RESV_1_BIT_START                             4U
#define MAR_83_RESV_1_BIT_END                               31U

/* Definition for field PFX in Register MAR_83 */
#define MAR_83_PFX_BIT_START                                3U
#define MAR_83_PFX_BIT_END                                  3U

/* Definition for field PCX in Register MAR_83 */
#define MAR_83_PCX_BIT_START                                2U
#define MAR_83_PCX_BIT_END                                  2U

/* Definition for field WTE in Register MAR_83 */
#define MAR_83_WTE_BIT_START                                1U
#define MAR_83_WTE_BIT_END                                  1U

/* Definition for field PC in Register MAR_83 */
#define MAR_83_PC_BIT_START                                 0U
#define MAR_83_PC_BIT_END                                   0U

/* Definition for field RESV_1 in Register MAR_84 */
#define MAR_84_RESV_1_BIT_START                             4U
#define MAR_84_RESV_1_BIT_END                               31U

/* Definition for field PFX in Register MAR_84 */
#define MAR_84_PFX_BIT_START                                3U
#define MAR_84_PFX_BIT_END                                  3U

/* Definition for field PCX in Register MAR_84 */
#define MAR_84_PCX_BIT_START                                2U
#define MAR_84_PCX_BIT_END                                  2U

/* Definition for field WTE in Register MAR_84 */
#define MAR_84_WTE_BIT_START                                1U
#define MAR_84_WTE_BIT_END                                  1U

/* Definition for field PC in Register MAR_84 */
#define MAR_84_PC_BIT_START                                 0U
#define MAR_84_PC_BIT_END                                   0U

/* Definition for field RESV_1 in Register MAR_85 */
#define MAR_85_RESV_1_BIT_START                             4U
#define MAR_85_RESV_1_BIT_END                               31U

/* Definition for field PFX in Register MAR_85 */
#define MAR_85_PFX_BIT_START                                3U
#define MAR_85_PFX_BIT_END                                  3U

/* Definition for field PCX in Register MAR_85 */
#define MAR_85_PCX_BIT_START                                2U
#define MAR_85_PCX_BIT_END                                  2U

/* Definition for field WTE in Register MAR_85 */
#define MAR_85_WTE_BIT_START                                1U
#define MAR_85_WTE_BIT_END                                  1U

/* Definition for field PC in Register MAR_85 */
#define MAR_85_PC_BIT_START                                 0U
#define MAR_85_PC_BIT_END                                   0U

/* Definition for field RESV_1 in Register MAR_86 */
#define MAR_86_RESV_1_BIT_START                             4U
#define MAR_86_RESV_1_BIT_END                               31U

/* Definition for field PFX in Register MAR_86 */
#define MAR_86_PFX_BIT_START                                3U
#define MAR_86_PFX_BIT_END                                  3U

/* Definition for field PCX in Register MAR_86 */
#define MAR_86_PCX_BIT_START                                2U
#define MAR_86_PCX_BIT_END                                  2U

/* Definition for field WTE in Register MAR_86 */
#define MAR_86_WTE_BIT_START                                1U
#define MAR_86_WTE_BIT_END                                  1U

/* Definition for field PC in Register MAR_86 */
#define MAR_86_PC_BIT_START                                 0U
#define MAR_86_PC_BIT_END                                   0U

/* Definition for field RESV_1 in Register MAR_87 */
#define MAR_87_RESV_1_BIT_START                             4U
#define MAR_87_RESV_1_BIT_END                               31U

/* Definition for field PFX in Register MAR_87 */
#define MAR_87_PFX_BIT_START                                3U
#define MAR_87_PFX_BIT_END                                  3U

/* Definition for field PCX in Register MAR_87 */
#define MAR_87_PCX_BIT_START                                2U
#define MAR_87_PCX_BIT_END                                  2U

/* Definition for field WTE in Register MAR_87 */
#define MAR_87_WTE_BIT_START                                1U
#define MAR_87_WTE_BIT_END                                  1U

/* Definition for field PC in Register MAR_87 */
#define MAR_87_PC_BIT_START                                 0U
#define MAR_87_PC_BIT_END                                   0U

/* Definition for field RESV_1 in Register MAR_88 */
#define MAR_88_RESV_1_BIT_START                             4U
#define MAR_88_RESV_1_BIT_END                               31U

/* Definition for field PFX in Register MAR_88 */
#define MAR_88_PFX_BIT_START                                3U
#define MAR_88_PFX_BIT_END                                  3U

/* Definition for field PCX in Register MAR_88 */
#define MAR_88_PCX_BIT_START                                2U
#define MAR_88_PCX_BIT_END                                  2U

/* Definition for field WTE in Register MAR_88 */
#define MAR_88_WTE_BIT_START                                1U
#define MAR_88_WTE_BIT_END                                  1U

/* Definition for field PC in Register MAR_88 */
#define MAR_88_PC_BIT_START                                 0U
#define MAR_88_PC_BIT_END                                   0U

