0xastro/fmcw-RADAR/mmwave_sdk/packages/ti/drivers/soc/include/reg_dspicfg.h
/* Definition for field RESV_1 in Register MAR_89 */
#define MAR_89_RESV_1_BIT_START                             4U
#define MAR_89_RESV_1_BIT_END                               31U

/* Definition for field PFX in Register MAR_89 */
#define MAR_89_PFX_BIT_START                                3U
#define MAR_89_PFX_BIT_END                                  3U

/* Definition for field PCX in Register MAR_89 */
#define MAR_89_PCX_BIT_START                                2U
#define MAR_89_PCX_BIT_END                                  2U

/* Definition for field WTE in Register MAR_89 */
#define MAR_89_WTE_BIT_START                                1U
#define MAR_89_WTE_BIT_END                                  1U

/* Definition for field PC in Register MAR_89 */
#define MAR_89_PC_BIT_START                                 0U
#define MAR_89_PC_BIT_END                                   0U

/* Definition for field RESV_1 in Register MAR_90 */
#define MAR_90_RESV_1_BIT_START                             4U
#define MAR_90_RESV_1_BIT_END                               31U

/* Definition for field PFX in Register MAR_90 */
#define MAR_90_PFX_BIT_START                                3U
#define MAR_90_PFX_BIT_END                                  3U

/* Definition for field PCX in Register MAR_90 */
#define MAR_90_PCX_BIT_START                                2U
#define MAR_90_PCX_BIT_END                                  2U

/* Definition for field WTE in Register MAR_90 */
#define MAR_90_WTE_BIT_START                                1U
#define MAR_90_WTE_BIT_END                                  1U

/* Definition for field PC in Register MAR_90 */
#define MAR_90_PC_BIT_START                                 0U
#define MAR_90_PC_BIT_END                                   0U

/* Definition for field RESV_1 in Register MAR_91 */
#define MAR_91_RESV_1_BIT_START                             4U
#define MAR_91_RESV_1_BIT_END                               31U

/* Definition for field PFX in Register MAR_91 */
#define MAR_91_PFX_BIT_START                                3U
#define MAR_91_PFX_BIT_END                                  3U

/* Definition for field PCX in Register MAR_91 */
#define MAR_91_PCX_BIT_START                                2U
#define MAR_91_PCX_BIT_END                                  2U

/* Definition for field WTE in Register MAR_91 */
#define MAR_91_WTE_BIT_START                                1U
#define MAR_91_WTE_BIT_END                                  1U

/* Definition for field PC in Register MAR_91 */
#define MAR_91_PC_BIT_START                                 0U
#define MAR_91_PC_BIT_END                                   0U

/* Definition for field RESV_1 in Register MAR_92 */
#define MAR_92_RESV_1_BIT_START                             4U
#define MAR_92_RESV_1_BIT_END                               31U

/* Definition for field PFX in Register MAR_92 */
#define MAR_92_PFX_BIT_START                                3U
#define MAR_92_PFX_BIT_END                                  3U

/* Definition for field PCX in Register MAR_92 */
#define MAR_92_PCX_BIT_START                                2U
#define MAR_92_PCX_BIT_END                                  2U

/* Definition for field WTE in Register MAR_92 */
#define MAR_92_WTE_BIT_START                                1U
#define MAR_92_WTE_BIT_END                                  1U

/* Definition for field PC in Register MAR_92 */
#define MAR_92_PC_BIT_START                                 0U
#define MAR_92_PC_BIT_END                                   0U

/* Definition for field RESV_1 in Register MAR_93 */
#define MAR_93_RESV_1_BIT_START                             4U
#define MAR_93_RESV_1_BIT_END                               31U

/* Definition for field PFX in Register MAR_93 */
#define MAR_93_PFX_BIT_START                                3U
#define MAR_93_PFX_BIT_END                                  3U

/* Definition for field PCX in Register MAR_93 */
#define MAR_93_PCX_BIT_START                                2U
#define MAR_93_PCX_BIT_END                                  2U

/* Definition for field WTE in Register MAR_93 */
#define MAR_93_WTE_BIT_START                                1U
#define MAR_93_WTE_BIT_END                                  1U

/* Definition for field PC in Register MAR_93 */
#define MAR_93_PC_BIT_START                                 0U
#define MAR_93_PC_BIT_END                                   0U

/* Definition for field RESV_1 in Register MAR_94 */
#define MAR_94_RESV_1_BIT_START                             4U
#define MAR_94_RESV_1_BIT_END                               31U

/* Definition for field PFX in Register MAR_94 */
#define MAR_94_PFX_BIT_START                                3U
#define MAR_94_PFX_BIT_END                                  3U

/* Definition for field PCX in Register MAR_94 */
#define MAR_94_PCX_BIT_START                                2U
#define MAR_94_PCX_BIT_END                                  2U

/* Definition for field WTE in Register MAR_94 */
#define MAR_94_WTE_BIT_START                                1U
#define MAR_94_WTE_BIT_END                                  1U

/* Definition for field PC in Register MAR_94 */
#define MAR_94_PC_BIT_START                                 0U
#define MAR_94_PC_BIT_END                                   0U

/* Definition for field RESV_1 in Register MAR_95 */
#define MAR_95_RESV_1_BIT_START                             4U
#define MAR_95_RESV_1_BIT_END                               31U

/* Definition for field PFX in Register MAR_95 */
#define MAR_95_PFX_BIT_START                                3U
#define MAR_95_PFX_BIT_END                                  3U

/* Definition for field PCX in Register MAR_95 */
#define MAR_95_PCX_BIT_START                                2U
#define MAR_95_PCX_BIT_END                                  2U

/* Definition for field WTE in Register MAR_95 */
#define MAR_95_WTE_BIT_START                                1U
#define MAR_95_WTE_BIT_END                                  1U

