0xastro/fmcw-RADAR/mmwave_sdk/packages/ti/drivers/soc/include/reg_dspicfg.h
/* Definition for field PC in Register MAR_95 */
#define MAR_95_PC_BIT_START                                 0U
#define MAR_95_PC_BIT_END                                   0U

/* Definition for field RESV_1 in Register MAR_96 */
#define MAR_96_RESV_1_BIT_START                             4U
#define MAR_96_RESV_1_BIT_END                               31U

/* Definition for field PFX in Register MAR_96 */
#define MAR_96_PFX_BIT_START                                3U
#define MAR_96_PFX_BIT_END                                  3U

/* Definition for field PCX in Register MAR_96 */
#define MAR_96_PCX_BIT_START                                2U
#define MAR_96_PCX_BIT_END                                  2U

/* Definition for field WTE in Register MAR_96 */
#define MAR_96_WTE_BIT_START                                1U
#define MAR_96_WTE_BIT_END                                  1U

/* Definition for field PC in Register MAR_96 */
#define MAR_96_PC_BIT_START                                 0U
#define MAR_96_PC_BIT_END                                   0U

/* Definition for field RESV_1 in Register MAR_97 */
#define MAR_97_RESV_1_BIT_START                             4U
#define MAR_97_RESV_1_BIT_END                               31U

/* Definition for field PFX in Register MAR_97 */
#define MAR_97_PFX_BIT_START                                3U
#define MAR_97_PFX_BIT_END                                  3U

/* Definition for field PCX in Register MAR_97 */
#define MAR_97_PCX_BIT_START                                2U
#define MAR_97_PCX_BIT_END                                  2U

/* Definition for field WTE in Register MAR_97 */
#define MAR_97_WTE_BIT_START                                1U
#define MAR_97_WTE_BIT_END                                  1U

/* Definition for field PC in Register MAR_97 */
#define MAR_97_PC_BIT_START                                 0U
#define MAR_97_PC_BIT_END                                   0U

/* Definition for field RESV_1 in Register MAR_98 */
#define MAR_98_RESV_1_BIT_START                             4U
#define MAR_98_RESV_1_BIT_END                               31U

/* Definition for field PFX in Register MAR_98 */
#define MAR_98_PFX_BIT_START                                3U
#define MAR_98_PFX_BIT_END                                  3U

/* Definition for field PCX in Register MAR_98 */
#define MAR_98_PCX_BIT_START                                2U
#define MAR_98_PCX_BIT_END                                  2U

/* Definition for field WTE in Register MAR_98 */
#define MAR_98_WTE_BIT_START                                1U
#define MAR_98_WTE_BIT_END                                  1U

/* Definition for field PC in Register MAR_98 */
#define MAR_98_PC_BIT_START                                 0U
#define MAR_98_PC_BIT_END                                   0U

/* Definition for field RESV_1 in Register MAR_99 */
#define MAR_99_RESV_1_BIT_START                             4U
#define MAR_99_RESV_1_BIT_END                               31U

/* Definition for field PFX in Register MAR_99 */
#define MAR_99_PFX_BIT_START                                3U
#define MAR_99_PFX_BIT_END                                  3U

/* Definition for field PCX in Register MAR_99 */
#define MAR_99_PCX_BIT_START                                2U
#define MAR_99_PCX_BIT_END                                  2U

/* Definition for field WTE in Register MAR_99 */
#define MAR_99_WTE_BIT_START                                1U
#define MAR_99_WTE_BIT_END                                  1U

/* Definition for field PC in Register MAR_99 */
#define MAR_99_PC_BIT_START                                 0U
#define MAR_99_PC_BIT_END                                   0U

/* Definition for field RESV_1 in Register MAR_100 */
#define MAR_100_RESV_1_BIT_START                            4U
#define MAR_100_RESV_1_BIT_END                              31U

/* Definition for field PFX in Register MAR_100 */
#define MAR_100_PFX_BIT_START                               3U
#define MAR_100_PFX_BIT_END                                 3U

/* Definition for field PCX in Register MAR_100 */
#define MAR_100_PCX_BIT_START                               2U
#define MAR_100_PCX_BIT_END                                 2U

/* Definition for field WTE in Register MAR_100 */
#define MAR_100_WTE_BIT_START                               1U
#define MAR_100_WTE_BIT_END                                 1U

/* Definition for field PC in Register MAR_100 */
#define MAR_100_PC_BIT_START                                0U
#define MAR_100_PC_BIT_END                                  0U

/* Definition for field RESV_1 in Register MAR_101 */
#define MAR_101_RESV_1_BIT_START                            4U
#define MAR_101_RESV_1_BIT_END                              31U

/* Definition for field PFX in Register MAR_101 */
#define MAR_101_PFX_BIT_START                               3U
#define MAR_101_PFX_BIT_END                                 3U

/* Definition for field PCX in Register MAR_101 */
#define MAR_101_PCX_BIT_START                               2U
#define MAR_101_PCX_BIT_END                                 2U

/* Definition for field WTE in Register MAR_101 */
#define MAR_101_WTE_BIT_START                               1U
#define MAR_101_WTE_BIT_END                                 1U

/* Definition for field PC in Register MAR_101 */
#define MAR_101_PC_BIT_START                                0U
#define MAR_101_PC_BIT_END                                  0U

/* Definition for field RESV_1 in Register MAR_102 */
#define MAR_102_RESV_1_BIT_START                            4U
#define MAR_102_RESV_1_BIT_END                              31U

/* Definition for field PFX in Register MAR_102 */
#define MAR_102_PFX_BIT_START                               3U
#define MAR_102_PFX_BIT_END                                 3U

/* Definition for field PCX in Register MAR_102 */
#define MAR_102_PCX_BIT_START                               2U
#define MAR_102_PCX_BIT_END                                 2U

/* Definition for field WTE in Register MAR_102 */
#define MAR_102_WTE_BIT_START                               1U
#define MAR_102_WTE_BIT_END                                 1U

