0xastro/fmcw-RADAR/mmwave_sdk/packages/ti/drivers/soc/include/reg_dspicfg.h
/* Definition for field PC in Register MAR_102 */
#define MAR_102_PC_BIT_START                                0U
#define MAR_102_PC_BIT_END                                  0U

/* Definition for field RESV_1 in Register MAR_103 */
#define MAR_103_RESV_1_BIT_START                            4U
#define MAR_103_RESV_1_BIT_END                              31U

/* Definition for field PFX in Register MAR_103 */
#define MAR_103_PFX_BIT_START                               3U
#define MAR_103_PFX_BIT_END                                 3U

/* Definition for field PCX in Register MAR_103 */
#define MAR_103_PCX_BIT_START                               2U
#define MAR_103_PCX_BIT_END                                 2U

/* Definition for field WTE in Register MAR_103 */
#define MAR_103_WTE_BIT_START                               1U
#define MAR_103_WTE_BIT_END                                 1U

/* Definition for field PC in Register MAR_103 */
#define MAR_103_PC_BIT_START                                0U
#define MAR_103_PC_BIT_END                                  0U

/* Definition for field RESV_1 in Register MAR_104 */
#define MAR_104_RESV_1_BIT_START                            4U
#define MAR_104_RESV_1_BIT_END                              31U

/* Definition for field PFX in Register MAR_104 */
#define MAR_104_PFX_BIT_START                               3U
#define MAR_104_PFX_BIT_END                                 3U

/* Definition for field PCX in Register MAR_104 */
#define MAR_104_PCX_BIT_START                               2U
#define MAR_104_PCX_BIT_END                                 2U

/* Definition for field WTE in Register MAR_104 */
#define MAR_104_WTE_BIT_START                               1U
#define MAR_104_WTE_BIT_END                                 1U

/* Definition for field PC in Register MAR_104 */
#define MAR_104_PC_BIT_START                                0U
#define MAR_104_PC_BIT_END                                  0U

/* Definition for field RESV_1 in Register MAR_105 */
#define MAR_105_RESV_1_BIT_START                            4U
#define MAR_105_RESV_1_BIT_END                              31U

/* Definition for field PFX in Register MAR_105 */
#define MAR_105_PFX_BIT_START                               3U
#define MAR_105_PFX_BIT_END                                 3U

/* Definition for field PCX in Register MAR_105 */
#define MAR_105_PCX_BIT_START                               2U
#define MAR_105_PCX_BIT_END                                 2U

/* Definition for field WTE in Register MAR_105 */
#define MAR_105_WTE_BIT_START                               1U
#define MAR_105_WTE_BIT_END                                 1U

/* Definition for field PC in Register MAR_105 */
#define MAR_105_PC_BIT_START                                0U
#define MAR_105_PC_BIT_END                                  0U

/* Definition for field RESV_1 in Register MAR_106 */
#define MAR_106_RESV_1_BIT_START                            4U
#define MAR_106_RESV_1_BIT_END                              31U

/* Definition for field PFX in Register MAR_106 */
#define MAR_106_PFX_BIT_START                               3U
#define MAR_106_PFX_BIT_END                                 3U

/* Definition for field PCX in Register MAR_106 */
#define MAR_106_PCX_BIT_START                               2U
#define MAR_106_PCX_BIT_END                                 2U

/* Definition for field WTE in Register MAR_106 */
#define MAR_106_WTE_BIT_START                               1U
#define MAR_106_WTE_BIT_END                                 1U

/* Definition for field PC in Register MAR_106 */
#define MAR_106_PC_BIT_START                                0U
#define MAR_106_PC_BIT_END                                  0U

/* Definition for field RESV_1 in Register MAR_107 */
#define MAR_107_RESV_1_BIT_START                            4U
#define MAR_107_RESV_1_BIT_END                              31U

/* Definition for field PFX in Register MAR_107 */
#define MAR_107_PFX_BIT_START                               3U
#define MAR_107_PFX_BIT_END                                 3U

/* Definition for field PCX in Register MAR_107 */
#define MAR_107_PCX_BIT_START                               2U
#define MAR_107_PCX_BIT_END                                 2U

/* Definition for field WTE in Register MAR_107 */
#define MAR_107_WTE_BIT_START                               1U
#define MAR_107_WTE_BIT_END                                 1U

/* Definition for field PC in Register MAR_107 */
#define MAR_107_PC_BIT_START                                0U
#define MAR_107_PC_BIT_END                                  0U

/* Definition for field RESV_1 in Register MAR_108 */
#define MAR_108_RESV_1_BIT_START                            4U
#define MAR_108_RESV_1_BIT_END                              31U

/* Definition for field PFX in Register MAR_108 */
#define MAR_108_PFX_BIT_START                               3U
#define MAR_108_PFX_BIT_END                                 3U

/* Definition for field PCX in Register MAR_108 */
#define MAR_108_PCX_BIT_START                               2U
#define MAR_108_PCX_BIT_END                                 2U

/* Definition for field WTE in Register MAR_108 */
#define MAR_108_WTE_BIT_START                               1U
#define MAR_108_WTE_BIT_END                                 1U

/* Definition for field PC in Register MAR_108 */
#define MAR_108_PC_BIT_START                                0U
#define MAR_108_PC_BIT_END                                  0U

/* Definition for field RESV_1 in Register MAR_109 */
#define MAR_109_RESV_1_BIT_START                            4U
#define MAR_109_RESV_1_BIT_END                              31U

/* Definition for field PFX in Register MAR_109 */
#define MAR_109_PFX_BIT_START                               3U
#define MAR_109_PFX_BIT_END                                 3U

/* Definition for field PCX in Register MAR_109 */
#define MAR_109_PCX_BIT_START                               2U
#define MAR_109_PCX_BIT_END                                 2U

