0xastro/fmcw-RADAR/mmwave_sdk/packages/ti/drivers/soc/include/reg_dspicfg.h
/* Definition for field WTE in Register MAR_109 */
#define MAR_109_WTE_BIT_START                               1U
#define MAR_109_WTE_BIT_END                                 1U

/* Definition for field PC in Register MAR_109 */
#define MAR_109_PC_BIT_START                                0U
#define MAR_109_PC_BIT_END                                  0U

/* Definition for field RESV_1 in Register MAR_110 */
#define MAR_110_RESV_1_BIT_START                            4U
#define MAR_110_RESV_1_BIT_END                              31U

/* Definition for field PFX in Register MAR_110 */
#define MAR_110_PFX_BIT_START                               3U
#define MAR_110_PFX_BIT_END                                 3U

/* Definition for field PCX in Register MAR_110 */
#define MAR_110_PCX_BIT_START                               2U
#define MAR_110_PCX_BIT_END                                 2U

/* Definition for field WTE in Register MAR_110 */
#define MAR_110_WTE_BIT_START                               1U
#define MAR_110_WTE_BIT_END                                 1U

/* Definition for field PC in Register MAR_110 */
#define MAR_110_PC_BIT_START                                0U
#define MAR_110_PC_BIT_END                                  0U

/* Definition for field RESV_1 in Register MAR_111 */
#define MAR_111_RESV_1_BIT_START                            4U
#define MAR_111_RESV_1_BIT_END                              31U

/* Definition for field PFX in Register MAR_111 */
#define MAR_111_PFX_BIT_START                               3U
#define MAR_111_PFX_BIT_END                                 3U

/* Definition for field PCX in Register MAR_111 */
#define MAR_111_PCX_BIT_START                               2U
#define MAR_111_PCX_BIT_END                                 2U

/* Definition for field WTE in Register MAR_111 */
#define MAR_111_WTE_BIT_START                               1U
#define MAR_111_WTE_BIT_END                                 1U

/* Definition for field PC in Register MAR_111 */
#define MAR_111_PC_BIT_START                                0U
#define MAR_111_PC_BIT_END                                  0U

/* Definition for field RESV_1 in Register MAR_112 */
#define MAR_112_RESV_1_BIT_START                            4U
#define MAR_112_RESV_1_BIT_END                              31U

/* Definition for field PFX in Register MAR_112 */
#define MAR_112_PFX_BIT_START                               3U
#define MAR_112_PFX_BIT_END                                 3U

/* Definition for field PCX in Register MAR_112 */
#define MAR_112_PCX_BIT_START                               2U
#define MAR_112_PCX_BIT_END                                 2U

/* Definition for field WTE in Register MAR_112 */
#define MAR_112_WTE_BIT_START                               1U
#define MAR_112_WTE_BIT_END                                 1U

/* Definition for field PC in Register MAR_112 */
#define MAR_112_PC_BIT_START                                0U
#define MAR_112_PC_BIT_END                                  0U

/* Definition for field RESV_1 in Register MAR_113 */
#define MAR_113_RESV_1_BIT_START                            4U
#define MAR_113_RESV_1_BIT_END                              31U

/* Definition for field PFX in Register MAR_113 */
#define MAR_113_PFX_BIT_START                               3U
#define MAR_113_PFX_BIT_END                                 3U

/* Definition for field PCX in Register MAR_113 */
#define MAR_113_PCX_BIT_START                               2U
#define MAR_113_PCX_BIT_END                                 2U

/* Definition for field WTE in Register MAR_113 */
#define MAR_113_WTE_BIT_START                               1U
#define MAR_113_WTE_BIT_END                                 1U

/* Definition for field PC in Register MAR_113 */
#define MAR_113_PC_BIT_START                                0U
#define MAR_113_PC_BIT_END                                  0U

/* Definition for field RESV_1 in Register MAR_114 */
#define MAR_114_RESV_1_BIT_START                            4U
#define MAR_114_RESV_1_BIT_END                              31U

/* Definition for field PFX in Register MAR_114 */
#define MAR_114_PFX_BIT_START                               3U
#define MAR_114_PFX_BIT_END                                 3U

/* Definition for field PCX in Register MAR_114 */
#define MAR_114_PCX_BIT_START                               2U
#define MAR_114_PCX_BIT_END                                 2U

/* Definition for field WTE in Register MAR_114 */
#define MAR_114_WTE_BIT_START                               1U
#define MAR_114_WTE_BIT_END                                 1U

/* Definition for field PC in Register MAR_114 */
#define MAR_114_PC_BIT_START                                0U
#define MAR_114_PC_BIT_END                                  0U

/* Definition for field RESV_1 in Register MAR_115 */
#define MAR_115_RESV_1_BIT_START                            4U
#define MAR_115_RESV_1_BIT_END                              31U

/* Definition for field PFX in Register MAR_115 */
#define MAR_115_PFX_BIT_START                               3U
#define MAR_115_PFX_BIT_END                                 3U

/* Definition for field PCX in Register MAR_115 */
#define MAR_115_PCX_BIT_START                               2U
#define MAR_115_PCX_BIT_END                                 2U

/* Definition for field WTE in Register MAR_115 */
#define MAR_115_WTE_BIT_START                               1U
#define MAR_115_WTE_BIT_END                                 1U

/* Definition for field PC in Register MAR_115 */
#define MAR_115_PC_BIT_START                                0U
#define MAR_115_PC_BIT_END                                  0U

/* Definition for field RESV_1 in Register MAR_116 */
#define MAR_116_RESV_1_BIT_START                            4U
#define MAR_116_RESV_1_BIT_END                              31U

/* Definition for field PFX in Register MAR_116 */
#define MAR_116_PFX_BIT_START                               3U
#define MAR_116_PFX_BIT_END                                 3U

/* Definition for field PCX in Register MAR_116 */
#define MAR_116_PCX_BIT_START                               2U
#define MAR_116_PCX_BIT_END                                 2U

/* Definition for field WTE in Register MAR_116 */
#define MAR_116_WTE_BIT_START                               1U
#define MAR_116_WTE_BIT_END                                 1U

/* Definition for field PC in Register MAR_116 */
#define MAR_116_PC_BIT_START                                0U
#define MAR_116_PC_BIT_END                                  0U

/* Definition for field RESV_1 in Register MAR_117 */
#define MAR_117_RESV_1_BIT_START                            4U
#define MAR_117_RESV_1_BIT_END                              31U

/* Definition for field PFX in Register MAR_117 */
#define MAR_117_PFX_BIT_START                               3U
#define MAR_117_PFX_BIT_END                                 3U

