0xastro/fmcw-RADAR/mmwave_sdk/packages/ti/drivers/soc/include/reg_dspicfg.h
/* Definition for field PCX in Register MAR_117 */
#define MAR_117_PCX_BIT_START                               2U
#define MAR_117_PCX_BIT_END                                 2U

/* Definition for field WTE in Register MAR_117 */
#define MAR_117_WTE_BIT_START                               1U
#define MAR_117_WTE_BIT_END                                 1U

/* Definition for field PC in Register MAR_117 */
#define MAR_117_PC_BIT_START                                0U
#define MAR_117_PC_BIT_END                                  0U

/* Definition for field RESV_1 in Register MAR_118 */
#define MAR_118_RESV_1_BIT_START                            4U
#define MAR_118_RESV_1_BIT_END                              31U

/* Definition for field PFX in Register MAR_118 */
#define MAR_118_PFX_BIT_START                               3U
#define MAR_118_PFX_BIT_END                                 3U

/* Definition for field PCX in Register MAR_118 */
#define MAR_118_PCX_BIT_START                               2U
#define MAR_118_PCX_BIT_END                                 2U

/* Definition for field WTE in Register MAR_118 */
#define MAR_118_WTE_BIT_START                               1U
#define MAR_118_WTE_BIT_END                                 1U

/* Definition for field PC in Register MAR_118 */
#define MAR_118_PC_BIT_START                                0U
#define MAR_118_PC_BIT_END                                  0U

/* Definition for field RESV_1 in Register MAR_119 */
#define MAR_119_RESV_1_BIT_START                            4U
#define MAR_119_RESV_1_BIT_END                              31U

/* Definition for field PFX in Register MAR_119 */
#define MAR_119_PFX_BIT_START                               3U
#define MAR_119_PFX_BIT_END                                 3U

/* Definition for field PCX in Register MAR_119 */
#define MAR_119_PCX_BIT_START                               2U
#define MAR_119_PCX_BIT_END                                 2U

/* Definition for field WTE in Register MAR_119 */
#define MAR_119_WTE_BIT_START                               1U
#define MAR_119_WTE_BIT_END                                 1U

/* Definition for field PC in Register MAR_119 */
#define MAR_119_PC_BIT_START                                0U
#define MAR_119_PC_BIT_END                                  0U

/* Definition for field RESV_1 in Register MAR_120 */
#define MAR_120_RESV_1_BIT_START                            4U
#define MAR_120_RESV_1_BIT_END                              31U

/* Definition for field PFX in Register MAR_120 */
#define MAR_120_PFX_BIT_START                               3U
#define MAR_120_PFX_BIT_END                                 3U

/* Definition for field PCX in Register MAR_120 */
#define MAR_120_PCX_BIT_START                               2U
#define MAR_120_PCX_BIT_END                                 2U

/* Definition for field WTE in Register MAR_120 */
#define MAR_120_WTE_BIT_START                               1U
#define MAR_120_WTE_BIT_END                                 1U

/* Definition for field PC in Register MAR_120 */
#define MAR_120_PC_BIT_START                                0U
#define MAR_120_PC_BIT_END                                  0U

/* Definition for field RESV_1 in Register MAR_121 */
#define MAR_121_RESV_1_BIT_START                            4U
#define MAR_121_RESV_1_BIT_END                              31U

/* Definition for field PFX in Register MAR_121 */
#define MAR_121_PFX_BIT_START                               3U
#define MAR_121_PFX_BIT_END                                 3U

/* Definition for field PCX in Register MAR_121 */
#define MAR_121_PCX_BIT_START                               2U
#define MAR_121_PCX_BIT_END                                 2U

/* Definition for field WTE in Register MAR_121 */
#define MAR_121_WTE_BIT_START                               1U
#define MAR_121_WTE_BIT_END                                 1U

/* Definition for field PC in Register MAR_121 */
#define MAR_121_PC_BIT_START                                0U
#define MAR_121_PC_BIT_END                                  0U

/* Definition for field RESV_1 in Register MAR_122 */
#define MAR_122_RESV_1_BIT_START                            4U
#define MAR_122_RESV_1_BIT_END                              31U

/* Definition for field PFX in Register MAR_122 */
#define MAR_122_PFX_BIT_START                               3U
#define MAR_122_PFX_BIT_END                                 3U

/* Definition for field PCX in Register MAR_122 */
#define MAR_122_PCX_BIT_START                               2U
#define MAR_122_PCX_BIT_END                                 2U

/* Definition for field WTE in Register MAR_122 */
#define MAR_122_WTE_BIT_START                               1U
#define MAR_122_WTE_BIT_END                                 1U

/* Definition for field PC in Register MAR_122 */
#define MAR_122_PC_BIT_START                                0U
#define MAR_122_PC_BIT_END                                  0U

/* Definition for field RESV_1 in Register MAR_123 */
#define MAR_123_RESV_1_BIT_START                            4U
#define MAR_123_RESV_1_BIT_END                              31U

/* Definition for field PFX in Register MAR_123 */
#define MAR_123_PFX_BIT_START                               3U
#define MAR_123_PFX_BIT_END                                 3U

/* Definition for field PCX in Register MAR_123 */
#define MAR_123_PCX_BIT_START                               2U
#define MAR_123_PCX_BIT_END                                 2U

/* Definition for field WTE in Register MAR_123 */
#define MAR_123_WTE_BIT_START                               1U
#define MAR_123_WTE_BIT_END                                 1U

/* Definition for field PC in Register MAR_123 */
#define MAR_123_PC_BIT_START                                0U
#define MAR_123_PC_BIT_END                                  0U

/* Definition for field RESV_1 in Register MAR_124 */
#define MAR_124_RESV_1_BIT_START                            4U
#define MAR_124_RESV_1_BIT_END                              31U

/* Definition for field PFX in Register MAR_124 */
#define MAR_124_PFX_BIT_START                               3U
#define MAR_124_PFX_BIT_END                                 3U

/* Definition for field PCX in Register MAR_124 */
#define MAR_124_PCX_BIT_START                               2U
#define MAR_124_PCX_BIT_END                                 2U

/* Definition for field WTE in Register MAR_124 */
#define MAR_124_WTE_BIT_START                               1U
#define MAR_124_WTE_BIT_END                                 1U

