0xastro/fmcw-RADAR/mmwave_sdk/packages/ti/drivers/soc/include/reg_dspicfg.h
/* Definition for field PC in Register MAR_124 */
#define MAR_124_PC_BIT_START                                0U
#define MAR_124_PC_BIT_END                                  0U

/* Definition for field RESV_1 in Register MAR_125 */
#define MAR_125_RESV_1_BIT_START                            4U
#define MAR_125_RESV_1_BIT_END                              31U

/* Definition for field PFX in Register MAR_125 */
#define MAR_125_PFX_BIT_START                               3U
#define MAR_125_PFX_BIT_END                                 3U

/* Definition for field PCX in Register MAR_125 */
#define MAR_125_PCX_BIT_START                               2U
#define MAR_125_PCX_BIT_END                                 2U

/* Definition for field WTE in Register MAR_125 */
#define MAR_125_WTE_BIT_START                               1U
#define MAR_125_WTE_BIT_END                                 1U

/* Definition for field PC in Register MAR_125 */
#define MAR_125_PC_BIT_START                                0U
#define MAR_125_PC_BIT_END                                  0U

/* Definition for field RESV_1 in Register MAR_126 */
#define MAR_126_RESV_1_BIT_START                            4U
#define MAR_126_RESV_1_BIT_END                              31U

/* Definition for field PFX in Register MAR_126 */
#define MAR_126_PFX_BIT_START                               3U
#define MAR_126_PFX_BIT_END                                 3U

/* Definition for field PCX in Register MAR_126 */
#define MAR_126_PCX_BIT_START                               2U
#define MAR_126_PCX_BIT_END                                 2U

/* Definition for field WTE in Register MAR_126 */
#define MAR_126_WTE_BIT_START                               1U
#define MAR_126_WTE_BIT_END                                 1U

/* Definition for field PC in Register MAR_126 */
#define MAR_126_PC_BIT_START                                0U
#define MAR_126_PC_BIT_END                                  0U

/* Definition for field RESV_1 in Register MAR_127 */
#define MAR_127_RESV_1_BIT_START                            4U
#define MAR_127_RESV_1_BIT_END                              31U

/* Definition for field PFX in Register MAR_127 */
#define MAR_127_PFX_BIT_START                               3U
#define MAR_127_PFX_BIT_END                                 3U

/* Definition for field PCX in Register MAR_127 */
#define MAR_127_PCX_BIT_START                               2U
#define MAR_127_PCX_BIT_END                                 2U

/* Definition for field WTE in Register MAR_127 */
#define MAR_127_WTE_BIT_START                               1U
#define MAR_127_WTE_BIT_END                                 1U

/* Definition for field PC in Register MAR_127 */
#define MAR_127_PC_BIT_START                                0U
#define MAR_127_PC_BIT_END                                  0U

/* Definition for field RESV_1 in Register MAR_128 */
#define MAR_128_RESV_1_BIT_START                            4U
#define MAR_128_RESV_1_BIT_END                              31U

/* Definition for field PFX in Register MAR_128 */
#define MAR_128_PFX_BIT_START                               3U
#define MAR_128_PFX_BIT_END                                 3U

/* Definition for field PCX in Register MAR_128 */
#define MAR_128_PCX_BIT_START                               2U
#define MAR_128_PCX_BIT_END                                 2U

/* Definition for field WTE in Register MAR_128 */
#define MAR_128_WTE_BIT_START                               1U
#define MAR_128_WTE_BIT_END                                 1U

/* Definition for field PC in Register MAR_128 */
#define MAR_128_PC_BIT_START                                0U
#define MAR_128_PC_BIT_END                                  0U

/* Definition for field RESV_1 in Register MAR_129 */
#define MAR_129_RESV_1_BIT_START                            4U
#define MAR_129_RESV_1_BIT_END                              31U

/* Definition for field PFX in Register MAR_129 */
#define MAR_129_PFX_BIT_START                               3U
#define MAR_129_PFX_BIT_END                                 3U

/* Definition for field PCX in Register MAR_129 */
#define MAR_129_PCX_BIT_START                               2U
#define MAR_129_PCX_BIT_END                                 2U

/* Definition for field WTE in Register MAR_129 */
#define MAR_129_WTE_BIT_START                               1U
#define MAR_129_WTE_BIT_END                                 1U

/* Definition for field PC in Register MAR_129 */
#define MAR_129_PC_BIT_START                                0U
#define MAR_129_PC_BIT_END                                  0U

/* Definition for field RESV_1 in Register MAR_130 */
#define MAR_130_RESV_1_BIT_START                            4U
#define MAR_130_RESV_1_BIT_END                              31U

/* Definition for field PFX in Register MAR_130 */
#define MAR_130_PFX_BIT_START                               3U
#define MAR_130_PFX_BIT_END                                 3U

/* Definition for field PCX in Register MAR_130 */
#define MAR_130_PCX_BIT_START                               2U
#define MAR_130_PCX_BIT_END                                 2U

/* Definition for field WTE in Register MAR_130 */
#define MAR_130_WTE_BIT_START                               1U
#define MAR_130_WTE_BIT_END                                 1U

/* Definition for field PC in Register MAR_130 */
#define MAR_130_PC_BIT_START                                0U
#define MAR_130_PC_BIT_END                                  0U

/* Definition for field RESV_1 in Register MAR_131 */
#define MAR_131_RESV_1_BIT_START                            4U
#define MAR_131_RESV_1_BIT_END                              31U

/* Definition for field PFX in Register MAR_131 */
#define MAR_131_PFX_BIT_START                               3U
#define MAR_131_PFX_BIT_END                                 3U

/* Definition for field PCX in Register MAR_131 */
#define MAR_131_PCX_BIT_START                               2U
#define MAR_131_PCX_BIT_END                                 2U

/* Definition for field WTE in Register MAR_131 */
#define MAR_131_WTE_BIT_START                               1U
#define MAR_131_WTE_BIT_END                                 1U

/* Definition for field PC in Register MAR_131 */
#define MAR_131_PC_BIT_START                                0U
#define MAR_131_PC_BIT_END                                  0U

/* Definition for field RESV_1 in Register MAR_132 */
#define MAR_132_RESV_1_BIT_START                            4U
#define MAR_132_RESV_1_BIT_END                              31U

/* Definition for field PFX in Register MAR_132 */
#define MAR_132_PFX_BIT_START                               3U
#define MAR_132_PFX_BIT_END                                 3U

/* Definition for field PCX in Register MAR_132 */
#define MAR_132_PCX_BIT_START                               2U
#define MAR_132_PCX_BIT_END                                 2U

/* Definition for field WTE in Register MAR_132 */
#define MAR_132_WTE_BIT_START                               1U
#define MAR_132_WTE_BIT_END                                 1U

