0xastro/fmcw-RADAR/mmwave_sdk/packages/ti/drivers/soc/include/reg_dspicfg.h
/* Definition for field PC in Register MAR_132 */
#define MAR_132_PC_BIT_START                                0U
#define MAR_132_PC_BIT_END                                  0U

/* Definition for field RESV_1 in Register MAR_133 */
#define MAR_133_RESV_1_BIT_START                            4U
#define MAR_133_RESV_1_BIT_END                              31U

/* Definition for field PFX in Register MAR_133 */
#define MAR_133_PFX_BIT_START                               3U
#define MAR_133_PFX_BIT_END                                 3U

/* Definition for field PCX in Register MAR_133 */
#define MAR_133_PCX_BIT_START                               2U
#define MAR_133_PCX_BIT_END                                 2U

/* Definition for field WTE in Register MAR_133 */
#define MAR_133_WTE_BIT_START                               1U
#define MAR_133_WTE_BIT_END                                 1U

/* Definition for field PC in Register MAR_133 */
#define MAR_133_PC_BIT_START                                0U
#define MAR_133_PC_BIT_END                                  0U

/* Definition for field RESV_1 in Register MAR_134 */
#define MAR_134_RESV_1_BIT_START                            4U
#define MAR_134_RESV_1_BIT_END                              31U

/* Definition for field PFX in Register MAR_134 */
#define MAR_134_PFX_BIT_START                               3U
#define MAR_134_PFX_BIT_END                                 3U

/* Definition for field PCX in Register MAR_134 */
#define MAR_134_PCX_BIT_START                               2U
#define MAR_134_PCX_BIT_END                                 2U

/* Definition for field WTE in Register MAR_134 */
#define MAR_134_WTE_BIT_START                               1U
#define MAR_134_WTE_BIT_END                                 1U

/* Definition for field PC in Register MAR_134 */
#define MAR_134_PC_BIT_START                                0U
#define MAR_134_PC_BIT_END                                  0U

/* Definition for field RESV_1 in Register MAR_135 */
#define MAR_135_RESV_1_BIT_START                            4U
#define MAR_135_RESV_1_BIT_END                              31U

/* Definition for field PFX in Register MAR_135 */
#define MAR_135_PFX_BIT_START                               3U
#define MAR_135_PFX_BIT_END                                 3U

/* Definition for field PCX in Register MAR_135 */
#define MAR_135_PCX_BIT_START                               2U
#define MAR_135_PCX_BIT_END                                 2U

/* Definition for field WTE in Register MAR_135 */
#define MAR_135_WTE_BIT_START                               1U
#define MAR_135_WTE_BIT_END                                 1U

/* Definition for field PC in Register MAR_135 */
#define MAR_135_PC_BIT_START                                0U
#define MAR_135_PC_BIT_END                                  0U

/* Definition for field RESV_1 in Register MAR_136 */
#define MAR_136_RESV_1_BIT_START                            4U
#define MAR_136_RESV_1_BIT_END                              31U

/* Definition for field PFX in Register MAR_136 */
#define MAR_136_PFX_BIT_START                               3U
#define MAR_136_PFX_BIT_END                                 3U

/* Definition for field PCX in Register MAR_136 */
#define MAR_136_PCX_BIT_START                               2U
#define MAR_136_PCX_BIT_END                                 2U

/* Definition for field WTE in Register MAR_136 */
#define MAR_136_WTE_BIT_START                               1U
#define MAR_136_WTE_BIT_END                                 1U

/* Definition for field PC in Register MAR_136 */
#define MAR_136_PC_BIT_START                                0U
#define MAR_136_PC_BIT_END                                  0U

/* Definition for field RESV_1 in Register MAR_137 */
#define MAR_137_RESV_1_BIT_START                            4U
#define MAR_137_RESV_1_BIT_END                              31U

/* Definition for field PFX in Register MAR_137 */
#define MAR_137_PFX_BIT_START                               3U
#define MAR_137_PFX_BIT_END                                 3U

/* Definition for field PCX in Register MAR_137 */
#define MAR_137_PCX_BIT_START                               2U
#define MAR_137_PCX_BIT_END                                 2U

/* Definition for field WTE in Register MAR_137 */
#define MAR_137_WTE_BIT_START                               1U
#define MAR_137_WTE_BIT_END                                 1U

/* Definition for field PC in Register MAR_137 */
#define MAR_137_PC_BIT_START                                0U
#define MAR_137_PC_BIT_END                                  0U

/* Definition for field RESV_1 in Register MAR_138 */
#define MAR_138_RESV_1_BIT_START                            4U
#define MAR_138_RESV_1_BIT_END                              31U

/* Definition for field PFX in Register MAR_138 */
#define MAR_138_PFX_BIT_START                               3U
#define MAR_138_PFX_BIT_END                                 3U

/* Definition for field PCX in Register MAR_138 */
#define MAR_138_PCX_BIT_START                               2U
#define MAR_138_PCX_BIT_END                                 2U

/* Definition for field WTE in Register MAR_138 */
#define MAR_138_WTE_BIT_START                               1U
#define MAR_138_WTE_BIT_END                                 1U

/* Definition for field PC in Register MAR_138 */
#define MAR_138_PC_BIT_START                                0U
#define MAR_138_PC_BIT_END                                  0U

/* Definition for field RESV_1 in Register MAR_139 */
#define MAR_139_RESV_1_BIT_START                            4U
#define MAR_139_RESV_1_BIT_END                              31U

/* Definition for field PFX in Register MAR_139 */
#define MAR_139_PFX_BIT_START                               3U
#define MAR_139_PFX_BIT_END                                 3U

/* Definition for field PCX in Register MAR_139 */
#define MAR_139_PCX_BIT_START                               2U
#define MAR_139_PCX_BIT_END                                 2U

