0xastro/fmcw-RADAR/mmwave_sdk/packages/ti/drivers/soc/include/reg_dspicfg.h
/* Definition for field WTE in Register MAR_139 */
#define MAR_139_WTE_BIT_START                               1U
#define MAR_139_WTE_BIT_END                                 1U

/* Definition for field PC in Register MAR_139 */
#define MAR_139_PC_BIT_START                                0U
#define MAR_139_PC_BIT_END                                  0U

/* Definition for field RESV_1 in Register MAR_140 */
#define MAR_140_RESV_1_BIT_START                            4U
#define MAR_140_RESV_1_BIT_END                              31U

/* Definition for field PFX in Register MAR_140 */
#define MAR_140_PFX_BIT_START                               3U
#define MAR_140_PFX_BIT_END                                 3U

/* Definition for field PCX in Register MAR_140 */
#define MAR_140_PCX_BIT_START                               2U
#define MAR_140_PCX_BIT_END                                 2U

/* Definition for field WTE in Register MAR_140 */
#define MAR_140_WTE_BIT_START                               1U
#define MAR_140_WTE_BIT_END                                 1U

/* Definition for field PC in Register MAR_140 */
#define MAR_140_PC_BIT_START                                0U
#define MAR_140_PC_BIT_END                                  0U

/* Definition for field RESV_1 in Register MAR_141 */
#define MAR_141_RESV_1_BIT_START                            4U
#define MAR_141_RESV_1_BIT_END                              31U

/* Definition for field PFX in Register MAR_141 */
#define MAR_141_PFX_BIT_START                               3U
#define MAR_141_PFX_BIT_END                                 3U

/* Definition for field PCX in Register MAR_141 */
#define MAR_141_PCX_BIT_START                               2U
#define MAR_141_PCX_BIT_END                                 2U

/* Definition for field WTE in Register MAR_141 */
#define MAR_141_WTE_BIT_START                               1U
#define MAR_141_WTE_BIT_END                                 1U

/* Definition for field PC in Register MAR_141 */
#define MAR_141_PC_BIT_START                                0U
#define MAR_141_PC_BIT_END                                  0U

/* Definition for field RESV_1 in Register MAR_142 */
#define MAR_142_RESV_1_BIT_START                            4U
#define MAR_142_RESV_1_BIT_END                              31U

/* Definition for field PFX in Register MAR_142 */
#define MAR_142_PFX_BIT_START                               3U
#define MAR_142_PFX_BIT_END                                 3U

/* Definition for field PCX in Register MAR_142 */
#define MAR_142_PCX_BIT_START                               2U
#define MAR_142_PCX_BIT_END                                 2U

/* Definition for field WTE in Register MAR_142 */
#define MAR_142_WTE_BIT_START                               1U
#define MAR_142_WTE_BIT_END                                 1U

/* Definition for field PC in Register MAR_142 */
#define MAR_142_PC_BIT_START                                0U
#define MAR_142_PC_BIT_END                                  0U

/* Definition for field RESV_1 in Register MAR_143 */
#define MAR_143_RESV_1_BIT_START                            4U
#define MAR_143_RESV_1_BIT_END                              31U

/* Definition for field PFX in Register MAR_143 */
#define MAR_143_PFX_BIT_START                               3U
#define MAR_143_PFX_BIT_END                                 3U

/* Definition for field PCX in Register MAR_143 */
#define MAR_143_PCX_BIT_START                               2U
#define MAR_143_PCX_BIT_END                                 2U

/* Definition for field WTE in Register MAR_143 */
#define MAR_143_WTE_BIT_START                               1U
#define MAR_143_WTE_BIT_END                                 1U

/* Definition for field PC in Register MAR_143 */
#define MAR_143_PC_BIT_START                                0U
#define MAR_143_PC_BIT_END                                  0U

/* Definition for field RESV_1 in Register MAR_144 */
#define MAR_144_RESV_1_BIT_START                            4U
#define MAR_144_RESV_1_BIT_END                              31U

/* Definition for field PFX in Register MAR_144 */
#define MAR_144_PFX_BIT_START                               3U
#define MAR_144_PFX_BIT_END                                 3U

/* Definition for field PCX in Register MAR_144 */
#define MAR_144_PCX_BIT_START                               2U
#define MAR_144_PCX_BIT_END                                 2U

/* Definition for field WTE in Register MAR_144 */
#define MAR_144_WTE_BIT_START                               1U
#define MAR_144_WTE_BIT_END                                 1U

/* Definition for field PC in Register MAR_144 */
#define MAR_144_PC_BIT_START                                0U
#define MAR_144_PC_BIT_END                                  0U

/* Definition for field RESV_1 in Register MAR_145 */
#define MAR_145_RESV_1_BIT_START                            4U
#define MAR_145_RESV_1_BIT_END                              31U

/* Definition for field PFX in Register MAR_145 */
#define MAR_145_PFX_BIT_START                               3U
#define MAR_145_PFX_BIT_END                                 3U

/* Definition for field PCX in Register MAR_145 */
#define MAR_145_PCX_BIT_START                               2U
#define MAR_145_PCX_BIT_END                                 2U

/* Definition for field WTE in Register MAR_145 */
#define MAR_145_WTE_BIT_START                               1U
#define MAR_145_WTE_BIT_END                                 1U

/* Definition for field PC in Register MAR_145 */
#define MAR_145_PC_BIT_START                                0U
#define MAR_145_PC_BIT_END                                  0U

/* Definition for field RESV_1 in Register MAR_146 */
#define MAR_146_RESV_1_BIT_START                            4U
#define MAR_146_RESV_1_BIT_END                              31U

/* Definition for field PFX in Register MAR_146 */
#define MAR_146_PFX_BIT_START                               3U
#define MAR_146_PFX_BIT_END                                 3U

/* Definition for field PCX in Register MAR_146 */
#define MAR_146_PCX_BIT_START                               2U
#define MAR_146_PCX_BIT_END                                 2U

/* Definition for field WTE in Register MAR_146 */
#define MAR_146_WTE_BIT_START                               1U
#define MAR_146_WTE_BIT_END                                 1U

/* Definition for field PC in Register MAR_146 */
#define MAR_146_PC_BIT_START                                0U
#define MAR_146_PC_BIT_END                                  0U

/* Definition for field RESV_1 in Register MAR_147 */
#define MAR_147_RESV_1_BIT_START                            4U
#define MAR_147_RESV_1_BIT_END                              31U

/* Definition for field PFX in Register MAR_147 */
#define MAR_147_PFX_BIT_START                               3U
#define MAR_147_PFX_BIT_END                                 3U

