0xastro/fmcw-RADAR/mmwave_sdk/packages/ti/drivers/soc/include/reg_dspicfg.h
/* Definition for field PCX in Register MAR_147 */
#define MAR_147_PCX_BIT_START                               2U
#define MAR_147_PCX_BIT_END                                 2U

/* Definition for field WTE in Register MAR_147 */
#define MAR_147_WTE_BIT_START                               1U
#define MAR_147_WTE_BIT_END                                 1U

/* Definition for field PC in Register MAR_147 */
#define MAR_147_PC_BIT_START                                0U
#define MAR_147_PC_BIT_END                                  0U

/* Definition for field RESV_1 in Register MAR_148 */
#define MAR_148_RESV_1_BIT_START                            4U
#define MAR_148_RESV_1_BIT_END                              31U

/* Definition for field PFX in Register MAR_148 */
#define MAR_148_PFX_BIT_START                               3U
#define MAR_148_PFX_BIT_END                                 3U

/* Definition for field PCX in Register MAR_148 */
#define MAR_148_PCX_BIT_START                               2U
#define MAR_148_PCX_BIT_END                                 2U

/* Definition for field WTE in Register MAR_148 */
#define MAR_148_WTE_BIT_START                               1U
#define MAR_148_WTE_BIT_END                                 1U

/* Definition for field PC in Register MAR_148 */
#define MAR_148_PC_BIT_START                                0U
#define MAR_148_PC_BIT_END                                  0U

/* Definition for field RESV_1 in Register MAR_149 */
#define MAR_149_RESV_1_BIT_START                            4U
#define MAR_149_RESV_1_BIT_END                              31U

/* Definition for field PFX in Register MAR_149 */
#define MAR_149_PFX_BIT_START                               3U
#define MAR_149_PFX_BIT_END                                 3U

/* Definition for field PCX in Register MAR_149 */
#define MAR_149_PCX_BIT_START                               2U
#define MAR_149_PCX_BIT_END                                 2U

/* Definition for field WTE in Register MAR_149 */
#define MAR_149_WTE_BIT_START                               1U
#define MAR_149_WTE_BIT_END                                 1U

/* Definition for field PC in Register MAR_149 */
#define MAR_149_PC_BIT_START                                0U
#define MAR_149_PC_BIT_END                                  0U

/* Definition for field RESV_1 in Register MAR_150 */
#define MAR_150_RESV_1_BIT_START                            4U
#define MAR_150_RESV_1_BIT_END                              31U

/* Definition for field PFX in Register MAR_150 */
#define MAR_150_PFX_BIT_START                               3U
#define MAR_150_PFX_BIT_END                                 3U

/* Definition for field PCX in Register MAR_150 */
#define MAR_150_PCX_BIT_START                               2U
#define MAR_150_PCX_BIT_END                                 2U

/* Definition for field WTE in Register MAR_150 */
#define MAR_150_WTE_BIT_START                               1U
#define MAR_150_WTE_BIT_END                                 1U

/* Definition for field PC in Register MAR_150 */
#define MAR_150_PC_BIT_START                                0U
#define MAR_150_PC_BIT_END                                  0U

/* Definition for field RESV_1 in Register MAR_151 */
#define MAR_151_RESV_1_BIT_START                            4U
#define MAR_151_RESV_1_BIT_END                              31U

/* Definition for field PFX in Register MAR_151 */
#define MAR_151_PFX_BIT_START                               3U
#define MAR_151_PFX_BIT_END                                 3U

/* Definition for field PCX in Register MAR_151 */
#define MAR_151_PCX_BIT_START                               2U
#define MAR_151_PCX_BIT_END                                 2U

/* Definition for field WTE in Register MAR_151 */
#define MAR_151_WTE_BIT_START                               1U
#define MAR_151_WTE_BIT_END                                 1U

/* Definition for field PC in Register MAR_151 */
#define MAR_151_PC_BIT_START                                0U
#define MAR_151_PC_BIT_END                                  0U

/* Definition for field RESV_1 in Register MAR_152 */
#define MAR_152_RESV_1_BIT_START                            4U
#define MAR_152_RESV_1_BIT_END                              31U

/* Definition for field PFX in Register MAR_152 */
#define MAR_152_PFX_BIT_START                               3U
#define MAR_152_PFX_BIT_END                                 3U

/* Definition for field PCX in Register MAR_152 */
#define MAR_152_PCX_BIT_START                               2U
#define MAR_152_PCX_BIT_END                                 2U

/* Definition for field WTE in Register MAR_152 */
#define MAR_152_WTE_BIT_START                               1U
#define MAR_152_WTE_BIT_END                                 1U

/* Definition for field PC in Register MAR_152 */
#define MAR_152_PC_BIT_START                                0U
#define MAR_152_PC_BIT_END                                  0U

/* Definition for field RESV_1 in Register MAR_153 */
#define MAR_153_RESV_1_BIT_START                            4U
#define MAR_153_RESV_1_BIT_END                              31U

/* Definition for field PFX in Register MAR_153 */
#define MAR_153_PFX_BIT_START                               3U
#define MAR_153_PFX_BIT_END                                 3U

/* Definition for field PCX in Register MAR_153 */
#define MAR_153_PCX_BIT_START                               2U
#define MAR_153_PCX_BIT_END                                 2U

/* Definition for field WTE in Register MAR_153 */
#define MAR_153_WTE_BIT_START                               1U
#define MAR_153_WTE_BIT_END                                 1U

/* Definition for field PC in Register MAR_153 */
#define MAR_153_PC_BIT_START                                0U
#define MAR_153_PC_BIT_END                                  0U

/* Definition for field RESV_1 in Register MAR_154 */
#define MAR_154_RESV_1_BIT_START                            4U
#define MAR_154_RESV_1_BIT_END                              31U

/* Definition for field PFX in Register MAR_154 */
#define MAR_154_PFX_BIT_START                               3U
#define MAR_154_PFX_BIT_END                                 3U

/* Definition for field PCX in Register MAR_154 */
#define MAR_154_PCX_BIT_START                               2U
#define MAR_154_PCX_BIT_END                                 2U

/* Definition for field WTE in Register MAR_154 */
#define MAR_154_WTE_BIT_START                               1U
#define MAR_154_WTE_BIT_END                                 1U

