0xastro/fmcw-RADAR/mmwave_sdk/packages/ti/drivers/soc/include/reg_dspicfg.h
/* Definition for field PC in Register MAR_154 */
#define MAR_154_PC_BIT_START                                0U
#define MAR_154_PC_BIT_END                                  0U

/* Definition for field RESV_1 in Register MAR_155 */
#define MAR_155_RESV_1_BIT_START                            4U
#define MAR_155_RESV_1_BIT_END                              31U

/* Definition for field PFX in Register MAR_155 */
#define MAR_155_PFX_BIT_START                               3U
#define MAR_155_PFX_BIT_END                                 3U

/* Definition for field PCX in Register MAR_155 */
#define MAR_155_PCX_BIT_START                               2U
#define MAR_155_PCX_BIT_END                                 2U

/* Definition for field WTE in Register MAR_155 */
#define MAR_155_WTE_BIT_START                               1U
#define MAR_155_WTE_BIT_END                                 1U

/* Definition for field PC in Register MAR_155 */
#define MAR_155_PC_BIT_START                                0U
#define MAR_155_PC_BIT_END                                  0U

/* Definition for field RESV_1 in Register MAR_156 */
#define MAR_156_RESV_1_BIT_START                            4U
#define MAR_156_RESV_1_BIT_END                              31U

/* Definition for field PFX in Register MAR_156 */
#define MAR_156_PFX_BIT_START                               3U
#define MAR_156_PFX_BIT_END                                 3U

/* Definition for field PCX in Register MAR_156 */
#define MAR_156_PCX_BIT_START                               2U
#define MAR_156_PCX_BIT_END                                 2U

/* Definition for field WTE in Register MAR_156 */
#define MAR_156_WTE_BIT_START                               1U
#define MAR_156_WTE_BIT_END                                 1U

/* Definition for field PC in Register MAR_156 */
#define MAR_156_PC_BIT_START                                0U
#define MAR_156_PC_BIT_END                                  0U

/* Definition for field RESV_1 in Register MAR_157 */
#define MAR_157_RESV_1_BIT_START                            4U
#define MAR_157_RESV_1_BIT_END                              31U

/* Definition for field PFX in Register MAR_157 */
#define MAR_157_PFX_BIT_START                               3U
#define MAR_157_PFX_BIT_END                                 3U

/* Definition for field PCX in Register MAR_157 */
#define MAR_157_PCX_BIT_START                               2U
#define MAR_157_PCX_BIT_END                                 2U

/* Definition for field WTE in Register MAR_157 */
#define MAR_157_WTE_BIT_START                               1U
#define MAR_157_WTE_BIT_END                                 1U

/* Definition for field PC in Register MAR_157 */
#define MAR_157_PC_BIT_START                                0U
#define MAR_157_PC_BIT_END                                  0U

/* Definition for field RESV_1 in Register MAR_158 */
#define MAR_158_RESV_1_BIT_START                            4U
#define MAR_158_RESV_1_BIT_END                              31U

/* Definition for field PFX in Register MAR_158 */
#define MAR_158_PFX_BIT_START                               3U
#define MAR_158_PFX_BIT_END                                 3U

/* Definition for field PCX in Register MAR_158 */
#define MAR_158_PCX_BIT_START                               2U
#define MAR_158_PCX_BIT_END                                 2U

/* Definition for field WTE in Register MAR_158 */
#define MAR_158_WTE_BIT_START                               1U
#define MAR_158_WTE_BIT_END                                 1U

/* Definition for field PC in Register MAR_158 */
#define MAR_158_PC_BIT_START                                0U
#define MAR_158_PC_BIT_END                                  0U

/* Definition for field RESV_1 in Register MAR_159 */
#define MAR_159_RESV_1_BIT_START                            4U
#define MAR_159_RESV_1_BIT_END                              31U

/* Definition for field PFX in Register MAR_159 */
#define MAR_159_PFX_BIT_START                               3U
#define MAR_159_PFX_BIT_END                                 3U

/* Definition for field PCX in Register MAR_159 */
#define MAR_159_PCX_BIT_START                               2U
#define MAR_159_PCX_BIT_END                                 2U

/* Definition for field WTE in Register MAR_159 */
#define MAR_159_WTE_BIT_START                               1U
#define MAR_159_WTE_BIT_END                                 1U

/* Definition for field PC in Register MAR_159 */
#define MAR_159_PC_BIT_START                                0U
#define MAR_159_PC_BIT_END                                  0U

/* Definition for field RESV_1 in Register MAR_160 */
#define MAR_160_RESV_1_BIT_START                            4U
#define MAR_160_RESV_1_BIT_END                              31U

/* Definition for field PFX in Register MAR_160 */
#define MAR_160_PFX_BIT_START                               3U
#define MAR_160_PFX_BIT_END                                 3U

/* Definition for field PCX in Register MAR_160 */
#define MAR_160_PCX_BIT_START                               2U
#define MAR_160_PCX_BIT_END                                 2U

/* Definition for field WTE in Register MAR_160 */
#define MAR_160_WTE_BIT_START                               1U
#define MAR_160_WTE_BIT_END                                 1U

/* Definition for field PC in Register MAR_160 */
#define MAR_160_PC_BIT_START                                0U
#define MAR_160_PC_BIT_END                                  0U

/* Definition for field RESV_1 in Register MAR_161 */
#define MAR_161_RESV_1_BIT_START                            4U
#define MAR_161_RESV_1_BIT_END                              31U

/* Definition for field PFX in Register MAR_161 */
#define MAR_161_PFX_BIT_START                               3U
#define MAR_161_PFX_BIT_END                                 3U

/* Definition for field PCX in Register MAR_161 */
#define MAR_161_PCX_BIT_START                               2U
#define MAR_161_PCX_BIT_END                                 2U

/* Definition for field WTE in Register MAR_161 */
#define MAR_161_WTE_BIT_START                               1U
#define MAR_161_WTE_BIT_END                                 1U

/* Definition for field PC in Register MAR_161 */
#define MAR_161_PC_BIT_START                                0U
#define MAR_161_PC_BIT_END                                  0U

/* Definition for field RESV_1 in Register MAR_162 */
#define MAR_162_RESV_1_BIT_START                            4U
#define MAR_162_RESV_1_BIT_END                              31U

/* Definition for field PFX in Register MAR_162 */
#define MAR_162_PFX_BIT_START                               3U
#define MAR_162_PFX_BIT_END                                 3U

/* Definition for field PCX in Register MAR_162 */
#define MAR_162_PCX_BIT_START                               2U
#define MAR_162_PCX_BIT_END                                 2U

/* Definition for field WTE in Register MAR_162 */
#define MAR_162_WTE_BIT_START                               1U
#define MAR_162_WTE_BIT_END                                 1U

