0xastro/fmcw-RADAR/mmwave_sdk/packages/ti/drivers/soc/include/reg_dspicfg.h
/* Definition for field PC in Register MAR_162 */
#define MAR_162_PC_BIT_START                                0U
#define MAR_162_PC_BIT_END                                  0U

/* Definition for field RESV_1 in Register MAR_163 */
#define MAR_163_RESV_1_BIT_START                            4U
#define MAR_163_RESV_1_BIT_END                              31U

/* Definition for field PFX in Register MAR_163 */
#define MAR_163_PFX_BIT_START                               3U
#define MAR_163_PFX_BIT_END                                 3U

/* Definition for field PCX in Register MAR_163 */
#define MAR_163_PCX_BIT_START                               2U
#define MAR_163_PCX_BIT_END                                 2U

/* Definition for field WTE in Register MAR_163 */
#define MAR_163_WTE_BIT_START                               1U
#define MAR_163_WTE_BIT_END                                 1U

/* Definition for field PC in Register MAR_163 */
#define MAR_163_PC_BIT_START                                0U
#define MAR_163_PC_BIT_END                                  0U

/* Definition for field RESV_1 in Register MAR_164 */
#define MAR_164_RESV_1_BIT_START                            4U
#define MAR_164_RESV_1_BIT_END                              31U

/* Definition for field PFX in Register MAR_164 */
#define MAR_164_PFX_BIT_START                               3U
#define MAR_164_PFX_BIT_END                                 3U

/* Definition for field PCX in Register MAR_164 */
#define MAR_164_PCX_BIT_START                               2U
#define MAR_164_PCX_BIT_END                                 2U

/* Definition for field WTE in Register MAR_164 */
#define MAR_164_WTE_BIT_START                               1U
#define MAR_164_WTE_BIT_END                                 1U

/* Definition for field PC in Register MAR_164 */
#define MAR_164_PC_BIT_START                                0U
#define MAR_164_PC_BIT_END                                  0U

/* Definition for field RESV_1 in Register MAR_165 */
#define MAR_165_RESV_1_BIT_START                            4U
#define MAR_165_RESV_1_BIT_END                              31U

/* Definition for field PFX in Register MAR_165 */
#define MAR_165_PFX_BIT_START                               3U
#define MAR_165_PFX_BIT_END                                 3U

/* Definition for field PCX in Register MAR_165 */
#define MAR_165_PCX_BIT_START                               2U
#define MAR_165_PCX_BIT_END                                 2U

/* Definition for field WTE in Register MAR_165 */
#define MAR_165_WTE_BIT_START                               1U
#define MAR_165_WTE_BIT_END                                 1U

/* Definition for field PC in Register MAR_165 */
#define MAR_165_PC_BIT_START                                0U
#define MAR_165_PC_BIT_END                                  0U

/* Definition for field RESV_1 in Register MAR_166 */
#define MAR_166_RESV_1_BIT_START                            4U
#define MAR_166_RESV_1_BIT_END                              31U

/* Definition for field PFX in Register MAR_166 */
#define MAR_166_PFX_BIT_START                               3U
#define MAR_166_PFX_BIT_END                                 3U

/* Definition for field PCX in Register MAR_166 */
#define MAR_166_PCX_BIT_START                               2U
#define MAR_166_PCX_BIT_END                                 2U

/* Definition for field WTE in Register MAR_166 */
#define MAR_166_WTE_BIT_START                               1U
#define MAR_166_WTE_BIT_END                                 1U

/* Definition for field PC in Register MAR_166 */
#define MAR_166_PC_BIT_START                                0U
#define MAR_166_PC_BIT_END                                  0U

/* Definition for field RESV_1 in Register MAR_167 */
#define MAR_167_RESV_1_BIT_START                            4U
#define MAR_167_RESV_1_BIT_END                              31U

/* Definition for field PFX in Register MAR_167 */
#define MAR_167_PFX_BIT_START                               3U
#define MAR_167_PFX_BIT_END                                 3U

/* Definition for field PCX in Register MAR_167 */
#define MAR_167_PCX_BIT_START                               2U
#define MAR_167_PCX_BIT_END                                 2U

/* Definition for field WTE in Register MAR_167 */
#define MAR_167_WTE_BIT_START                               1U
#define MAR_167_WTE_BIT_END                                 1U

/* Definition for field PC in Register MAR_167 */
#define MAR_167_PC_BIT_START                                0U
#define MAR_167_PC_BIT_END                                  0U

/* Definition for field RESV_1 in Register MAR_168 */
#define MAR_168_RESV_1_BIT_START                            4U
#define MAR_168_RESV_1_BIT_END                              31U

/* Definition for field PFX in Register MAR_168 */
#define MAR_168_PFX_BIT_START                               3U
#define MAR_168_PFX_BIT_END                                 3U

/* Definition for field PCX in Register MAR_168 */
#define MAR_168_PCX_BIT_START                               2U
#define MAR_168_PCX_BIT_END                                 2U

/* Definition for field WTE in Register MAR_168 */
#define MAR_168_WTE_BIT_START                               1U
#define MAR_168_WTE_BIT_END                                 1U

/* Definition for field PC in Register MAR_168 */
#define MAR_168_PC_BIT_START                                0U
#define MAR_168_PC_BIT_END                                  0U

/* Definition for field RESV_1 in Register MAR_169 */
#define MAR_169_RESV_1_BIT_START                            4U
#define MAR_169_RESV_1_BIT_END                              31U

/* Definition for field PFX in Register MAR_169 */
#define MAR_169_PFX_BIT_START                               3U
#define MAR_169_PFX_BIT_END                                 3U

/* Definition for field PCX in Register MAR_169 */
#define MAR_169_PCX_BIT_START                               2U
#define MAR_169_PCX_BIT_END                                 2U

