0xastro/fmcw-RADAR/mmwave_sdk/packages/ti/drivers/soc/include/reg_dspicfg.h
/* Definition for field WTE in Register MAR_169 */
#define MAR_169_WTE_BIT_START                               1U
#define MAR_169_WTE_BIT_END                                 1U

/* Definition for field PC in Register MAR_169 */
#define MAR_169_PC_BIT_START                                0U
#define MAR_169_PC_BIT_END                                  0U

/* Definition for field RESV_1 in Register MAR_170 */
#define MAR_170_RESV_1_BIT_START                            4U
#define MAR_170_RESV_1_BIT_END                              31U

/* Definition for field PFX in Register MAR_170 */
#define MAR_170_PFX_BIT_START                               3U
#define MAR_170_PFX_BIT_END                                 3U

/* Definition for field PCX in Register MAR_170 */
#define MAR_170_PCX_BIT_START                               2U
#define MAR_170_PCX_BIT_END                                 2U

/* Definition for field WTE in Register MAR_170 */
#define MAR_170_WTE_BIT_START                               1U
#define MAR_170_WTE_BIT_END                                 1U

/* Definition for field PC in Register MAR_170 */
#define MAR_170_PC_BIT_START                                0U
#define MAR_170_PC_BIT_END                                  0U

/* Definition for field RESV_1 in Register MAR_171 */
#define MAR_171_RESV_1_BIT_START                            4U
#define MAR_171_RESV_1_BIT_END                              31U

/* Definition for field PFX in Register MAR_171 */
#define MAR_171_PFX_BIT_START                               3U
#define MAR_171_PFX_BIT_END                                 3U

/* Definition for field PCX in Register MAR_171 */
#define MAR_171_PCX_BIT_START                               2U
#define MAR_171_PCX_BIT_END                                 2U

/* Definition for field WTE in Register MAR_171 */
#define MAR_171_WTE_BIT_START                               1U
#define MAR_171_WTE_BIT_END                                 1U

/* Definition for field PC in Register MAR_171 */
#define MAR_171_PC_BIT_START                                0U
#define MAR_171_PC_BIT_END                                  0U

/* Definition for field RESV_1 in Register MAR_172 */
#define MAR_172_RESV_1_BIT_START                            4U
#define MAR_172_RESV_1_BIT_END                              31U

/* Definition for field PFX in Register MAR_172 */
#define MAR_172_PFX_BIT_START                               3U
#define MAR_172_PFX_BIT_END                                 3U

/* Definition for field PCX in Register MAR_172 */
#define MAR_172_PCX_BIT_START                               2U
#define MAR_172_PCX_BIT_END                                 2U

/* Definition for field WTE in Register MAR_172 */
#define MAR_172_WTE_BIT_START                               1U
#define MAR_172_WTE_BIT_END                                 1U

/* Definition for field PC in Register MAR_172 */
#define MAR_172_PC_BIT_START                                0U
#define MAR_172_PC_BIT_END                                  0U

/* Definition for field RESV_1 in Register MAR_173 */
#define MAR_173_RESV_1_BIT_START                            4U
#define MAR_173_RESV_1_BIT_END                              31U

/* Definition for field PFX in Register MAR_173 */
#define MAR_173_PFX_BIT_START                               3U
#define MAR_173_PFX_BIT_END                                 3U

/* Definition for field PCX in Register MAR_173 */
#define MAR_173_PCX_BIT_START                               2U
#define MAR_173_PCX_BIT_END                                 2U

/* Definition for field WTE in Register MAR_173 */
#define MAR_173_WTE_BIT_START                               1U
#define MAR_173_WTE_BIT_END                                 1U

/* Definition for field PC in Register MAR_173 */
#define MAR_173_PC_BIT_START                                0U
#define MAR_173_PC_BIT_END                                  0U

/* Definition for field RESV_1 in Register MAR_174 */
#define MAR_174_RESV_1_BIT_START                            4U
#define MAR_174_RESV_1_BIT_END                              31U

/* Definition for field PFX in Register MAR_174 */
#define MAR_174_PFX_BIT_START                               3U
#define MAR_174_PFX_BIT_END                                 3U

/* Definition for field PCX in Register MAR_174 */
#define MAR_174_PCX_BIT_START                               2U
#define MAR_174_PCX_BIT_END                                 2U

/* Definition for field WTE in Register MAR_174 */
#define MAR_174_WTE_BIT_START                               1U
#define MAR_174_WTE_BIT_END                                 1U

/* Definition for field PC in Register MAR_174 */
#define MAR_174_PC_BIT_START                                0U
#define MAR_174_PC_BIT_END                                  0U

/* Definition for field RESV_1 in Register MAR_175 */
#define MAR_175_RESV_1_BIT_START                            4U
#define MAR_175_RESV_1_BIT_END                              31U

/* Definition for field PFX in Register MAR_175 */
#define MAR_175_PFX_BIT_START                               3U
#define MAR_175_PFX_BIT_END                                 3U

/* Definition for field PCX in Register MAR_175 */
#define MAR_175_PCX_BIT_START                               2U
#define MAR_175_PCX_BIT_END                                 2U

/* Definition for field WTE in Register MAR_175 */
#define MAR_175_WTE_BIT_START                               1U
#define MAR_175_WTE_BIT_END                                 1U

/* Definition for field PC in Register MAR_175 */
#define MAR_175_PC_BIT_START                                0U
#define MAR_175_PC_BIT_END                                  0U

/* Definition for field RESV_1 in Register MAR_176 */
#define MAR_176_RESV_1_BIT_START                            4U
#define MAR_176_RESV_1_BIT_END                              31U

/* Definition for field PFX in Register MAR_176 */
#define MAR_176_PFX_BIT_START                               3U
#define MAR_176_PFX_BIT_END                                 3U

/* Definition for field PCX in Register MAR_176 */
#define MAR_176_PCX_BIT_START                               2U
#define MAR_176_PCX_BIT_END                                 2U

/* Definition for field WTE in Register MAR_176 */
#define MAR_176_WTE_BIT_START                               1U
#define MAR_176_WTE_BIT_END                                 1U

/* Definition for field PC in Register MAR_176 */
#define MAR_176_PC_BIT_START                                0U
#define MAR_176_PC_BIT_END                                  0U

/* Definition for field RESV_1 in Register MAR_177 */
#define MAR_177_RESV_1_BIT_START                            4U
#define MAR_177_RESV_1_BIT_END                              31U

/* Definition for field PFX in Register MAR_177 */
#define MAR_177_PFX_BIT_START                               3U
#define MAR_177_PFX_BIT_END                                 3U

