0xastro/fmcw-RADAR/mmwave_sdk/packages/ti/drivers/soc/include/reg_dspicfg.h
/* Definition for field PCX in Register MAR_177 */
#define MAR_177_PCX_BIT_START                               2U
#define MAR_177_PCX_BIT_END                                 2U

/* Definition for field WTE in Register MAR_177 */
#define MAR_177_WTE_BIT_START                               1U
#define MAR_177_WTE_BIT_END                                 1U

/* Definition for field PC in Register MAR_177 */
#define MAR_177_PC_BIT_START                                0U
#define MAR_177_PC_BIT_END                                  0U

/* Definition for field RESV_1 in Register MAR_178 */
#define MAR_178_RESV_1_BIT_START                            4U
#define MAR_178_RESV_1_BIT_END                              31U

/* Definition for field PFX in Register MAR_178 */
#define MAR_178_PFX_BIT_START                               3U
#define MAR_178_PFX_BIT_END                                 3U

/* Definition for field PCX in Register MAR_178 */
#define MAR_178_PCX_BIT_START                               2U
#define MAR_178_PCX_BIT_END                                 2U

/* Definition for field WTE in Register MAR_178 */
#define MAR_178_WTE_BIT_START                               1U
#define MAR_178_WTE_BIT_END                                 1U

/* Definition for field PC in Register MAR_178 */
#define MAR_178_PC_BIT_START                                0U
#define MAR_178_PC_BIT_END                                  0U

/* Definition for field RESV_1 in Register MAR_179 */
#define MAR_179_RESV_1_BIT_START                            4U
#define MAR_179_RESV_1_BIT_END                              31U

/* Definition for field PFX in Register MAR_179 */
#define MAR_179_PFX_BIT_START                               3U
#define MAR_179_PFX_BIT_END                                 3U

/* Definition for field PCX in Register MAR_179 */
#define MAR_179_PCX_BIT_START                               2U
#define MAR_179_PCX_BIT_END                                 2U

/* Definition for field WTE in Register MAR_179 */
#define MAR_179_WTE_BIT_START                               1U
#define MAR_179_WTE_BIT_END                                 1U

/* Definition for field PC in Register MAR_179 */
#define MAR_179_PC_BIT_START                                0U
#define MAR_179_PC_BIT_END                                  0U

/* Definition for field RESV_1 in Register MAR_180 */
#define MAR_180_RESV_1_BIT_START                            4U
#define MAR_180_RESV_1_BIT_END                              31U

/* Definition for field PFX in Register MAR_180 */
#define MAR_180_PFX_BIT_START                               3U
#define MAR_180_PFX_BIT_END                                 3U

/* Definition for field PCX in Register MAR_180 */
#define MAR_180_PCX_BIT_START                               2U
#define MAR_180_PCX_BIT_END                                 2U

/* Definition for field WTE in Register MAR_180 */
#define MAR_180_WTE_BIT_START                               1U
#define MAR_180_WTE_BIT_END                                 1U

/* Definition for field PC in Register MAR_180 */
#define MAR_180_PC_BIT_START                                0U
#define MAR_180_PC_BIT_END                                  0U

/* Definition for field RESV_1 in Register MAR_181 */
#define MAR_181_RESV_1_BIT_START                            4U
#define MAR_181_RESV_1_BIT_END                              31U

/* Definition for field PFX in Register MAR_181 */
#define MAR_181_PFX_BIT_START                               3U
#define MAR_181_PFX_BIT_END                                 3U

/* Definition for field PCX in Register MAR_181 */
#define MAR_181_PCX_BIT_START                               2U
#define MAR_181_PCX_BIT_END                                 2U

/* Definition for field WTE in Register MAR_181 */
#define MAR_181_WTE_BIT_START                               1U
#define MAR_181_WTE_BIT_END                                 1U

/* Definition for field PC in Register MAR_181 */
#define MAR_181_PC_BIT_START                                0U
#define MAR_181_PC_BIT_END                                  0U

/* Definition for field RESV_1 in Register MAR_182 */
#define MAR_182_RESV_1_BIT_START                            4U
#define MAR_182_RESV_1_BIT_END                              31U

/* Definition for field PFX in Register MAR_182 */
#define MAR_182_PFX_BIT_START                               3U
#define MAR_182_PFX_BIT_END                                 3U

/* Definition for field PCX in Register MAR_182 */
#define MAR_182_PCX_BIT_START                               2U
#define MAR_182_PCX_BIT_END                                 2U

/* Definition for field WTE in Register MAR_182 */
#define MAR_182_WTE_BIT_START                               1U
#define MAR_182_WTE_BIT_END                                 1U

/* Definition for field PC in Register MAR_182 */
#define MAR_182_PC_BIT_START                                0U
#define MAR_182_PC_BIT_END                                  0U

/* Definition for field RESV_1 in Register MAR_183 */
#define MAR_183_RESV_1_BIT_START                            4U
#define MAR_183_RESV_1_BIT_END                              31U

/* Definition for field PFX in Register MAR_183 */
#define MAR_183_PFX_BIT_START                               3U
#define MAR_183_PFX_BIT_END                                 3U

/* Definition for field PCX in Register MAR_183 */
#define MAR_183_PCX_BIT_START                               2U
#define MAR_183_PCX_BIT_END                                 2U

/* Definition for field WTE in Register MAR_183 */
#define MAR_183_WTE_BIT_START                               1U
#define MAR_183_WTE_BIT_END                                 1U

/* Definition for field PC in Register MAR_183 */
#define MAR_183_PC_BIT_START                                0U
#define MAR_183_PC_BIT_END                                  0U

/* Definition for field RESV_1 in Register MAR_184 */
#define MAR_184_RESV_1_BIT_START                            4U
#define MAR_184_RESV_1_BIT_END                              31U

/* Definition for field PFX in Register MAR_184 */
#define MAR_184_PFX_BIT_START                               3U
#define MAR_184_PFX_BIT_END                                 3U

/* Definition for field PCX in Register MAR_184 */
#define MAR_184_PCX_BIT_START                               2U
#define MAR_184_PCX_BIT_END                                 2U

