0xastro/fmcw-RADAR/mmwave_sdk/packages/ti/drivers/soc/include/reg_dspicfg.h
/* Definition for field WTE in Register MAR_184 */
#define MAR_184_WTE_BIT_START                               1U
#define MAR_184_WTE_BIT_END                                 1U

/* Definition for field PC in Register MAR_184 */
#define MAR_184_PC_BIT_START                                0U
#define MAR_184_PC_BIT_END                                  0U

/* Definition for field RESV_1 in Register MAR_185 */
#define MAR_185_RESV_1_BIT_START                            4U
#define MAR_185_RESV_1_BIT_END                              31U

/* Definition for field PFX in Register MAR_185 */
#define MAR_185_PFX_BIT_START                               3U
#define MAR_185_PFX_BIT_END                                 3U

/* Definition for field PCX in Register MAR_185 */
#define MAR_185_PCX_BIT_START                               2U
#define MAR_185_PCX_BIT_END                                 2U

/* Definition for field WTE in Register MAR_185 */
#define MAR_185_WTE_BIT_START                               1U
#define MAR_185_WTE_BIT_END                                 1U

/* Definition for field PC in Register MAR_185 */
#define MAR_185_PC_BIT_START                                0U
#define MAR_185_PC_BIT_END                                  0U

/* Definition for field RESV_1 in Register MAR_186 */
#define MAR_186_RESV_1_BIT_START                            4U
#define MAR_186_RESV_1_BIT_END                              31U

/* Definition for field PFX in Register MAR_186 */
#define MAR_186_PFX_BIT_START                               3U
#define MAR_186_PFX_BIT_END                                 3U

/* Definition for field PCX in Register MAR_186 */
#define MAR_186_PCX_BIT_START                               2U
#define MAR_186_PCX_BIT_END                                 2U

/* Definition for field WTE in Register MAR_186 */
#define MAR_186_WTE_BIT_START                               1U
#define MAR_186_WTE_BIT_END                                 1U

/* Definition for field PC in Register MAR_186 */
#define MAR_186_PC_BIT_START                                0U
#define MAR_186_PC_BIT_END                                  0U

/* Definition for field RESV_1 in Register MAR_187 */
#define MAR_187_RESV_1_BIT_START                            4U
#define MAR_187_RESV_1_BIT_END                              31U

/* Definition for field PFX in Register MAR_187 */
#define MAR_187_PFX_BIT_START                               3U
#define MAR_187_PFX_BIT_END                                 3U

/* Definition for field PCX in Register MAR_187 */
#define MAR_187_PCX_BIT_START                               2U
#define MAR_187_PCX_BIT_END                                 2U

/* Definition for field WTE in Register MAR_187 */
#define MAR_187_WTE_BIT_START                               1U
#define MAR_187_WTE_BIT_END                                 1U

/* Definition for field PC in Register MAR_187 */
#define MAR_187_PC_BIT_START                                0U
#define MAR_187_PC_BIT_END                                  0U

/* Definition for field RESV_1 in Register MAR_188 */
#define MAR_188_RESV_1_BIT_START                            4U
#define MAR_188_RESV_1_BIT_END                              31U

/* Definition for field PFX in Register MAR_188 */
#define MAR_188_PFX_BIT_START                               3U
#define MAR_188_PFX_BIT_END                                 3U

/* Definition for field PCX in Register MAR_188 */
#define MAR_188_PCX_BIT_START                               2U
#define MAR_188_PCX_BIT_END                                 2U

/* Definition for field WTE in Register MAR_188 */
#define MAR_188_WTE_BIT_START                               1U
#define MAR_188_WTE_BIT_END                                 1U

/* Definition for field PC in Register MAR_188 */
#define MAR_188_PC_BIT_START                                0U
#define MAR_188_PC_BIT_END                                  0U

/* Definition for field RESV_1 in Register MAR_189 */
#define MAR_189_RESV_1_BIT_START                            4U
#define MAR_189_RESV_1_BIT_END                              31U

/* Definition for field PFX in Register MAR_189 */
#define MAR_189_PFX_BIT_START                               3U
#define MAR_189_PFX_BIT_END                                 3U

/* Definition for field PCX in Register MAR_189 */
#define MAR_189_PCX_BIT_START                               2U
#define MAR_189_PCX_BIT_END                                 2U

/* Definition for field WTE in Register MAR_189 */
#define MAR_189_WTE_BIT_START                               1U
#define MAR_189_WTE_BIT_END                                 1U

/* Definition for field PC in Register MAR_189 */
#define MAR_189_PC_BIT_START                                0U
#define MAR_189_PC_BIT_END                                  0U

/* Definition for field RESV_1 in Register MAR_190 */
#define MAR_190_RESV_1_BIT_START                            4U
#define MAR_190_RESV_1_BIT_END                              31U

/* Definition for field PFX in Register MAR_190 */
#define MAR_190_PFX_BIT_START                               3U
#define MAR_190_PFX_BIT_END                                 3U

/* Definition for field PCX in Register MAR_190 */
#define MAR_190_PCX_BIT_START                               2U
#define MAR_190_PCX_BIT_END                                 2U

/* Definition for field WTE in Register MAR_190 */
#define MAR_190_WTE_BIT_START                               1U
#define MAR_190_WTE_BIT_END                                 1U

/* Definition for field PC in Register MAR_190 */
#define MAR_190_PC_BIT_START                                0U
#define MAR_190_PC_BIT_END                                  0U

/* Definition for field RESV_1 in Register MAR_191 */
#define MAR_191_RESV_1_BIT_START                            4U
#define MAR_191_RESV_1_BIT_END                              31U

/* Definition for field PFX in Register MAR_191 */
#define MAR_191_PFX_BIT_START                               3U
#define MAR_191_PFX_BIT_END                                 3U

/* Definition for field PCX in Register MAR_191 */
#define MAR_191_PCX_BIT_START                               2U
#define MAR_191_PCX_BIT_END                                 2U

/* Definition for field WTE in Register MAR_191 */
#define MAR_191_WTE_BIT_START                               1U
#define MAR_191_WTE_BIT_END                                 1U

/* Definition for field PC in Register MAR_191 */
#define MAR_191_PC_BIT_START                                0U
#define MAR_191_PC_BIT_END                                  0U

/* Definition for field RESV_1 in Register MAR_192 */
#define MAR_192_RESV_1_BIT_START                            4U
#define MAR_192_RESV_1_BIT_END                              31U

/* Definition for field PFX in Register MAR_192 */
#define MAR_192_PFX_BIT_START                               3U
#define MAR_192_PFX_BIT_END                                 3U

/* Definition for field PCX in Register MAR_192 */
#define MAR_192_PCX_BIT_START                               2U
#define MAR_192_PCX_BIT_END                                 2U

