0xastro/fmcw-RADAR/mmwave_sdk/packages/ti/drivers/soc/include/reg_dspicfg.h
/* Definition for field WTE in Register MAR_192 */
#define MAR_192_WTE_BIT_START                               1U
#define MAR_192_WTE_BIT_END                                 1U

/* Definition for field PC in Register MAR_192 */
#define MAR_192_PC_BIT_START                                0U
#define MAR_192_PC_BIT_END                                  0U

/* Definition for field RESV_1 in Register MAR_193 */
#define MAR_193_RESV_1_BIT_START                            4U
#define MAR_193_RESV_1_BIT_END                              31U

/* Definition for field PFX in Register MAR_193 */
#define MAR_193_PFX_BIT_START                               3U
#define MAR_193_PFX_BIT_END                                 3U

/* Definition for field PCX in Register MAR_193 */
#define MAR_193_PCX_BIT_START                               2U
#define MAR_193_PCX_BIT_END                                 2U

/* Definition for field WTE in Register MAR_193 */
#define MAR_193_WTE_BIT_START                               1U
#define MAR_193_WTE_BIT_END                                 1U

/* Definition for field PC in Register MAR_193 */
#define MAR_193_PC_BIT_START                                0U
#define MAR_193_PC_BIT_END                                  0U

/* Definition for field RESV_1 in Register MAR_194 */
#define MAR_194_RESV_1_BIT_START                            4U
#define MAR_194_RESV_1_BIT_END                              31U

/* Definition for field PFX in Register MAR_194 */
#define MAR_194_PFX_BIT_START                               3U
#define MAR_194_PFX_BIT_END                                 3U

/* Definition for field PCX in Register MAR_194 */
#define MAR_194_PCX_BIT_START                               2U
#define MAR_194_PCX_BIT_END                                 2U

/* Definition for field WTE in Register MAR_194 */
#define MAR_194_WTE_BIT_START                               1U
#define MAR_194_WTE_BIT_END                                 1U

/* Definition for field PC in Register MAR_194 */
#define MAR_194_PC_BIT_START                                0U
#define MAR_194_PC_BIT_END                                  0U

/* Definition for field RESV_1 in Register MAR_195 */
#define MAR_195_RESV_1_BIT_START                            4U
#define MAR_195_RESV_1_BIT_END                              31U

/* Definition for field PFX in Register MAR_195 */
#define MAR_195_PFX_BIT_START                               3U
#define MAR_195_PFX_BIT_END                                 3U

/* Definition for field PCX in Register MAR_195 */
#define MAR_195_PCX_BIT_START                               2U
#define MAR_195_PCX_BIT_END                                 2U

/* Definition for field WTE in Register MAR_195 */
#define MAR_195_WTE_BIT_START                               1U
#define MAR_195_WTE_BIT_END                                 1U

/* Definition for field PC in Register MAR_195 */
#define MAR_195_PC_BIT_START                                0U
#define MAR_195_PC_BIT_END                                  0U

/* Definition for field RESV_1 in Register MAR_196 */
#define MAR_196_RESV_1_BIT_START                            4U
#define MAR_196_RESV_1_BIT_END                              31U

/* Definition for field PFX in Register MAR_196 */
#define MAR_196_PFX_BIT_START                               3U
#define MAR_196_PFX_BIT_END                                 3U

/* Definition for field PCX in Register MAR_196 */
#define MAR_196_PCX_BIT_START                               2U
#define MAR_196_PCX_BIT_END                                 2U

/* Definition for field WTE in Register MAR_196 */
#define MAR_196_WTE_BIT_START                               1U
#define MAR_196_WTE_BIT_END                                 1U

/* Definition for field PC in Register MAR_196 */
#define MAR_196_PC_BIT_START                                0U
#define MAR_196_PC_BIT_END                                  0U

/* Definition for field RESV_1 in Register MAR_197 */
#define MAR_197_RESV_1_BIT_START                            4U
#define MAR_197_RESV_1_BIT_END                              31U

/* Definition for field PFX in Register MAR_197 */
#define MAR_197_PFX_BIT_START                               3U
#define MAR_197_PFX_BIT_END                                 3U

/* Definition for field PCX in Register MAR_197 */
#define MAR_197_PCX_BIT_START                               2U
#define MAR_197_PCX_BIT_END                                 2U

/* Definition for field WTE in Register MAR_197 */
#define MAR_197_WTE_BIT_START                               1U
#define MAR_197_WTE_BIT_END                                 1U

/* Definition for field PC in Register MAR_197 */
#define MAR_197_PC_BIT_START                                0U
#define MAR_197_PC_BIT_END                                  0U

/* Definition for field RESV_1 in Register MAR_198 */
#define MAR_198_RESV_1_BIT_START                            4U
#define MAR_198_RESV_1_BIT_END                              31U

/* Definition for field PFX in Register MAR_198 */
#define MAR_198_PFX_BIT_START                               3U
#define MAR_198_PFX_BIT_END                                 3U

/* Definition for field PCX in Register MAR_198 */
#define MAR_198_PCX_BIT_START                               2U
#define MAR_198_PCX_BIT_END                                 2U

/* Definition for field WTE in Register MAR_198 */
#define MAR_198_WTE_BIT_START                               1U
#define MAR_198_WTE_BIT_END                                 1U

/* Definition for field PC in Register MAR_198 */
#define MAR_198_PC_BIT_START                                0U
#define MAR_198_PC_BIT_END                                  0U

/* Definition for field RESV_1 in Register MAR_199 */
#define MAR_199_RESV_1_BIT_START                            4U
#define MAR_199_RESV_1_BIT_END                              31U

/* Definition for field PFX in Register MAR_199 */
#define MAR_199_PFX_BIT_START                               3U
#define MAR_199_PFX_BIT_END                                 3U

/* Definition for field PCX in Register MAR_199 */
#define MAR_199_PCX_BIT_START                               2U
#define MAR_199_PCX_BIT_END                                 2U

/* Definition for field WTE in Register MAR_199 */
#define MAR_199_WTE_BIT_START                               1U
#define MAR_199_WTE_BIT_END                                 1U

