0xastro/fmcw-RADAR/mmwave_sdk/packages/ti/drivers/soc/include/reg_dspicfg.h
/* Definition for field PC in Register MAR_199 */
#define MAR_199_PC_BIT_START                                0U
#define MAR_199_PC_BIT_END                                  0U

/* Definition for field RESV_1 in Register MAR_200 */
#define MAR_200_RESV_1_BIT_START                            4U
#define MAR_200_RESV_1_BIT_END                              31U

/* Definition for field PFX in Register MAR_200 */
#define MAR_200_PFX_BIT_START                               3U
#define MAR_200_PFX_BIT_END                                 3U

/* Definition for field PCX in Register MAR_200 */
#define MAR_200_PCX_BIT_START                               2U
#define MAR_200_PCX_BIT_END                                 2U

/* Definition for field WTE in Register MAR_200 */
#define MAR_200_WTE_BIT_START                               1U
#define MAR_200_WTE_BIT_END                                 1U

/* Definition for field PC in Register MAR_200 */
#define MAR_200_PC_BIT_START                                0U
#define MAR_200_PC_BIT_END                                  0U

/* Definition for field RESV_1 in Register MAR_201 */
#define MAR_201_RESV_1_BIT_START                            4U
#define MAR_201_RESV_1_BIT_END                              31U

/* Definition for field PFX in Register MAR_201 */
#define MAR_201_PFX_BIT_START                               3U
#define MAR_201_PFX_BIT_END                                 3U

/* Definition for field PCX in Register MAR_201 */
#define MAR_201_PCX_BIT_START                               2U
#define MAR_201_PCX_BIT_END                                 2U

/* Definition for field WTE in Register MAR_201 */
#define MAR_201_WTE_BIT_START                               1U
#define MAR_201_WTE_BIT_END                                 1U

/* Definition for field PC in Register MAR_201 */
#define MAR_201_PC_BIT_START                                0U
#define MAR_201_PC_BIT_END                                  0U

/* Definition for field RESV_1 in Register MAR_202 */
#define MAR_202_RESV_1_BIT_START                            4U
#define MAR_202_RESV_1_BIT_END                              31U

/* Definition for field PFX in Register MAR_202 */
#define MAR_202_PFX_BIT_START                               3U
#define MAR_202_PFX_BIT_END                                 3U

/* Definition for field PCX in Register MAR_202 */
#define MAR_202_PCX_BIT_START                               2U
#define MAR_202_PCX_BIT_END                                 2U

/* Definition for field WTE in Register MAR_202 */
#define MAR_202_WTE_BIT_START                               1U
#define MAR_202_WTE_BIT_END                                 1U

/* Definition for field PC in Register MAR_202 */
#define MAR_202_PC_BIT_START                                0U
#define MAR_202_PC_BIT_END                                  0U

/* Definition for field RESV_1 in Register MAR_203 */
#define MAR_203_RESV_1_BIT_START                            4U
#define MAR_203_RESV_1_BIT_END                              31U

/* Definition for field PFX in Register MAR_203 */
#define MAR_203_PFX_BIT_START                               3U
#define MAR_203_PFX_BIT_END                                 3U

/* Definition for field PCX in Register MAR_203 */
#define MAR_203_PCX_BIT_START                               2U
#define MAR_203_PCX_BIT_END                                 2U

/* Definition for field WTE in Register MAR_203 */
#define MAR_203_WTE_BIT_START                               1U
#define MAR_203_WTE_BIT_END                                 1U

/* Definition for field PC in Register MAR_203 */
#define MAR_203_PC_BIT_START                                0U
#define MAR_203_PC_BIT_END                                  0U

/* Definition for field RESV_1 in Register MAR_204 */
#define MAR_204_RESV_1_BIT_START                            4U
#define MAR_204_RESV_1_BIT_END                              31U

/* Definition for field PFX in Register MAR_204 */
#define MAR_204_PFX_BIT_START                               3U
#define MAR_204_PFX_BIT_END                                 3U

/* Definition for field PCX in Register MAR_204 */
#define MAR_204_PCX_BIT_START                               2U
#define MAR_204_PCX_BIT_END                                 2U

/* Definition for field WTE in Register MAR_204 */
#define MAR_204_WTE_BIT_START                               1U
#define MAR_204_WTE_BIT_END                                 1U

/* Definition for field PC in Register MAR_204 */
#define MAR_204_PC_BIT_START                                0U
#define MAR_204_PC_BIT_END                                  0U

/* Definition for field RESV_1 in Register MAR_205 */
#define MAR_205_RESV_1_BIT_START                            4U
#define MAR_205_RESV_1_BIT_END                              31U

/* Definition for field PFX in Register MAR_205 */
#define MAR_205_PFX_BIT_START                               3U
#define MAR_205_PFX_BIT_END                                 3U

/* Definition for field PCX in Register MAR_205 */
#define MAR_205_PCX_BIT_START                               2U
#define MAR_205_PCX_BIT_END                                 2U

/* Definition for field WTE in Register MAR_205 */
#define MAR_205_WTE_BIT_START                               1U
#define MAR_205_WTE_BIT_END                                 1U

/* Definition for field PC in Register MAR_205 */
#define MAR_205_PC_BIT_START                                0U
#define MAR_205_PC_BIT_END                                  0U

/* Definition for field RESV_1 in Register MAR_206 */
#define MAR_206_RESV_1_BIT_START                            4U
#define MAR_206_RESV_1_BIT_END                              31U

/* Definition for field PFX in Register MAR_206 */
#define MAR_206_PFX_BIT_START                               3U
#define MAR_206_PFX_BIT_END                                 3U

/* Definition for field PCX in Register MAR_206 */
#define MAR_206_PCX_BIT_START                               2U
#define MAR_206_PCX_BIT_END                                 2U

