0xastro/fmcw-RADAR/mmwave_sdk/packages/ti/drivers/soc/include/reg_dspicfg.h
/* Definition for field WTE in Register MAR_206 */
#define MAR_206_WTE_BIT_START                               1U
#define MAR_206_WTE_BIT_END                                 1U

/* Definition for field PC in Register MAR_206 */
#define MAR_206_PC_BIT_START                                0U
#define MAR_206_PC_BIT_END                                  0U

/* Definition for field RESV_1 in Register MAR_207 */
#define MAR_207_RESV_1_BIT_START                            4U
#define MAR_207_RESV_1_BIT_END                              31U

/* Definition for field PFX in Register MAR_207 */
#define MAR_207_PFX_BIT_START                               3U
#define MAR_207_PFX_BIT_END                                 3U

/* Definition for field PCX in Register MAR_207 */
#define MAR_207_PCX_BIT_START                               2U
#define MAR_207_PCX_BIT_END                                 2U

/* Definition for field WTE in Register MAR_207 */
#define MAR_207_WTE_BIT_START                               1U
#define MAR_207_WTE_BIT_END                                 1U

/* Definition for field PC in Register MAR_207 */
#define MAR_207_PC_BIT_START                                0U
#define MAR_207_PC_BIT_END                                  0U

/* Definition for field RESV_1 in Register MAR_208 */
#define MAR_208_RESV_1_BIT_START                            4U
#define MAR_208_RESV_1_BIT_END                              31U

/* Definition for field PFX in Register MAR_208 */
#define MAR_208_PFX_BIT_START                               3U
#define MAR_208_PFX_BIT_END                                 3U

/* Definition for field PCX in Register MAR_208 */
#define MAR_208_PCX_BIT_START                               2U
#define MAR_208_PCX_BIT_END                                 2U

/* Definition for field WTE in Register MAR_208 */
#define MAR_208_WTE_BIT_START                               1U
#define MAR_208_WTE_BIT_END                                 1U

/* Definition for field PC in Register MAR_208 */
#define MAR_208_PC_BIT_START                                0U
#define MAR_208_PC_BIT_END                                  0U

/* Definition for field RESV_1 in Register MAR_209 */
#define MAR_209_RESV_1_BIT_START                            4U
#define MAR_209_RESV_1_BIT_END                              31U

/* Definition for field PFX in Register MAR_209 */
#define MAR_209_PFX_BIT_START                               3U
#define MAR_209_PFX_BIT_END                                 3U

/* Definition for field PCX in Register MAR_209 */
#define MAR_209_PCX_BIT_START                               2U
#define MAR_209_PCX_BIT_END                                 2U

/* Definition for field WTE in Register MAR_209 */
#define MAR_209_WTE_BIT_START                               1U
#define MAR_209_WTE_BIT_END                                 1U

/* Definition for field PC in Register MAR_209 */
#define MAR_209_PC_BIT_START                                0U
#define MAR_209_PC_BIT_END                                  0U

/* Definition for field RESV_1 in Register MAR_210 */
#define MAR_210_RESV_1_BIT_START                            4U
#define MAR_210_RESV_1_BIT_END                              31U

/* Definition for field PFX in Register MAR_210 */
#define MAR_210_PFX_BIT_START                               3U
#define MAR_210_PFX_BIT_END                                 3U

/* Definition for field PCX in Register MAR_210 */
#define MAR_210_PCX_BIT_START                               2U
#define MAR_210_PCX_BIT_END                                 2U

/* Definition for field WTE in Register MAR_210 */
#define MAR_210_WTE_BIT_START                               1U
#define MAR_210_WTE_BIT_END                                 1U

/* Definition for field PC in Register MAR_210 */
#define MAR_210_PC_BIT_START                                0U
#define MAR_210_PC_BIT_END                                  0U

/* Definition for field RESV_1 in Register MAR_211 */
#define MAR_211_RESV_1_BIT_START                            4U
#define MAR_211_RESV_1_BIT_END                              31U

/* Definition for field PFX in Register MAR_211 */
#define MAR_211_PFX_BIT_START                               3U
#define MAR_211_PFX_BIT_END                                 3U

/* Definition for field PCX in Register MAR_211 */
#define MAR_211_PCX_BIT_START                               2U
#define MAR_211_PCX_BIT_END                                 2U

/* Definition for field WTE in Register MAR_211 */
#define MAR_211_WTE_BIT_START                               1U
#define MAR_211_WTE_BIT_END                                 1U

/* Definition for field PC in Register MAR_211 */
#define MAR_211_PC_BIT_START                                0U
#define MAR_211_PC_BIT_END                                  0U

/* Definition for field RESV_1 in Register MAR_212 */
#define MAR_212_RESV_1_BIT_START                            4U
#define MAR_212_RESV_1_BIT_END                              31U

/* Definition for field PFX in Register MAR_212 */
#define MAR_212_PFX_BIT_START                               3U
#define MAR_212_PFX_BIT_END                                 3U

/* Definition for field PCX in Register MAR_212 */
#define MAR_212_PCX_BIT_START                               2U
#define MAR_212_PCX_BIT_END                                 2U

/* Definition for field WTE in Register MAR_212 */
#define MAR_212_WTE_BIT_START                               1U
#define MAR_212_WTE_BIT_END                                 1U

/* Definition for field PC in Register MAR_212 */
#define MAR_212_PC_BIT_START                                0U
#define MAR_212_PC_BIT_END                                  0U

/* Definition for field RESV_1 in Register MAR_213 */
#define MAR_213_RESV_1_BIT_START                            4U
#define MAR_213_RESV_1_BIT_END                              31U

/* Definition for field PFX in Register MAR_213 */
#define MAR_213_PFX_BIT_START                               3U
#define MAR_213_PFX_BIT_END                                 3U

/* Definition for field PCX in Register MAR_213 */
#define MAR_213_PCX_BIT_START                               2U
#define MAR_213_PCX_BIT_END                                 2U

/* Definition for field WTE in Register MAR_213 */
#define MAR_213_WTE_BIT_START                               1U
#define MAR_213_WTE_BIT_END                                 1U

/* Definition for field PC in Register MAR_213 */
#define MAR_213_PC_BIT_START                                0U
#define MAR_213_PC_BIT_END                                  0U

/* Definition for field RESV_1 in Register MAR_214 */
#define MAR_214_RESV_1_BIT_START                            4U
#define MAR_214_RESV_1_BIT_END                              31U

/* Definition for field PFX in Register MAR_214 */
#define MAR_214_PFX_BIT_START                               3U
#define MAR_214_PFX_BIT_END                                 3U

