0xastro/fmcw-RADAR/mmwave_sdk/packages/ti/drivers/soc/include/reg_dspicfg.h
/* Definition for field PCX in Register MAR_214 */
#define MAR_214_PCX_BIT_START                               2U
#define MAR_214_PCX_BIT_END                                 2U

/* Definition for field WTE in Register MAR_214 */
#define MAR_214_WTE_BIT_START                               1U
#define MAR_214_WTE_BIT_END                                 1U

/* Definition for field PC in Register MAR_214 */
#define MAR_214_PC_BIT_START                                0U
#define MAR_214_PC_BIT_END                                  0U

/* Definition for field RESV_1 in Register MAR_215 */
#define MAR_215_RESV_1_BIT_START                            4U
#define MAR_215_RESV_1_BIT_END                              31U

/* Definition for field PFX in Register MAR_215 */
#define MAR_215_PFX_BIT_START                               3U
#define MAR_215_PFX_BIT_END                                 3U

/* Definition for field PCX in Register MAR_215 */
#define MAR_215_PCX_BIT_START                               2U
#define MAR_215_PCX_BIT_END                                 2U

/* Definition for field WTE in Register MAR_215 */
#define MAR_215_WTE_BIT_START                               1U
#define MAR_215_WTE_BIT_END                                 1U

/* Definition for field PC in Register MAR_215 */
#define MAR_215_PC_BIT_START                                0U
#define MAR_215_PC_BIT_END                                  0U

/* Definition for field RESV_1 in Register MAR_216 */
#define MAR_216_RESV_1_BIT_START                            4U
#define MAR_216_RESV_1_BIT_END                              31U

/* Definition for field PFX in Register MAR_216 */
#define MAR_216_PFX_BIT_START                               3U
#define MAR_216_PFX_BIT_END                                 3U

/* Definition for field PCX in Register MAR_216 */
#define MAR_216_PCX_BIT_START                               2U
#define MAR_216_PCX_BIT_END                                 2U

/* Definition for field WTE in Register MAR_216 */
#define MAR_216_WTE_BIT_START                               1U
#define MAR_216_WTE_BIT_END                                 1U

/* Definition for field PC in Register MAR_216 */
#define MAR_216_PC_BIT_START                                0U
#define MAR_216_PC_BIT_END                                  0U

/* Definition for field RESV_1 in Register MAR_217 */
#define MAR_217_RESV_1_BIT_START                            4U
#define MAR_217_RESV_1_BIT_END                              31U

/* Definition for field PFX in Register MAR_217 */
#define MAR_217_PFX_BIT_START                               3U
#define MAR_217_PFX_BIT_END                                 3U

/* Definition for field PCX in Register MAR_217 */
#define MAR_217_PCX_BIT_START                               2U
#define MAR_217_PCX_BIT_END                                 2U

/* Definition for field WTE in Register MAR_217 */
#define MAR_217_WTE_BIT_START                               1U
#define MAR_217_WTE_BIT_END                                 1U

/* Definition for field PC in Register MAR_217 */
#define MAR_217_PC_BIT_START                                0U
#define MAR_217_PC_BIT_END                                  0U

/* Definition for field RESV_1 in Register MAR_218 */
#define MAR_218_RESV_1_BIT_START                            4U
#define MAR_218_RESV_1_BIT_END                              31U

/* Definition for field PFX in Register MAR_218 */
#define MAR_218_PFX_BIT_START                               3U
#define MAR_218_PFX_BIT_END                                 3U

/* Definition for field PCX in Register MAR_218 */
#define MAR_218_PCX_BIT_START                               2U
#define MAR_218_PCX_BIT_END                                 2U

/* Definition for field WTE in Register MAR_218 */
#define MAR_218_WTE_BIT_START                               1U
#define MAR_218_WTE_BIT_END                                 1U

/* Definition for field PC in Register MAR_218 */
#define MAR_218_PC_BIT_START                                0U
#define MAR_218_PC_BIT_END                                  0U

/* Definition for field RESV_1 in Register MAR_219 */
#define MAR_219_RESV_1_BIT_START                            4U
#define MAR_219_RESV_1_BIT_END                              31U

/* Definition for field PFX in Register MAR_219 */
#define MAR_219_PFX_BIT_START                               3U
#define MAR_219_PFX_BIT_END                                 3U

/* Definition for field PCX in Register MAR_219 */
#define MAR_219_PCX_BIT_START                               2U
#define MAR_219_PCX_BIT_END                                 2U

/* Definition for field WTE in Register MAR_219 */
#define MAR_219_WTE_BIT_START                               1U
#define MAR_219_WTE_BIT_END                                 1U

/* Definition for field PC in Register MAR_219 */
#define MAR_219_PC_BIT_START                                0U
#define MAR_219_PC_BIT_END                                  0U

/* Definition for field RESV_1 in Register MAR_220 */
#define MAR_220_RESV_1_BIT_START                            4U
#define MAR_220_RESV_1_BIT_END                              31U

/* Definition for field PFX in Register MAR_220 */
#define MAR_220_PFX_BIT_START                               3U
#define MAR_220_PFX_BIT_END                                 3U

/* Definition for field PCX in Register MAR_220 */
#define MAR_220_PCX_BIT_START                               2U
#define MAR_220_PCX_BIT_END                                 2U

/* Definition for field WTE in Register MAR_220 */
#define MAR_220_WTE_BIT_START                               1U
#define MAR_220_WTE_BIT_END                                 1U

/* Definition for field PC in Register MAR_220 */
#define MAR_220_PC_BIT_START                                0U
#define MAR_220_PC_BIT_END                                  0U

/* Definition for field RESV_1 in Register MAR_221 */
#define MAR_221_RESV_1_BIT_START                            4U
#define MAR_221_RESV_1_BIT_END                              31U

/* Definition for field PFX in Register MAR_221 */
#define MAR_221_PFX_BIT_START                               3U
#define MAR_221_PFX_BIT_END                                 3U

/* Definition for field PCX in Register MAR_221 */
#define MAR_221_PCX_BIT_START                               2U
#define MAR_221_PCX_BIT_END                                 2U

/* Definition for field WTE in Register MAR_221 */
#define MAR_221_WTE_BIT_START                               1U
#define MAR_221_WTE_BIT_END                                 1U

