0xastro/fmcw-RADAR/mmwave_sdk/packages/ti/drivers/soc/include/reg_dspicfg.h
/* Definition for field PC in Register MAR_221 */
#define MAR_221_PC_BIT_START                                0U
#define MAR_221_PC_BIT_END                                  0U

/* Definition for field RESV_1 in Register MAR_222 */
#define MAR_222_RESV_1_BIT_START                            4U
#define MAR_222_RESV_1_BIT_END                              31U

/* Definition for field PFX in Register MAR_222 */
#define MAR_222_PFX_BIT_START                               3U
#define MAR_222_PFX_BIT_END                                 3U

/* Definition for field PCX in Register MAR_222 */
#define MAR_222_PCX_BIT_START                               2U
#define MAR_222_PCX_BIT_END                                 2U

/* Definition for field WTE in Register MAR_222 */
#define MAR_222_WTE_BIT_START                               1U
#define MAR_222_WTE_BIT_END                                 1U

/* Definition for field PC in Register MAR_222 */
#define MAR_222_PC_BIT_START                                0U
#define MAR_222_PC_BIT_END                                  0U

/* Definition for field RESV_1 in Register MAR_223 */
#define MAR_223_RESV_1_BIT_START                            4U
#define MAR_223_RESV_1_BIT_END                              31U

/* Definition for field PFX in Register MAR_223 */
#define MAR_223_PFX_BIT_START                               3U
#define MAR_223_PFX_BIT_END                                 3U

/* Definition for field PCX in Register MAR_223 */
#define MAR_223_PCX_BIT_START                               2U
#define MAR_223_PCX_BIT_END                                 2U

/* Definition for field WTE in Register MAR_223 */
#define MAR_223_WTE_BIT_START                               1U
#define MAR_223_WTE_BIT_END                                 1U

/* Definition for field PC in Register MAR_223 */
#define MAR_223_PC_BIT_START                                0U
#define MAR_223_PC_BIT_END                                  0U

/* Definition for field RESV_1 in Register MAR_224 */
#define MAR_224_RESV_1_BIT_START                            4U
#define MAR_224_RESV_1_BIT_END                              31U

/* Definition for field PFX in Register MAR_224 */
#define MAR_224_PFX_BIT_START                               3U
#define MAR_224_PFX_BIT_END                                 3U

/* Definition for field PCX in Register MAR_224 */
#define MAR_224_PCX_BIT_START                               2U
#define MAR_224_PCX_BIT_END                                 2U

/* Definition for field WTE in Register MAR_224 */
#define MAR_224_WTE_BIT_START                               1U
#define MAR_224_WTE_BIT_END                                 1U

/* Definition for field PC in Register MAR_224 */
#define MAR_224_PC_BIT_START                                0U
#define MAR_224_PC_BIT_END                                  0U

/* Definition for field RESV_1 in Register MAR_225 */
#define MAR_225_RESV_1_BIT_START                            4U
#define MAR_225_RESV_1_BIT_END                              31U

/* Definition for field PFX in Register MAR_225 */
#define MAR_225_PFX_BIT_START                               3U
#define MAR_225_PFX_BIT_END                                 3U

/* Definition for field PCX in Register MAR_225 */
#define MAR_225_PCX_BIT_START                               2U
#define MAR_225_PCX_BIT_END                                 2U

/* Definition for field WTE in Register MAR_225 */
#define MAR_225_WTE_BIT_START                               1U
#define MAR_225_WTE_BIT_END                                 1U

/* Definition for field PC in Register MAR_225 */
#define MAR_225_PC_BIT_START                                0U
#define MAR_225_PC_BIT_END                                  0U

/* Definition for field RESV_1 in Register MAR_226 */
#define MAR_226_RESV_1_BIT_START                            4U
#define MAR_226_RESV_1_BIT_END                              31U

/* Definition for field PFX in Register MAR_226 */
#define MAR_226_PFX_BIT_START                               3U
#define MAR_226_PFX_BIT_END                                 3U

/* Definition for field PCX in Register MAR_226 */
#define MAR_226_PCX_BIT_START                               2U
#define MAR_226_PCX_BIT_END                                 2U

/* Definition for field WTE in Register MAR_226 */
#define MAR_226_WTE_BIT_START                               1U
#define MAR_226_WTE_BIT_END                                 1U

/* Definition for field PC in Register MAR_226 */
#define MAR_226_PC_BIT_START                                0U
#define MAR_226_PC_BIT_END                                  0U

/* Definition for field RESV_1 in Register MAR_227 */
#define MAR_227_RESV_1_BIT_START                            4U
#define MAR_227_RESV_1_BIT_END                              31U

/* Definition for field PFX in Register MAR_227 */
#define MAR_227_PFX_BIT_START                               3U
#define MAR_227_PFX_BIT_END                                 3U

/* Definition for field PCX in Register MAR_227 */
#define MAR_227_PCX_BIT_START                               2U
#define MAR_227_PCX_BIT_END                                 2U

/* Definition for field WTE in Register MAR_227 */
#define MAR_227_WTE_BIT_START                               1U
#define MAR_227_WTE_BIT_END                                 1U

/* Definition for field PC in Register MAR_227 */
#define MAR_227_PC_BIT_START                                0U
#define MAR_227_PC_BIT_END                                  0U

/* Definition for field RESV_1 in Register MAR_228 */
#define MAR_228_RESV_1_BIT_START                            4U
#define MAR_228_RESV_1_BIT_END                              31U

/* Definition for field PFX in Register MAR_228 */
#define MAR_228_PFX_BIT_START                               3U
#define MAR_228_PFX_BIT_END                                 3U

/* Definition for field PCX in Register MAR_228 */
#define MAR_228_PCX_BIT_START                               2U
#define MAR_228_PCX_BIT_END                                 2U

/* Definition for field WTE in Register MAR_228 */
#define MAR_228_WTE_BIT_START                               1U
#define MAR_228_WTE_BIT_END                                 1U

/* Definition for field PC in Register MAR_228 */
#define MAR_228_PC_BIT_START                                0U
#define MAR_228_PC_BIT_END                                  0U

