0xastro/fmcw-RADAR/mmwave_sdk/packages/ti/drivers/soc/include/reg_dspicfg.h
/* Definition for field RESV_1 in Register MAR_229 */
#define MAR_229_RESV_1_BIT_START                            4U
#define MAR_229_RESV_1_BIT_END                              31U

/* Definition for field PFX in Register MAR_229 */
#define MAR_229_PFX_BIT_START                               3U
#define MAR_229_PFX_BIT_END                                 3U

/* Definition for field PCX in Register MAR_229 */
#define MAR_229_PCX_BIT_START                               2U
#define MAR_229_PCX_BIT_END                                 2U

/* Definition for field WTE in Register MAR_229 */
#define MAR_229_WTE_BIT_START                               1U
#define MAR_229_WTE_BIT_END                                 1U

/* Definition for field PC in Register MAR_229 */
#define MAR_229_PC_BIT_START                                0U
#define MAR_229_PC_BIT_END                                  0U

/* Definition for field RESV_1 in Register MAR_230 */
#define MAR_230_RESV_1_BIT_START                            4U
#define MAR_230_RESV_1_BIT_END                              31U

/* Definition for field PFX in Register MAR_230 */
#define MAR_230_PFX_BIT_START                               3U
#define MAR_230_PFX_BIT_END                                 3U

/* Definition for field PCX in Register MAR_230 */
#define MAR_230_PCX_BIT_START                               2U
#define MAR_230_PCX_BIT_END                                 2U

/* Definition for field WTE in Register MAR_230 */
#define MAR_230_WTE_BIT_START                               1U
#define MAR_230_WTE_BIT_END                                 1U

/* Definition for field PC in Register MAR_230 */
#define MAR_230_PC_BIT_START                                0U
#define MAR_230_PC_BIT_END                                  0U

/* Definition for field RESV_1 in Register MAR_231 */
#define MAR_231_RESV_1_BIT_START                            4U
#define MAR_231_RESV_1_BIT_END                              31U

/* Definition for field PFX in Register MAR_231 */
#define MAR_231_PFX_BIT_START                               3U
#define MAR_231_PFX_BIT_END                                 3U

/* Definition for field PCX in Register MAR_231 */
#define MAR_231_PCX_BIT_START                               2U
#define MAR_231_PCX_BIT_END                                 2U

/* Definition for field WTE in Register MAR_231 */
#define MAR_231_WTE_BIT_START                               1U
#define MAR_231_WTE_BIT_END                                 1U

/* Definition for field PC in Register MAR_231 */
#define MAR_231_PC_BIT_START                                0U
#define MAR_231_PC_BIT_END                                  0U

/* Definition for field RESV_1 in Register MAR_232 */
#define MAR_232_RESV_1_BIT_START                            4U
#define MAR_232_RESV_1_BIT_END                              31U

/* Definition for field PFX in Register MAR_232 */
#define MAR_232_PFX_BIT_START                               3U
#define MAR_232_PFX_BIT_END                                 3U

/* Definition for field PCX in Register MAR_232 */
#define MAR_232_PCX_BIT_START                               2U
#define MAR_232_PCX_BIT_END                                 2U

/* Definition for field WTE in Register MAR_232 */
#define MAR_232_WTE_BIT_START                               1U
#define MAR_232_WTE_BIT_END                                 1U

/* Definition for field PC in Register MAR_232 */
#define MAR_232_PC_BIT_START                                0U
#define MAR_232_PC_BIT_END                                  0U

/* Definition for field RESV_1 in Register MAR_233 */
#define MAR_233_RESV_1_BIT_START                            4U
#define MAR_233_RESV_1_BIT_END                              31U

/* Definition for field PFX in Register MAR_233 */
#define MAR_233_PFX_BIT_START                               3U
#define MAR_233_PFX_BIT_END                                 3U

/* Definition for field PCX in Register MAR_233 */
#define MAR_233_PCX_BIT_START                               2U
#define MAR_233_PCX_BIT_END                                 2U

/* Definition for field WTE in Register MAR_233 */
#define MAR_233_WTE_BIT_START                               1U
#define MAR_233_WTE_BIT_END                                 1U

/* Definition for field PC in Register MAR_233 */
#define MAR_233_PC_BIT_START                                0U
#define MAR_233_PC_BIT_END                                  0U

/* Definition for field RESV_1 in Register MAR_234 */
#define MAR_234_RESV_1_BIT_START                            4U
#define MAR_234_RESV_1_BIT_END                              31U

/* Definition for field PFX in Register MAR_234 */
#define MAR_234_PFX_BIT_START                               3U
#define MAR_234_PFX_BIT_END                                 3U

/* Definition for field PCX in Register MAR_234 */
#define MAR_234_PCX_BIT_START                               2U
#define MAR_234_PCX_BIT_END                                 2U

/* Definition for field WTE in Register MAR_234 */
#define MAR_234_WTE_BIT_START                               1U
#define MAR_234_WTE_BIT_END                                 1U

/* Definition for field PC in Register MAR_234 */
#define MAR_234_PC_BIT_START                                0U
#define MAR_234_PC_BIT_END                                  0U

/* Definition for field RESV_1 in Register MAR_235 */
#define MAR_235_RESV_1_BIT_START                            4U
#define MAR_235_RESV_1_BIT_END                              31U

/* Definition for field PFX in Register MAR_235 */
#define MAR_235_PFX_BIT_START                               3U
#define MAR_235_PFX_BIT_END                                 3U

/* Definition for field PCX in Register MAR_235 */
#define MAR_235_PCX_BIT_START                               2U
#define MAR_235_PCX_BIT_END                                 2U

/* Definition for field WTE in Register MAR_235 */
#define MAR_235_WTE_BIT_START                               1U
#define MAR_235_WTE_BIT_END                                 1U

/* Definition for field PC in Register MAR_235 */
#define MAR_235_PC_BIT_START                                0U
#define MAR_235_PC_BIT_END                                  0U

/* Definition for field RESV_1 in Register MAR_236 */
#define MAR_236_RESV_1_BIT_START                            4U
#define MAR_236_RESV_1_BIT_END                              31U

/* Definition for field PFX in Register MAR_236 */
#define MAR_236_PFX_BIT_START                               3U
#define MAR_236_PFX_BIT_END                                 3U

/* Definition for field PCX in Register MAR_236 */
#define MAR_236_PCX_BIT_START                               2U
#define MAR_236_PCX_BIT_END                                 2U

