0xastro/fmcw-RADAR/mmwave_sdk/packages/ti/drivers/soc/include/reg_dspicfg.h
/* Definition for field WTE in Register MAR_236 */
#define MAR_236_WTE_BIT_START                               1U
#define MAR_236_WTE_BIT_END                                 1U

/* Definition for field PC in Register MAR_236 */
#define MAR_236_PC_BIT_START                                0U
#define MAR_236_PC_BIT_END                                  0U

/* Definition for field RESV_1 in Register MAR_237 */
#define MAR_237_RESV_1_BIT_START                            4U
#define MAR_237_RESV_1_BIT_END                              31U

/* Definition for field PFX in Register MAR_237 */
#define MAR_237_PFX_BIT_START                               3U
#define MAR_237_PFX_BIT_END                                 3U

/* Definition for field PCX in Register MAR_237 */
#define MAR_237_PCX_BIT_START                               2U
#define MAR_237_PCX_BIT_END                                 2U

/* Definition for field WTE in Register MAR_237 */
#define MAR_237_WTE_BIT_START                               1U
#define MAR_237_WTE_BIT_END                                 1U

/* Definition for field PC in Register MAR_237 */
#define MAR_237_PC_BIT_START                                0U
#define MAR_237_PC_BIT_END                                  0U

/* Definition for field RESV_1 in Register MAR_238 */
#define MAR_238_RESV_1_BIT_START                            4U
#define MAR_238_RESV_1_BIT_END                              31U

/* Definition for field PFX in Register MAR_238 */
#define MAR_238_PFX_BIT_START                               3U
#define MAR_238_PFX_BIT_END                                 3U

/* Definition for field PCX in Register MAR_238 */
#define MAR_238_PCX_BIT_START                               2U
#define MAR_238_PCX_BIT_END                                 2U

/* Definition for field WTE in Register MAR_238 */
#define MAR_238_WTE_BIT_START                               1U
#define MAR_238_WTE_BIT_END                                 1U

/* Definition for field PC in Register MAR_238 */
#define MAR_238_PC_BIT_START                                0U
#define MAR_238_PC_BIT_END                                  0U

/* Definition for field RESV_1 in Register MAR_239 */
#define MAR_239_RESV_1_BIT_START                            4U
#define MAR_239_RESV_1_BIT_END                              31U

/* Definition for field PFX in Register MAR_239 */
#define MAR_239_PFX_BIT_START                               3U
#define MAR_239_PFX_BIT_END                                 3U

/* Definition for field PCX in Register MAR_239 */
#define MAR_239_PCX_BIT_START                               2U
#define MAR_239_PCX_BIT_END                                 2U

/* Definition for field WTE in Register MAR_239 */
#define MAR_239_WTE_BIT_START                               1U
#define MAR_239_WTE_BIT_END                                 1U

/* Definition for field PC in Register MAR_239 */
#define MAR_239_PC_BIT_START                                0U
#define MAR_239_PC_BIT_END                                  0U

/* Definition for field RESV_1 in Register MAR_240 */
#define MAR_240_RESV_1_BIT_START                            4U
#define MAR_240_RESV_1_BIT_END                              31U

/* Definition for field PFX in Register MAR_240 */
#define MAR_240_PFX_BIT_START                               3U
#define MAR_240_PFX_BIT_END                                 3U

/* Definition for field PCX in Register MAR_240 */
#define MAR_240_PCX_BIT_START                               2U
#define MAR_240_PCX_BIT_END                                 2U

/* Definition for field WTE in Register MAR_240 */
#define MAR_240_WTE_BIT_START                               1U
#define MAR_240_WTE_BIT_END                                 1U

/* Definition for field PC in Register MAR_240 */
#define MAR_240_PC_BIT_START                                0U
#define MAR_240_PC_BIT_END                                  0U

/* Definition for field RESV_1 in Register MAR_241 */
#define MAR_241_RESV_1_BIT_START                            4U
#define MAR_241_RESV_1_BIT_END                              31U

/* Definition for field PFX in Register MAR_241 */
#define MAR_241_PFX_BIT_START                               3U
#define MAR_241_PFX_BIT_END                                 3U

/* Definition for field PCX in Register MAR_241 */
#define MAR_241_PCX_BIT_START                               2U
#define MAR_241_PCX_BIT_END                                 2U

/* Definition for field WTE in Register MAR_241 */
#define MAR_241_WTE_BIT_START                               1U
#define MAR_241_WTE_BIT_END                                 1U

/* Definition for field PC in Register MAR_241 */
#define MAR_241_PC_BIT_START                                0U
#define MAR_241_PC_BIT_END                                  0U

/* Definition for field RESV_1 in Register MAR_242 */
#define MAR_242_RESV_1_BIT_START                            4U
#define MAR_242_RESV_1_BIT_END                              31U

/* Definition for field PFX in Register MAR_242 */
#define MAR_242_PFX_BIT_START                               3U
#define MAR_242_PFX_BIT_END                                 3U

/* Definition for field PCX in Register MAR_242 */
#define MAR_242_PCX_BIT_START                               2U
#define MAR_242_PCX_BIT_END                                 2U

/* Definition for field WTE in Register MAR_242 */
#define MAR_242_WTE_BIT_START                               1U
#define MAR_242_WTE_BIT_END                                 1U

/* Definition for field PC in Register MAR_242 */
#define MAR_242_PC_BIT_START                                0U
#define MAR_242_PC_BIT_END                                  0U

/* Definition for field RESV_1 in Register MAR_243 */
#define MAR_243_RESV_1_BIT_START                            4U
#define MAR_243_RESV_1_BIT_END                              31U

/* Definition for field PFX in Register MAR_243 */
#define MAR_243_PFX_BIT_START                               3U
#define MAR_243_PFX_BIT_END                                 3U

/* Definition for field PCX in Register MAR_243 */
#define MAR_243_PCX_BIT_START                               2U
#define MAR_243_PCX_BIT_END                                 2U

/* Definition for field WTE in Register MAR_243 */
#define MAR_243_WTE_BIT_START                               1U
#define MAR_243_WTE_BIT_END                                 1U

/* Definition for field PC in Register MAR_243 */
#define MAR_243_PC_BIT_START                                0U
#define MAR_243_PC_BIT_END                                  0U

/* Definition for field RESV_1 in Register MAR_244 */
#define MAR_244_RESV_1_BIT_START                            4U
#define MAR_244_RESV_1_BIT_END                              31U

/* Definition for field PFX in Register MAR_244 */
#define MAR_244_PFX_BIT_START                               3U
#define MAR_244_PFX_BIT_END                                 3U

