0xastro/fmcw-RADAR/mmwave_sdk/packages/ti/drivers/soc/include/reg_dspicfg.h
/* Definition for field PCX in Register MAR_244 */
#define MAR_244_PCX_BIT_START                               2U
#define MAR_244_PCX_BIT_END                                 2U

/* Definition for field WTE in Register MAR_244 */
#define MAR_244_WTE_BIT_START                               1U
#define MAR_244_WTE_BIT_END                                 1U

/* Definition for field PC in Register MAR_244 */
#define MAR_244_PC_BIT_START                                0U
#define MAR_244_PC_BIT_END                                  0U

/* Definition for field RESV_1 in Register MAR_245 */
#define MAR_245_RESV_1_BIT_START                            4U
#define MAR_245_RESV_1_BIT_END                              31U

/* Definition for field PFX in Register MAR_245 */
#define MAR_245_PFX_BIT_START                               3U
#define MAR_245_PFX_BIT_END                                 3U

/* Definition for field PCX in Register MAR_245 */
#define MAR_245_PCX_BIT_START                               2U
#define MAR_245_PCX_BIT_END                                 2U

/* Definition for field WTE in Register MAR_245 */
#define MAR_245_WTE_BIT_START                               1U
#define MAR_245_WTE_BIT_END                                 1U

/* Definition for field PC in Register MAR_245 */
#define MAR_245_PC_BIT_START                                0U
#define MAR_245_PC_BIT_END                                  0U

/* Definition for field RESV_1 in Register MAR_246 */
#define MAR_246_RESV_1_BIT_START                            4U
#define MAR_246_RESV_1_BIT_END                              31U

/* Definition for field PFX in Register MAR_246 */
#define MAR_246_PFX_BIT_START                               3U
#define MAR_246_PFX_BIT_END                                 3U

/* Definition for field PCX in Register MAR_246 */
#define MAR_246_PCX_BIT_START                               2U
#define MAR_246_PCX_BIT_END                                 2U

/* Definition for field WTE in Register MAR_246 */
#define MAR_246_WTE_BIT_START                               1U
#define MAR_246_WTE_BIT_END                                 1U

/* Definition for field PC in Register MAR_246 */
#define MAR_246_PC_BIT_START                                0U
#define MAR_246_PC_BIT_END                                  0U

/* Definition for field RESV_1 in Register MAR_247 */
#define MAR_247_RESV_1_BIT_START                            4U
#define MAR_247_RESV_1_BIT_END                              31U

/* Definition for field PFX in Register MAR_247 */
#define MAR_247_PFX_BIT_START                               3U
#define MAR_247_PFX_BIT_END                                 3U

/* Definition for field PCX in Register MAR_247 */
#define MAR_247_PCX_BIT_START                               2U
#define MAR_247_PCX_BIT_END                                 2U

/* Definition for field WTE in Register MAR_247 */
#define MAR_247_WTE_BIT_START                               1U
#define MAR_247_WTE_BIT_END                                 1U

/* Definition for field PC in Register MAR_247 */
#define MAR_247_PC_BIT_START                                0U
#define MAR_247_PC_BIT_END                                  0U

/* Definition for field RESV_1 in Register MAR_248 */
#define MAR_248_RESV_1_BIT_START                            4U
#define MAR_248_RESV_1_BIT_END                              31U

/* Definition for field PFX in Register MAR_248 */
#define MAR_248_PFX_BIT_START                               3U
#define MAR_248_PFX_BIT_END                                 3U

/* Definition for field PCX in Register MAR_248 */
#define MAR_248_PCX_BIT_START                               2U
#define MAR_248_PCX_BIT_END                                 2U

/* Definition for field WTE in Register MAR_248 */
#define MAR_248_WTE_BIT_START                               1U
#define MAR_248_WTE_BIT_END                                 1U

/* Definition for field PC in Register MAR_248 */
#define MAR_248_PC_BIT_START                                0U
#define MAR_248_PC_BIT_END                                  0U

/* Definition for field RESV_1 in Register MAR_249 */
#define MAR_249_RESV_1_BIT_START                            4U
#define MAR_249_RESV_1_BIT_END                              31U

/* Definition for field PFX in Register MAR_249 */
#define MAR_249_PFX_BIT_START                               3U
#define MAR_249_PFX_BIT_END                                 3U

/* Definition for field PCX in Register MAR_249 */
#define MAR_249_PCX_BIT_START                               2U
#define MAR_249_PCX_BIT_END                                 2U

/* Definition for field WTE in Register MAR_249 */
#define MAR_249_WTE_BIT_START                               1U
#define MAR_249_WTE_BIT_END                                 1U

/* Definition for field PC in Register MAR_249 */
#define MAR_249_PC_BIT_START                                0U
#define MAR_249_PC_BIT_END                                  0U

/* Definition for field RESV_1 in Register MAR_250 */
#define MAR_250_RESV_1_BIT_START                            4U
#define MAR_250_RESV_1_BIT_END                              31U

/* Definition for field PFX in Register MAR_250 */
#define MAR_250_PFX_BIT_START                               3U
#define MAR_250_PFX_BIT_END                                 3U

/* Definition for field PCX in Register MAR_250 */
#define MAR_250_PCX_BIT_START                               2U
#define MAR_250_PCX_BIT_END                                 2U

/* Definition for field WTE in Register MAR_250 */
#define MAR_250_WTE_BIT_START                               1U
#define MAR_250_WTE_BIT_END                                 1U

/* Definition for field PC in Register MAR_250 */
#define MAR_250_PC_BIT_START                                0U
#define MAR_250_PC_BIT_END                                  0U

/* Definition for field RESV_1 in Register MAR_251 */
#define MAR_251_RESV_1_BIT_START                            4U
#define MAR_251_RESV_1_BIT_END                              31U

/* Definition for field PFX in Register MAR_251 */
#define MAR_251_PFX_BIT_START                               3U
#define MAR_251_PFX_BIT_END                                 3U

/* Definition for field PCX in Register MAR_251 */
#define MAR_251_PCX_BIT_START                               2U
#define MAR_251_PCX_BIT_END                                 2U

/* Definition for field WTE in Register MAR_251 */
#define MAR_251_WTE_BIT_START                               1U
#define MAR_251_WTE_BIT_END                                 1U

