0xastro/fmcw-RADAR/mmwave_sdk/packages/ti/drivers/soc/include/reg_dspicfg.h
/* Definition for field PC in Register MAR_251 */
#define MAR_251_PC_BIT_START                                0U
#define MAR_251_PC_BIT_END                                  0U

/* Definition for field RESV_1 in Register MAR_252 */
#define MAR_252_RESV_1_BIT_START                            4U
#define MAR_252_RESV_1_BIT_END                              31U

/* Definition for field PFX in Register MAR_252 */
#define MAR_252_PFX_BIT_START                               3U
#define MAR_252_PFX_BIT_END                                 3U

/* Definition for field PCX in Register MAR_252 */
#define MAR_252_PCX_BIT_START                               2U
#define MAR_252_PCX_BIT_END                                 2U

/* Definition for field WTE in Register MAR_252 */
#define MAR_252_WTE_BIT_START                               1U
#define MAR_252_WTE_BIT_END                                 1U

/* Definition for field PC in Register MAR_252 */
#define MAR_252_PC_BIT_START                                0U
#define MAR_252_PC_BIT_END                                  0U

/* Definition for field RESV_1 in Register MAR_253 */
#define MAR_253_RESV_1_BIT_START                            4U
#define MAR_253_RESV_1_BIT_END                              31U

/* Definition for field PFX in Register MAR_253 */
#define MAR_253_PFX_BIT_START                               3U
#define MAR_253_PFX_BIT_END                                 3U

/* Definition for field PCX in Register MAR_253 */
#define MAR_253_PCX_BIT_START                               2U
#define MAR_253_PCX_BIT_END                                 2U

/* Definition for field WTE in Register MAR_253 */
#define MAR_253_WTE_BIT_START                               1U
#define MAR_253_WTE_BIT_END                                 1U

/* Definition for field PC in Register MAR_253 */
#define MAR_253_PC_BIT_START                                0U
#define MAR_253_PC_BIT_END                                  0U

/* Definition for field RESV_1 in Register MAR_254 */
#define MAR_254_RESV_1_BIT_START                            4U
#define MAR_254_RESV_1_BIT_END                              31U

/* Definition for field PFX in Register MAR_254 */
#define MAR_254_PFX_BIT_START                               3U
#define MAR_254_PFX_BIT_END                                 3U

/* Definition for field PCX in Register MAR_254 */
#define MAR_254_PCX_BIT_START                               2U
#define MAR_254_PCX_BIT_END                                 2U

/* Definition for field WTE in Register MAR_254 */
#define MAR_254_WTE_BIT_START                               1U
#define MAR_254_WTE_BIT_END                                 1U

/* Definition for field PC in Register MAR_254 */
#define MAR_254_PC_BIT_START                                0U
#define MAR_254_PC_BIT_END                                  0U

/* Definition for field RESV_1 in Register MAR_255 */
#define MAR_255_RESV_1_BIT_START                            4U
#define MAR_255_RESV_1_BIT_END                              31U

/* Definition for field PFX in Register MAR_255 */
#define MAR_255_PFX_BIT_START                               3U
#define MAR_255_PFX_BIT_END                                 3U

/* Definition for field PCX in Register MAR_255 */
#define MAR_255_PCX_BIT_START                               2U
#define MAR_255_PCX_BIT_END                                 2U
/* Definition for field WTE in Register MAR_255 */
#define MAR_255_WTE_BIT_START                               1U
#define MAR_255_WTE_BIT_END                                 1U

/* Definition for field PC in Register MAR_255 */
#define MAR_255_PC_BIT_START                                0U
#define MAR_255_PC_BIT_END                                  0U

#else 
/* Definition for field RESV_1 in Register MAR_255 */
#define MAR_RESV_1_BIT_START                                4U
#define MAR_RESV_1_BIT_END                                  31U

/* Definition for field PFX in Register MAR_255 */
#define MAR_PFX_BIT_START                                   3U
#define MAR_PFX_BIT_END                                     3U

/* Definition for field PCX in Register MAR_255 */
#define MAR_PCX_BIT_START                                   2U
#define MAR_PCX_BIT_END                                     2U

/* Definition for field WTE in Register MAR_255 */
#define MAR_WTE_BIT_START                                   1U
#define MAR_WTE_BIT_END                                     1U

/* Definition for field PC in Register MAR_255 */
#define MAR_PC_BIT_START                                    0U
#define MAR_PC_BIT_END                                      0U
#endif

/* Definition for field ADDR in Register L2MPFAR */
#define L2MPFAR_ADDR_BIT_START                              0U
#define L2MPFAR_ADDR_BIT_END                                31U

/* Definition for field RESV_1 in Register L2MPFSR */
#define L2MPFSR_RESV_1_BIT_START                            16U
#define L2MPFSR_RESV_1_BIT_END                              31U

/* Definition for field FID in Register L2MPFSR */
#define L2MPFSR_FID_BIT_START                               9U
#define L2MPFSR_FID_BIT_END                                 15U

/* Definition for field LOCAL in Register L2MPFSR */
#define L2MPFSR_LOCAL_BIT_START                             8U
#define L2MPFSR_LOCAL_BIT_END                               8U

/* Definition for field NS in Register L2MPFSR */
#define L2MPFSR_NS_BIT_START                                7U
#define L2MPFSR_NS_BIT_END                                  7U

/* Definition for field RESV_2 in Register L2MPFSR */
#define L2MPFSR_RESV_2_BIT_START                            6U
#define L2MPFSR_RESV_2_BIT_END                              6U

/* Definition for field SR in Register L2MPFSR */
#define L2MPFSR_SR_BIT_START                                5U
#define L2MPFSR_SR_BIT_END                                  5U

/* Definition for field SW in Register L2MPFSR */
#define L2MPFSR_SW_BIT_START                                4U
#define L2MPFSR_SW_BIT_END                                  4U

/* Definition for field SX in Register L2MPFSR */
#define L2MPFSR_SX_BIT_START                                3U
#define L2MPFSR_SX_BIT_END                                  3U

