0xastro/fmcw-RADAR/mmwave_sdk/packages/ti/drivers/soc/include/reg_dspicfg.h
/* Definition for field UR in Register L2MPPA6 */
#define L2MPPA6_UR_BIT_START                                2U
#define L2MPPA6_UR_BIT_END                                  2U

/* Definition for field UW in Register L2MPPA6 */
#define L2MPPA6_UW_BIT_START                                1U
#define L2MPPA6_UW_BIT_END                                  1U

/* Definition for field UX in Register L2MPPA6 */
#define L2MPPA6_UX_BIT_START                                0U
#define L2MPPA6_UX_BIT_END                                  0U

/* Definition for field RESV_1 in Register L2MPPA7 */
#define L2MPPA7_RESV_1_BIT_START                            16U
#define L2MPPA7_RESV_1_BIT_END                              31U

/* Definition for field AID5 in Register L2MPPA7 */
#define L2MPPA7_AID5_BIT_START                              15U
#define L2MPPA7_AID5_BIT_END                                15U

/* Definition for field AID4 in Register L2MPPA7 */
#define L2MPPA7_AID4_BIT_START                              14U
#define L2MPPA7_AID4_BIT_END                                14U

/* Definition for field AID3 in Register L2MPPA7 */
#define L2MPPA7_AID3_BIT_START                              13U
#define L2MPPA7_AID3_BIT_END                                13U

/* Definition for field AID2 in Register L2MPPA7 */
#define L2MPPA7_AID2_BIT_START                              12U
#define L2MPPA7_AID2_BIT_END                                12U

/* Definition for field AID1 in Register L2MPPA7 */
#define L2MPPA7_AID1_BIT_START                              11U
#define L2MPPA7_AID1_BIT_END                                11U

/* Definition for field AID0 in Register L2MPPA7 */
#define L2MPPA7_AID0_BIT_START                              10U
#define L2MPPA7_AID0_BIT_END                                10U

/* Definition for field AIDX in Register L2MPPA7 */
#define L2MPPA7_AIDX_BIT_START                              9U
#define L2MPPA7_AIDX_BIT_END                                9U

/* Definition for field LOCAL in Register L2MPPA7 */
#define L2MPPA7_LOCAL_BIT_START                             8U
#define L2MPPA7_LOCAL_BIT_END                               8U

/* Definition for field NS in Register L2MPPA7 */
#define L2MPPA7_NS_BIT_START                                7U
#define L2MPPA7_NS_BIT_END                                  7U

/* Definition for field EMU in Register L2MPPA7 */
#define L2MPPA7_EMU_BIT_START                               6U
#define L2MPPA7_EMU_BIT_END                                 6U

/* Definition for field SR in Register L2MPPA7 */
#define L2MPPA7_SR_BIT_START                                5U
#define L2MPPA7_SR_BIT_END                                  5U

/* Definition for field SW in Register L2MPPA7 */
#define L2MPPA7_SW_BIT_START                                4U
#define L2MPPA7_SW_BIT_END                                  4U

/* Definition for field SX in Register L2MPPA7 */
#define L2MPPA7_SX_BIT_START                                3U
#define L2MPPA7_SX_BIT_END                                  3U

/* Definition for field UR in Register L2MPPA7 */
#define L2MPPA7_UR_BIT_START                                2U
#define L2MPPA7_UR_BIT_END                                  2U

/* Definition for field UW in Register L2MPPA7 */
#define L2MPPA7_UW_BIT_START                                1U
#define L2MPPA7_UW_BIT_END                                  1U

/* Definition for field UX in Register L2MPPA7 */
#define L2MPPA7_UX_BIT_START                                0U
#define L2MPPA7_UX_BIT_END                                  0U

/* Definition for field RESV_1 in Register L2MPPA8 */
#define L2MPPA8_RESV_1_BIT_START                            16U
#define L2MPPA8_RESV_1_BIT_END                              31U

/* Definition for field AID5 in Register L2MPPA8 */
#define L2MPPA8_AID5_BIT_START                              15U
#define L2MPPA8_AID5_BIT_END                                15U

/* Definition for field AID4 in Register L2MPPA8 */
#define L2MPPA8_AID4_BIT_START                              14U
#define L2MPPA8_AID4_BIT_END                                14U

/* Definition for field AID3 in Register L2MPPA8 */
#define L2MPPA8_AID3_BIT_START                              13U
#define L2MPPA8_AID3_BIT_END                                13U

/* Definition for field AID2 in Register L2MPPA8 */
#define L2MPPA8_AID2_BIT_START                              12U
#define L2MPPA8_AID2_BIT_END                                12U

/* Definition for field AID1 in Register L2MPPA8 */
#define L2MPPA8_AID1_BIT_START                              11U
#define L2MPPA8_AID1_BIT_END                                11U

/* Definition for field AID0 in Register L2MPPA8 */
#define L2MPPA8_AID0_BIT_START                              10U
#define L2MPPA8_AID0_BIT_END                                10U

/* Definition for field AIDX in Register L2MPPA8 */
#define L2MPPA8_AIDX_BIT_START                              9U
#define L2MPPA8_AIDX_BIT_END                                9U

/* Definition for field LOCAL in Register L2MPPA8 */
#define L2MPPA8_LOCAL_BIT_START                             8U
#define L2MPPA8_LOCAL_BIT_END                               8U

/* Definition for field NS in Register L2MPPA8 */
#define L2MPPA8_NS_BIT_START                                7U
#define L2MPPA8_NS_BIT_END                                  7U

/* Definition for field EMU in Register L2MPPA8 */
#define L2MPPA8_EMU_BIT_START                               6U
#define L2MPPA8_EMU_BIT_END                                 6U

/* Definition for field SR in Register L2MPPA8 */
#define L2MPPA8_SR_BIT_START                                5U
#define L2MPPA8_SR_BIT_END                                  5U

/* Definition for field SW in Register L2MPPA8 */
#define L2MPPA8_SW_BIT_START                                4U
#define L2MPPA8_SW_BIT_END                                  4U

/* Definition for field SX in Register L2MPPA8 */
#define L2MPPA8_SX_BIT_START                                3U
#define L2MPPA8_SX_BIT_END                                  3U

/* Definition for field UR in Register L2MPPA8 */
#define L2MPPA8_UR_BIT_START                                2U
#define L2MPPA8_UR_BIT_END                                  2U

/* Definition for field UW in Register L2MPPA8 */
#define L2MPPA8_UW_BIT_START                                1U
#define L2MPPA8_UW_BIT_END                                  1U

/* Definition for field UX in Register L2MPPA8 */
#define L2MPPA8_UX_BIT_START                                0U
#define L2MPPA8_UX_BIT_END                                  0U

/* Definition for field RESV_1 in Register L2MPPA9 */
#define L2MPPA9_RESV_1_BIT_START                            16U
#define L2MPPA9_RESV_1_BIT_END                              31U

/* Definition for field AID5 in Register L2MPPA9 */
#define L2MPPA9_AID5_BIT_START                              15U
#define L2MPPA9_AID5_BIT_END                                15U

