0xastro/fmcw-RADAR/mmwave_sdk/packages/ti/drivers/soc/include/reg_dspicfg.h
/* Definition for field UX in Register L2MPPA17 */
#define L2MPPA17_UX_BIT_START                               0U
#define L2MPPA17_UX_BIT_END                                 0U

/* Definition for field RESV_1 in Register L2MPPA18 */
#define L2MPPA18_RESV_1_BIT_START                           16U
#define L2MPPA18_RESV_1_BIT_END                             31U

/* Definition for field AID5 in Register L2MPPA18 */
#define L2MPPA18_AID5_BIT_START                             15U
#define L2MPPA18_AID5_BIT_END                               15U

/* Definition for field AID4 in Register L2MPPA18 */
#define L2MPPA18_AID4_BIT_START                             14U
#define L2MPPA18_AID4_BIT_END                               14U

/* Definition for field AID3 in Register L2MPPA18 */
#define L2MPPA18_AID3_BIT_START                             13U
#define L2MPPA18_AID3_BIT_END                               13U

/* Definition for field AID2 in Register L2MPPA18 */
#define L2MPPA18_AID2_BIT_START                             12U
#define L2MPPA18_AID2_BIT_END                               12U

/* Definition for field AID1 in Register L2MPPA18 */
#define L2MPPA18_AID1_BIT_START                             11U
#define L2MPPA18_AID1_BIT_END                               11U

/* Definition for field AID0 in Register L2MPPA18 */
#define L2MPPA18_AID0_BIT_START                             10U
#define L2MPPA18_AID0_BIT_END                               10U

/* Definition for field AIDX in Register L2MPPA18 */
#define L2MPPA18_AIDX_BIT_START                             9U
#define L2MPPA18_AIDX_BIT_END                               9U

/* Definition for field LOCAL in Register L2MPPA18 */
#define L2MPPA18_LOCAL_BIT_START                            8U
#define L2MPPA18_LOCAL_BIT_END                              8U

/* Definition for field NS in Register L2MPPA18 */
#define L2MPPA18_NS_BIT_START                               7U
#define L2MPPA18_NS_BIT_END                                 7U

/* Definition for field EMU in Register L2MPPA18 */
#define L2MPPA18_EMU_BIT_START                              6U
#define L2MPPA18_EMU_BIT_END                                6U

/* Definition for field SR in Register L2MPPA18 */
#define L2MPPA18_SR_BIT_START                               5U
#define L2MPPA18_SR_BIT_END                                 5U

/* Definition for field SW in Register L2MPPA18 */
#define L2MPPA18_SW_BIT_START                               4U
#define L2MPPA18_SW_BIT_END                                 4U

/* Definition for field SX in Register L2MPPA18 */
#define L2MPPA18_SX_BIT_START                               3U
#define L2MPPA18_SX_BIT_END                                 3U

/* Definition for field UR in Register L2MPPA18 */
#define L2MPPA18_UR_BIT_START                               2U
#define L2MPPA18_UR_BIT_END                                 2U

/* Definition for field UW in Register L2MPPA18 */
#define L2MPPA18_UW_BIT_START                               1U
#define L2MPPA18_UW_BIT_END                                 1U

/* Definition for field UX in Register L2MPPA18 */
#define L2MPPA18_UX_BIT_START                               0U
#define L2MPPA18_UX_BIT_END                                 0U

/* Definition for field RESV_1 in Register L2MPPA19 */
#define L2MPPA19_RESV_1_BIT_START                           16U
#define L2MPPA19_RESV_1_BIT_END                             31U

/* Definition for field AID5 in Register L2MPPA19 */
#define L2MPPA19_AID5_BIT_START                             15U
#define L2MPPA19_AID5_BIT_END                               15U

/* Definition for field AID4 in Register L2MPPA19 */
#define L2MPPA19_AID4_BIT_START                             14U
#define L2MPPA19_AID4_BIT_END                               14U

/* Definition for field AID3 in Register L2MPPA19 */
#define L2MPPA19_AID3_BIT_START                             13U
#define L2MPPA19_AID3_BIT_END                               13U

/* Definition for field AID2 in Register L2MPPA19 */
#define L2MPPA19_AID2_BIT_START                             12U
#define L2MPPA19_AID2_BIT_END                               12U

/* Definition for field AID1 in Register L2MPPA19 */
#define L2MPPA19_AID1_BIT_START                             11U
#define L2MPPA19_AID1_BIT_END                               11U

/* Definition for field AID0 in Register L2MPPA19 */
#define L2MPPA19_AID0_BIT_START                             10U
#define L2MPPA19_AID0_BIT_END                               10U

/* Definition for field AIDX in Register L2MPPA19 */
#define L2MPPA19_AIDX_BIT_START                             9U
#define L2MPPA19_AIDX_BIT_END                               9U

/* Definition for field LOCAL in Register L2MPPA19 */
#define L2MPPA19_LOCAL_BIT_START                            8U
#define L2MPPA19_LOCAL_BIT_END                              8U

/* Definition for field NS in Register L2MPPA19 */
#define L2MPPA19_NS_BIT_START                               7U
#define L2MPPA19_NS_BIT_END                                 7U

/* Definition for field EMU in Register L2MPPA19 */
#define L2MPPA19_EMU_BIT_START                              6U
#define L2MPPA19_EMU_BIT_END                                6U

/* Definition for field SR in Register L2MPPA19 */
#define L2MPPA19_SR_BIT_START                               5U
#define L2MPPA19_SR_BIT_END                                 5U

/* Definition for field SW in Register L2MPPA19 */
#define L2MPPA19_SW_BIT_START                               4U
#define L2MPPA19_SW_BIT_END                                 4U

/* Definition for field SX in Register L2MPPA19 */
#define L2MPPA19_SX_BIT_START                               3U
#define L2MPPA19_SX_BIT_END                                 3U

/* Definition for field UR in Register L2MPPA19 */
#define L2MPPA19_UR_BIT_START                               2U
#define L2MPPA19_UR_BIT_END                                 2U

/* Definition for field UW in Register L2MPPA19 */
#define L2MPPA19_UW_BIT_START                               1U
#define L2MPPA19_UW_BIT_END                                 1U

/* Definition for field UX in Register L2MPPA19 */
#define L2MPPA19_UX_BIT_START                               0U
#define L2MPPA19_UX_BIT_END                                 0U

/* Definition for field RESV_1 in Register L2MPPA20 */
#define L2MPPA20_RESV_1_BIT_START                           16U
#define L2MPPA20_RESV_1_BIT_END                             31U

