0xastro/fmcw-RADAR/mmwave_sdk/packages/ti/drivers/soc/include/reg_dspicfg.h
/* Definition for field AID1 in Register L2MPPA22 */
#define L2MPPA22_AID1_BIT_START                             11U
#define L2MPPA22_AID1_BIT_END                               11U

/* Definition for field AID0 in Register L2MPPA22 */
#define L2MPPA22_AID0_BIT_START                             10U
#define L2MPPA22_AID0_BIT_END                               10U

/* Definition for field AIDX in Register L2MPPA22 */
#define L2MPPA22_AIDX_BIT_START                             9U
#define L2MPPA22_AIDX_BIT_END                               9U

/* Definition for field LOCAL in Register L2MPPA22 */
#define L2MPPA22_LOCAL_BIT_START                            8U
#define L2MPPA22_LOCAL_BIT_END                              8U

/* Definition for field NS in Register L2MPPA22 */
#define L2MPPA22_NS_BIT_START                               7U
#define L2MPPA22_NS_BIT_END                                 7U

/* Definition for field EMU in Register L2MPPA22 */
#define L2MPPA22_EMU_BIT_START                              6U
#define L2MPPA22_EMU_BIT_END                                6U

/* Definition for field SR in Register L2MPPA22 */
#define L2MPPA22_SR_BIT_START                               5U
#define L2MPPA22_SR_BIT_END                                 5U

/* Definition for field SW in Register L2MPPA22 */
#define L2MPPA22_SW_BIT_START                               4U
#define L2MPPA22_SW_BIT_END                                 4U

/* Definition for field SX in Register L2MPPA22 */
#define L2MPPA22_SX_BIT_START                               3U
#define L2MPPA22_SX_BIT_END                                 3U

/* Definition for field UR in Register L2MPPA22 */
#define L2MPPA22_UR_BIT_START                               2U
#define L2MPPA22_UR_BIT_END                                 2U

/* Definition for field UW in Register L2MPPA22 */
#define L2MPPA22_UW_BIT_START                               1U
#define L2MPPA22_UW_BIT_END                                 1U

/* Definition for field UX in Register L2MPPA22 */
#define L2MPPA22_UX_BIT_START                               0U
#define L2MPPA22_UX_BIT_END                                 0U

/* Definition for field RESV_1 in Register L2MPPA23 */
#define L2MPPA23_RESV_1_BIT_START                           16U
#define L2MPPA23_RESV_1_BIT_END                             31U

/* Definition for field AID5 in Register L2MPPA23 */
#define L2MPPA23_AID5_BIT_START                             15U
#define L2MPPA23_AID5_BIT_END                               15U

/* Definition for field AID4 in Register L2MPPA23 */
#define L2MPPA23_AID4_BIT_START                             14U
#define L2MPPA23_AID4_BIT_END                               14U

/* Definition for field AID3 in Register L2MPPA23 */
#define L2MPPA23_AID3_BIT_START                             13U
#define L2MPPA23_AID3_BIT_END                               13U

/* Definition for field AID2 in Register L2MPPA23 */
#define L2MPPA23_AID2_BIT_START                             12U
#define L2MPPA23_AID2_BIT_END                               12U

/* Definition for field AID1 in Register L2MPPA23 */
#define L2MPPA23_AID1_BIT_START                             11U
#define L2MPPA23_AID1_BIT_END                               11U

/* Definition for field AID0 in Register L2MPPA23 */
#define L2MPPA23_AID0_BIT_START                             10U
#define L2MPPA23_AID0_BIT_END                               10U

/* Definition for field AIDX in Register L2MPPA23 */
#define L2MPPA23_AIDX_BIT_START                             9U
#define L2MPPA23_AIDX_BIT_END                               9U

/* Definition for field LOCAL in Register L2MPPA23 */
#define L2MPPA23_LOCAL_BIT_START                            8U
#define L2MPPA23_LOCAL_BIT_END                              8U

/* Definition for field NS in Register L2MPPA23 */
#define L2MPPA23_NS_BIT_START                               7U
#define L2MPPA23_NS_BIT_END                                 7U

/* Definition for field EMU in Register L2MPPA23 */
#define L2MPPA23_EMU_BIT_START                              6U
#define L2MPPA23_EMU_BIT_END                                6U

/* Definition for field SR in Register L2MPPA23 */
#define L2MPPA23_SR_BIT_START                               5U
#define L2MPPA23_SR_BIT_END                                 5U

/* Definition for field SW in Register L2MPPA23 */
#define L2MPPA23_SW_BIT_START                               4U
#define L2MPPA23_SW_BIT_END                                 4U

/* Definition for field SX in Register L2MPPA23 */
#define L2MPPA23_SX_BIT_START                               3U
#define L2MPPA23_SX_BIT_END                                 3U

/* Definition for field UR in Register L2MPPA23 */
#define L2MPPA23_UR_BIT_START                               2U
#define L2MPPA23_UR_BIT_END                                 2U

/* Definition for field UW in Register L2MPPA23 */
#define L2MPPA23_UW_BIT_START                               1U
#define L2MPPA23_UW_BIT_END                                 1U

/* Definition for field UX in Register L2MPPA23 */
#define L2MPPA23_UX_BIT_START                               0U
#define L2MPPA23_UX_BIT_END                                 0U

/* Definition for field RESV_1 in Register L2MPPA24 */
#define L2MPPA24_RESV_1_BIT_START                           16U
#define L2MPPA24_RESV_1_BIT_END                             31U

/* Definition for field AID5 in Register L2MPPA24 */
#define L2MPPA24_AID5_BIT_START                             15U
#define L2MPPA24_AID5_BIT_END                               15U

/* Definition for field AID4 in Register L2MPPA24 */
#define L2MPPA24_AID4_BIT_START                             14U
#define L2MPPA24_AID4_BIT_END                               14U

/* Definition for field AID3 in Register L2MPPA24 */
#define L2MPPA24_AID3_BIT_START                             13U
#define L2MPPA24_AID3_BIT_END                               13U

/* Definition for field AID2 in Register L2MPPA24 */
#define L2MPPA24_AID2_BIT_START                             12U
#define L2MPPA24_AID2_BIT_END                               12U

