0xastro/fmcw-RADAR/mmwave_sdk/packages/ti/drivers/soc/include/reg_dspicfg.h
/* Definition for field AID5 in Register L1PMPPA31 */
#define L1PMPPA31_AID5_BIT_START                            15U
#define L1PMPPA31_AID5_BIT_END                              15U

/* Definition for field AID4 in Register L1PMPPA31 */
#define L1PMPPA31_AID4_BIT_START                            14U
#define L1PMPPA31_AID4_BIT_END                              14U

/* Definition for field AID3 in Register L1PMPPA31 */
#define L1PMPPA31_AID3_BIT_START                            13U
#define L1PMPPA31_AID3_BIT_END                              13U

/* Definition for field AID2 in Register L1PMPPA31 */
#define L1PMPPA31_AID2_BIT_START                            12U
#define L1PMPPA31_AID2_BIT_END                              12U

/* Definition for field AID1 in Register L1PMPPA31 */
#define L1PMPPA31_AID1_BIT_START                            11U
#define L1PMPPA31_AID1_BIT_END                              11U

/* Definition for field AID0 in Register L1PMPPA31 */
#define L1PMPPA31_AID0_BIT_START                            10U
#define L1PMPPA31_AID0_BIT_END                              10U

/* Definition for field AIDX in Register L1PMPPA31 */
#define L1PMPPA31_AIDX_BIT_START                            9U
#define L1PMPPA31_AIDX_BIT_END                              9U

/* Definition for field LOCAL in Register L1PMPPA31 */
#define L1PMPPA31_LOCAL_BIT_START                           8U
#define L1PMPPA31_LOCAL_BIT_END                             8U

/* Definition for field NS in Register L1PMPPA31 */
#define L1PMPPA31_NS_BIT_START                              7U
#define L1PMPPA31_NS_BIT_END                                7U

/* Definition for field EMU in Register L1PMPPA31 */
#define L1PMPPA31_EMU_BIT_START                             6U
#define L1PMPPA31_EMU_BIT_END                               6U

/* Definition for field SR in Register L1PMPPA31 */
#define L1PMPPA31_SR_BIT_START                              5U
#define L1PMPPA31_SR_BIT_END                                5U

/* Definition for field SW in Register L1PMPPA31 */
#define L1PMPPA31_SW_BIT_START                              4U
#define L1PMPPA31_SW_BIT_END                                4U

/* Definition for field SX in Register L1PMPPA31 */
#define L1PMPPA31_SX_BIT_START                              3U
#define L1PMPPA31_SX_BIT_END                                3U

/* Definition for field UR in Register L1PMPPA31 */
#define L1PMPPA31_UR_BIT_START                              2U
#define L1PMPPA31_UR_BIT_END                                2U

/* Definition for field UW in Register L1PMPPA31 */
#define L1PMPPA31_UW_BIT_START                              1U
#define L1PMPPA31_UW_BIT_END                                1U

/* Definition for field UX in Register L1PMPPA31 */
#define L1PMPPA31_UX_BIT_START                              0U
#define L1PMPPA31_UX_BIT_END                                0U

/* Definition for field ADDR in Register L1DMPFAR */
#define L1DMPFAR_ADDR_BIT_START                             0U
#define L1DMPFAR_ADDR_BIT_END                               31U

/* Definition for field RESV_1 in Register L1DMPFSR */
#define L1DMPFSR_RESV_1_BIT_START                           16U
#define L1DMPFSR_RESV_1_BIT_END                             31U

/* Definition for field FID in Register L1DMPFSR */
#define L1DMPFSR_FID_BIT_START                              9U
#define L1DMPFSR_FID_BIT_END                                15U

/* Definition for field LOCAL in Register L1DMPFSR */
#define L1DMPFSR_LOCAL_BIT_START                            8U
#define L1DMPFSR_LOCAL_BIT_END                              8U

/* Definition for field NS in Register L1DMPFSR */
#define L1DMPFSR_NS_BIT_START                               7U
#define L1DMPFSR_NS_BIT_END                                 7U

/* Definition for field RESV_2 in Register L1DMPFSR */
#define L1DMPFSR_RESV_2_BIT_START                           6U
#define L1DMPFSR_RESV_2_BIT_END                             6U

/* Definition for field SR in Register L1DMPFSR */
#define L1DMPFSR_SR_BIT_START                               5U
#define L1DMPFSR_SR_BIT_END                                 5U

/* Definition for field SW in Register L1DMPFSR */
#define L1DMPFSR_SW_BIT_START                               4U
#define L1DMPFSR_SW_BIT_END                                 4U

/* Definition for field SX in Register L1DMPFSR */
#define L1DMPFSR_SX_BIT_START                               3U
#define L1DMPFSR_SX_BIT_END                                 3U

/* Definition for field UR in Register L1DMPFSR */
#define L1DMPFSR_UR_BIT_START                               2U
#define L1DMPFSR_UR_BIT_END                                 2U

/* Definition for field UW in Register L1DMPFSR */
#define L1DMPFSR_UW_BIT_START                               1U
#define L1DMPFSR_UW_BIT_END                                 1U

/* Definition for field UX in Register L1DMPFSR */
#define L1DMPFSR_UX_BIT_START                               0U
#define L1DMPFSR_UX_BIT_END                                 0U

/* Definition for field RESV_1 in Register L1DMPFCR */
#define L1DMPFCR_RESV_1_BIT_START                           1U
#define L1DMPFCR_RESV_1_BIT_END                             31U

/* Definition for field MPFCLR in Register L1DMPFCR */
#define L1DMPFCR_MPFCLR_BIT_START                           0U
#define L1DMPFCR_MPFCLR_BIT_END                             0U

/* Definition for field MPLK in Register MPLK0 */
#define MPLK0_MPLK_BIT_START                                0U
#define MPLK0_MPLK_BIT_END                                  31U

/* Definition for field MPLK in Register MPLK1 */
#define MPLK1_MPLK_BIT_START                                0U
#define MPLK1_MPLK_BIT_END                                  31U

/* Definition for field MPLK in Register MPLK2 */
#define MPLK2_MPLK_BIT_START                                0U
#define MPLK2_MPLK_BIT_END                                  31U

/* Definition for field MPLK in Register MPLK3 */
#define MPLK3_MPLK_BIT_START                                0U
#define MPLK3_MPLK_BIT_END                                  31U

/* Definition for field RESV_1 in Register MPLKCMD */
#define MPLKCMD_RESV_1_BIT_START                            3U
#define MPLKCMD_RESV_1_BIT_END                              31U

/* Definition for field KEYR in Register MPLKCMD */
#define MPLKCMD_KEYR_BIT_START                              2U
#define MPLKCMD_KEYR_BIT_END                                2U

/* Definition for field LOCK in Register MPLKCMD */
#define MPLKCMD_LOCK_BIT_START                              1U
#define MPLKCMD_LOCK_BIT_END                                1U

