0xastro/fmcw-RADAR/mmwave_sdk/packages/ti/drivers/soc/include/reg_dspicfg.h
/* Definition for field SR in Register L1DMPPA26 */
#define L1DMPPA26_SR_BIT_START                              5U
#define L1DMPPA26_SR_BIT_END                                5U

/* Definition for field SW in Register L1DMPPA26 */
#define L1DMPPA26_SW_BIT_START                              4U
#define L1DMPPA26_SW_BIT_END                                4U

/* Definition for field SX in Register L1DMPPA26 */
#define L1DMPPA26_SX_BIT_START                              3U
#define L1DMPPA26_SX_BIT_END                                3U

/* Definition for field UR in Register L1DMPPA26 */
#define L1DMPPA26_UR_BIT_START                              2U
#define L1DMPPA26_UR_BIT_END                                2U

/* Definition for field UW in Register L1DMPPA26 */
#define L1DMPPA26_UW_BIT_START                              1U
#define L1DMPPA26_UW_BIT_END                                1U

/* Definition for field UX in Register L1DMPPA26 */
#define L1DMPPA26_UX_BIT_START                              0U
#define L1DMPPA26_UX_BIT_END                                0U

/* Definition for field RESV_1 in Register L1DMPPA27 */
#define L1DMPPA27_RESV_1_BIT_START                          16U
#define L1DMPPA27_RESV_1_BIT_END                            31U

/* Definition for field AID5 in Register L1DMPPA27 */
#define L1DMPPA27_AID5_BIT_START                            15U
#define L1DMPPA27_AID5_BIT_END                              15U

/* Definition for field AID4 in Register L1DMPPA27 */
#define L1DMPPA27_AID4_BIT_START                            14U
#define L1DMPPA27_AID4_BIT_END                              14U

/* Definition for field AID3 in Register L1DMPPA27 */
#define L1DMPPA27_AID3_BIT_START                            13U
#define L1DMPPA27_AID3_BIT_END                              13U

/* Definition for field AID2 in Register L1DMPPA27 */
#define L1DMPPA27_AID2_BIT_START                            12U
#define L1DMPPA27_AID2_BIT_END                              12U

/* Definition for field AID1 in Register L1DMPPA27 */
#define L1DMPPA27_AID1_BIT_START                            11U
#define L1DMPPA27_AID1_BIT_END                              11U

/* Definition for field AID0 in Register L1DMPPA27 */
#define L1DMPPA27_AID0_BIT_START                            10U
#define L1DMPPA27_AID0_BIT_END                              10U

/* Definition for field AIDX in Register L1DMPPA27 */
#define L1DMPPA27_AIDX_BIT_START                            9U
#define L1DMPPA27_AIDX_BIT_END                              9U

/* Definition for field LOCAL in Register L1DMPPA27 */
#define L1DMPPA27_LOCAL_BIT_START                           8U
#define L1DMPPA27_LOCAL_BIT_END                             8U

/* Definition for field NS in Register L1DMPPA27 */
#define L1DMPPA27_NS_BIT_START                              7U
#define L1DMPPA27_NS_BIT_END                                7U

/* Definition for field EMU in Register L1DMPPA27 */
#define L1DMPPA27_EMU_BIT_START                             6U
#define L1DMPPA27_EMU_BIT_END                               6U

/* Definition for field SR in Register L1DMPPA27 */
#define L1DMPPA27_SR_BIT_START                              5U
#define L1DMPPA27_SR_BIT_END                                5U

/* Definition for field SW in Register L1DMPPA27 */
#define L1DMPPA27_SW_BIT_START                              4U
#define L1DMPPA27_SW_BIT_END                                4U

/* Definition for field SX in Register L1DMPPA27 */
#define L1DMPPA27_SX_BIT_START                              3U
#define L1DMPPA27_SX_BIT_END                                3U

/* Definition for field UR in Register L1DMPPA27 */
#define L1DMPPA27_UR_BIT_START                              2U
#define L1DMPPA27_UR_BIT_END                                2U

/* Definition for field UW in Register L1DMPPA27 */
#define L1DMPPA27_UW_BIT_START                              1U
#define L1DMPPA27_UW_BIT_END                                1U

/* Definition for field UX in Register L1DMPPA27 */
#define L1DMPPA27_UX_BIT_START                              0U
#define L1DMPPA27_UX_BIT_END                                0U

/* Definition for field RESV_1 in Register L1DMPPA28 */
#define L1DMPPA28_RESV_1_BIT_START                          16U
#define L1DMPPA28_RESV_1_BIT_END                            31U

/* Definition for field AID5 in Register L1DMPPA28 */
#define L1DMPPA28_AID5_BIT_START                            15U
#define L1DMPPA28_AID5_BIT_END                              15U

/* Definition for field AID4 in Register L1DMPPA28 */
#define L1DMPPA28_AID4_BIT_START                            14U
#define L1DMPPA28_AID4_BIT_END                              14U

/* Definition for field AID3 in Register L1DMPPA28 */
#define L1DMPPA28_AID3_BIT_START                            13U
#define L1DMPPA28_AID3_BIT_END                              13U

/* Definition for field AID2 in Register L1DMPPA28 */
#define L1DMPPA28_AID2_BIT_START                            12U
#define L1DMPPA28_AID2_BIT_END                              12U

/* Definition for field AID1 in Register L1DMPPA28 */
#define L1DMPPA28_AID1_BIT_START                            11U
#define L1DMPPA28_AID1_BIT_END                              11U

/* Definition for field AID0 in Register L1DMPPA28 */
#define L1DMPPA28_AID0_BIT_START                            10U
#define L1DMPPA28_AID0_BIT_END                              10U

/* Definition for field AIDX in Register L1DMPPA28 */
#define L1DMPPA28_AIDX_BIT_START                            9U
#define L1DMPPA28_AIDX_BIT_END                              9U

/* Definition for field LOCAL in Register L1DMPPA28 */
#define L1DMPPA28_LOCAL_BIT_START                           8U
#define L1DMPPA28_LOCAL_BIT_END                             8U

/* Definition for field NS in Register L1DMPPA28 */
#define L1DMPPA28_NS_BIT_START                              7U
#define L1DMPPA28_NS_BIT_END                                7U

/* Definition for field EMU in Register L1DMPPA28 */
#define L1DMPPA28_EMU_BIT_START                             6U
#define L1DMPPA28_EMU_BIT_END                               6U

/* Definition for field SR in Register L1DMPPA28 */
#define L1DMPPA28_SR_BIT_START                              5U
#define L1DMPPA28_SR_BIT_END                                5U

/* Definition for field SW in Register L1DMPPA28 */
#define L1DMPPA28_SW_BIT_START                              4U
#define L1DMPPA28_SW_BIT_END                                4U

