0xastro/fmcw-RADAR/mmwave_sdk/packages/ti/drivers/soc/include/reg_dspicfg.h
/* Definition for field UX in Register L1DMPPA30 */
#define L1DMPPA30_UX_BIT_START                              0U
#define L1DMPPA30_UX_BIT_END                                0U

/* Definition for field RESV_1 in Register L1DMPPA31 */
#define L1DMPPA31_RESV_1_BIT_START                          16U
#define L1DMPPA31_RESV_1_BIT_END                            31U

/* Definition for field AID5 in Register L1DMPPA31 */
#define L1DMPPA31_AID5_BIT_START                            15U
#define L1DMPPA31_AID5_BIT_END                              15U

/* Definition for field AID4 in Register L1DMPPA31 */
#define L1DMPPA31_AID4_BIT_START                            14U
#define L1DMPPA31_AID4_BIT_END                              14U

/* Definition for field AID3 in Register L1DMPPA31 */
#define L1DMPPA31_AID3_BIT_START                            13U
#define L1DMPPA31_AID3_BIT_END                              13U

/* Definition for field AID2 in Register L1DMPPA31 */
#define L1DMPPA31_AID2_BIT_START                            12U
#define L1DMPPA31_AID2_BIT_END                              12U

/* Definition for field AID1 in Register L1DMPPA31 */
#define L1DMPPA31_AID1_BIT_START                            11U
#define L1DMPPA31_AID1_BIT_END                              11U

/* Definition for field AID0 in Register L1DMPPA31 */
#define L1DMPPA31_AID0_BIT_START                            10U
#define L1DMPPA31_AID0_BIT_END                              10U

/* Definition for field AIDX in Register L1DMPPA31 */
#define L1DMPPA31_AIDX_BIT_START                            9U
#define L1DMPPA31_AIDX_BIT_END                              9U

/* Definition for field LOCAL in Register L1DMPPA31 */
#define L1DMPPA31_LOCAL_BIT_START                           8U
#define L1DMPPA31_LOCAL_BIT_END                             8U

/* Definition for field NS in Register L1DMPPA31 */
#define L1DMPPA31_NS_BIT_START                              7U
#define L1DMPPA31_NS_BIT_END                                7U

/* Definition for field EMU in Register L1DMPPA31 */
#define L1DMPPA31_EMU_BIT_START                             6U
#define L1DMPPA31_EMU_BIT_END                               6U

/* Definition for field SR in Register L1DMPPA31 */
#define L1DMPPA31_SR_BIT_START                              5U
#define L1DMPPA31_SR_BIT_END                                5U

/* Definition for field SW in Register L1DMPPA31 */
#define L1DMPPA31_SW_BIT_START                              4U
#define L1DMPPA31_SW_BIT_END                                4U

/* Definition for field SX in Register L1DMPPA31 */
#define L1DMPPA31_SX_BIT_START                              3U
#define L1DMPPA31_SX_BIT_END                                3U

/* Definition for field UR in Register L1DMPPA31 */
#define L1DMPPA31_UR_BIT_START                              2U
#define L1DMPPA31_UR_BIT_END                                2U

/* Definition for field UW in Register L1DMPPA31 */
#define L1DMPPA31_UW_BIT_START                              1U
#define L1DMPPA31_UW_BIT_END                                1U

/* Definition for field UX in Register L1DMPPA31 */
#define L1DMPPA31_UX_BIT_START                              0U
#define L1DMPPA31_UX_BIT_END                                0U



/**
 * @struct DSPICFGRegs_t
 * @brief
 *   Module DSP_ICFG Register Definition
 * @details
 *   This structure is used to access the DSP_ICFG module registers.
 */
/**
 * @typedef DSPICFGRegs
 * @brief
 *   Module DSP_ICFG Register Frame type Definition
 * @details
 *   This type is used to access the DSP_ICFG module registers.
 */
typedef volatile struct DSPICFGRegs_t
{

#if 0 /* Redundent area due to the address offset not equal to zero */
    uint32_t    RESTRICTED0[2097152]               ;        /* Offset = 0x000 */
#endif
    uint32_t    EVTFLAG0                           ;        /* Offset = 0x800000 */
    uint32_t    EVTFLAG1                           ;        /* Offset = 0x800004 */
    uint32_t    EVTFLAG2                           ;        /* Offset = 0x800008 */
    uint32_t    EVTFLAG3                           ;        /* Offset = 0x80000C */
    uint32_t    RESTRICTED1[4]                     ;        /* Offset = 0x800010 */
    uint32_t    EVTSET0                            ;        /* Offset = 0x800020 */
    uint32_t    EVTSET1                            ;        /* Offset = 0x800024 */
    uint32_t    EVTSET2                            ;        /* Offset = 0x800028 */
    uint32_t    EVTSET3                            ;        /* Offset = 0x80002C */
    uint32_t    RESTRICTED2[4]                     ;        /* Offset = 0x800030 */
    uint32_t    EVTCLR0                            ;        /* Offset = 0x800040 */
    uint32_t    EVTCLR1                            ;        /* Offset = 0x800044 */
    uint32_t    EVTCLR2                            ;        /* Offset = 0x800048 */
    uint32_t    EVTCLR3                            ;        /* Offset = 0x80004C */
    uint32_t    RESTRICTED3[12]                    ;        /* Offset = 0x800050 */
    uint32_t    EVTMASK0                           ;        /* Offset = 0x800080 */
    uint32_t    EVTMASK1                           ;        /* Offset = 0x800084 */
    uint32_t    EVTMASK2                           ;        /* Offset = 0x800088 */
    uint32_t    EVTMASK3                           ;        /* Offset = 0x80008C */
    uint32_t    RESTRICTED4[4]                     ;        /* Offset = 0x800090 */
    uint32_t    MEVTFLAG0                          ;        /* Offset = 0x8000A0 */
    uint32_t    MEVTFLAG1                          ;        /* Offset = 0x8000A4 */
    uint32_t    MEVTFLAG2                          ;        /* Offset = 0x8000A8 */
    uint32_t    MEVTFLAG3                          ;        /* Offset = 0x8000AC */
    uint32_t    RESTRICTED5[4]                     ;        /* Offset = 0x8000B0 */
    uint32_t    EXPMASK0                           ;        /* Offset = 0x8000C0 */
    uint32_t    EXPMASK1                           ;        /* Offset = 0x8000C4 */
    uint32_t    EXPMASK2                           ;        /* Offset = 0x8000C8 */
    uint32_t    EXPMASK3                           ;        /* Offset = 0x8000CC */
    uint32_t    RESTRICTED6[4]                     ;        /* Offset = 0x8000D0 */
    uint32_t    MEXPFLAG0                          ;        /* Offset = 0x8000E0 */
    uint32_t    MEXPFLAG1                          ;        /* Offset = 0x8000E4 */
    uint32_t    MEXPFLAG2                          ;        /* Offset = 0x8000E8 */
    uint32_t    MEXPFLAG3                          ;        /* Offset = 0x8000EC */
    uint32_t    RESTRICTED7[5]                     ;        /* Offset = 0x8000F0 */
    uint32_t    INTMUX1                            ;        /* Offset = 0x800104 */
    uint32_t    INTMUX2                            ;        /* Offset = 0x800108 */
    uint32_t    INTMUX3                            ;        /* Offset = 0x80010C */
    uint32_t    RESTRICTED8[12]                    ;        /* Offset = 0x800110 */
    uint32_t    AEGMUX0                            ;        /* Offset = 0x800140 */
    uint32_t    AEGMUX1                            ;        /* Offset = 0x800144 */
    uint32_t    RESTRICTED9[14]                    ;        /* Offset = 0x800148 */
    uint32_t    INTXSTAT                           ;        /* Offset = 0x800180 */
    uint32_t    INTXCLR                            ;        /* Offset = 0x800184 */
    uint32_t    INTDMASK                           ;        /* Offset = 0x800188 */
    uint32_t    RESTRICTED10[13]                   ;        /* Offset = 0x80018C */
    uint32_t    EVTASRT                            ;        /* Offset = 0x8001C0 */
    uint32_t    RESTRICTED11[16271]                ;        /* Offset = 0x8001C4 */
    uint32_t    PDCCMD                             ;        /* Offset = 0x810000 */
    uint32_t    RESTRICTED12[2047]                 ;        /* Offset = 0x810004 */
    uint32_t    MM_REVID                           ;        /* Offset = 0x812000 */
    uint32_t    RESTRICTED13[14335]                ;        /* Offset = 0x812004 */
    uint32_t    IDMA0_STAT                         ;        /* Offset = 0x820000 */
    uint32_t    IDMA0_MASK                         ;        /* Offset = 0x820004 */
    uint32_t    IDMA0_SOURCE                       ;        /* Offset = 0x820008 */
    uint32_t    IDMA0_DEST                         ;        /* Offset = 0x82000C */
    uint32_t    IDMA0_COUNT                        ;        /* Offset = 0x820010 */
    uint32_t    RESTRICTED14[59]                   ;        /* Offset = 0x820014 */
    uint32_t    IDMA1_STAT                         ;        /* Offset = 0x820100 */
    uint32_t    RESTRICTED15                       ;        /* Offset = 0x820104 */
    uint32_t    IDMA1_SOURCE                       ;        /* Offset = 0x820108 */
    uint32_t    IDMA1_DEST                         ;        /* Offset = 0x82010C */
    uint32_t    IDMA1_COUNT                        ;        /* Offset = 0x820110 */
    uint32_t    RESTRICTED16[59]                   ;        /* Offset = 0x820114 */
    uint32_t    CPUARBE                            ;        /* Offset = 0x820200 */
    uint32_t    IDMAARBE                           ;        /* Offset = 0x820204 */
    uint32_t    SDMAARBE                           ;        /* Offset = 0x820208 */
    uint32_t    RESTRICTED17                       ;        /* Offset = 0x82020C */
    uint32_t    ECFGARBE                           ;        /* Offset = 0x820210 */
    uint32_t    RESTRICTED18[59]                   ;        /* Offset = 0x820214 */
    uint32_t    ICFGMPFAR                          ;        /* Offset = 0x820300 */
    uint32_t    ICFGMPFSR                          ;        /* Offset = 0x820304 */
    uint32_t    ICFGMPFCR                          ;        /* Offset = 0x820308 */
    uint32_t    RESTRICTED19[63]                   ;        /* Offset = 0x82030C */
    uint32_t    ECFGERR                            ;        /* Offset = 0x820408 */
    uint32_t    ECFGERRCLR                         ;        /* Offset = 0x82040C */
    uint32_t    RESTRICTED20[60]                   ;        /* Offset = 0x820410 */
    uint32_t    PAMAP0                             ;        /* Offset = 0x820500 */
    uint32_t    PAMAP1                             ;        /* Offset = 0x820504 */
    uint32_t    PAMAP2                             ;        /* Offset = 0x820508 */
    uint32_t    PAMAP3                             ;        /* Offset = 0x82050C */
    uint32_t    PAMAP4                             ;        /* Offset = 0x820510 */
    uint32_t    PAMAP5                             ;        /* Offset = 0x820514 */
    uint32_t    PAMAP6                             ;        /* Offset = 0x820518 */
    uint32_t    PAMAP7                             ;        /* Offset = 0x82051C */
    uint32_t    PAMAP8                             ;        /* Offset = 0x820520 */
    uint32_t    PAMAP9                             ;        /* Offset = 0x820524 */
    uint32_t    PAMAP10                            ;        /* Offset = 0x820528 */
    uint32_t    PAMAP11                            ;        /* Offset = 0x82052C */
    uint32_t    PAMAP12                            ;        /* Offset = 0x820530 */
    uint32_t    PAMAP13                            ;        /* Offset = 0x820534 */
    uint32_t    PAMAP14                            ;        /* Offset = 0x820538 */
    uint32_t    PAMAP15                            ;        /* Offset = 0x82053C */
    uint32_t    RESTRICTED21[32432]                ;        /* Offset = 0x820540 */
    uint32_t    L2CFG                              ;        /* Offset = 0x840000 */
    uint32_t    RESTRICTED22[7]                    ;        /* Offset = 0x840004 */
    uint32_t    L1PCFG                             ;        /* Offset = 0x840020 */
    uint32_t    L1PCC                              ;        /* Offset = 0x840024 */
    uint32_t    RESTRICTED23[6]                    ;        /* Offset = 0x840028 */
    uint32_t    L1DCFG                             ;        /* Offset = 0x840040 */
    uint32_t    L1DCC                              ;        /* Offset = 0x840044 */
    uint32_t    RESTRICTED24[1006]                 ;        /* Offset = 0x840048 */
    uint32_t    CPUARBU                            ;        /* Offset = 0x841000 */
    uint32_t    IDMAARBU                           ;        /* Offset = 0x841004 */
    uint32_t    SDMAARBU                           ;        /* Offset = 0x841008 */
    uint32_t    UCARBU                             ;        /* Offset = 0x84100C */
    uint32_t    MDMAARBU                           ;        /* Offset = 0x841010 */
    uint32_t    RESTRICTED25[11]                   ;        /* Offset = 0x841014 */
    uint32_t    CPUARBD                            ;        /* Offset = 0x841040 */
    uint32_t    IDMAARBD                           ;        /* Offset = 0x841044 */
    uint32_t    SDMAARBD                           ;        /* Offset = 0x841048 */
    uint32_t    UCARBD                             ;        /* Offset = 0x84104C */
    uint32_t    RESTRICTED26[3052]                 ;        /* Offset = 0x841050 */
    uint32_t    L2WBAR                             ;        /* Offset = 0x844000 */
    uint32_t    L2WWC                              ;        /* Offset = 0x844004 */
    uint32_t    RESTRICTED27[2]                    ;        /* Offset = 0x844008 */
    uint32_t    L2WIBAR                            ;        /* Offset = 0x844010 */
    uint32_t    L2WIWC                             ;        /* Offset = 0x844014 */
    uint32_t    L2IBAR                             ;        /* Offset = 0x844018 */
    uint32_t    L2IWC                              ;        /* Offset = 0x84401C */
    uint32_t    L1PIBAR                            ;        /* Offset = 0x844020 */
    uint32_t    L1PIWC                             ;        /* Offset = 0x844024 */
    uint32_t    RESTRICTED28[2]                    ;        /* Offset = 0x844028 */
    uint32_t    L1DWIBAR                           ;        /* Offset = 0x844030 */
    uint32_t    L1DWIWC                            ;        /* Offset = 0x844034 */
    uint32_t    RESTRICTED29[2]                    ;        /* Offset = 0x844038 */
    uint32_t    L1DWBAR                            ;        /* Offset = 0x844040 */
    uint32_t    L1DWWC                             ;        /* Offset = 0x844044 */
    uint32_t    L1DIBAR                            ;        /* Offset = 0x844048 */
    uint32_t    L1DIWC                             ;        /* Offset = 0x84404C */
    uint32_t    RESTRICTED30[1004]                 ;        /* Offset = 0x844050 */
    uint32_t    L2WB                               ;        /* Offset = 0x845000 */
    uint32_t    L2WBINV                            ;        /* Offset = 0x845004 */
    uint32_t    L2INV                              ;        /* Offset = 0x845008 */
    uint32_t    RESTRICTED31[7]                    ;        /* Offset = 0x84500C */
    uint32_t    L1PINV                             ;        /* Offset = 0x845028 */
    uint32_t    RESTRICTED32[5]                    ;        /* Offset = 0x84502C */
    uint32_t    L1DWB                              ;        /* Offset = 0x845040 */
    uint32_t    L1DWBINV                           ;        /* Offset = 0x845044 */
    uint32_t    L1DINV                             ;        /* Offset = 0x845048 */
    uint32_t    RESTRICTED33[1006]                 ;        /* Offset = 0x84504C */
    uint32_t    L2EDSTAT                           ;        /* Offset = 0x846004 */
    uint32_t    L2EDCMD                            ;        /* Offset = 0x846008 */
    uint32_t    L2EDADDR                           ;        /* Offset = 0x84600C */
    uint32_t    L2EDPEN0                           ;        /* Offset = 0x846010 */
    uint32_t    L2EDPEN1                           ;        /* Offset = 0x846014 */
    uint32_t    L2EDCPEC                           ;        /* Offset = 0x846018 */
    uint32_t    L2EDCNEC                           ;        /* Offset = 0x84601C */
    uint32_t    MDMAERR                            ;        /* Offset = 0x846020 */
    uint32_t    MDMAERRCLR                         ;        /* Offset = 0x846024 */
    uint32_t    RESTRICTED34[2]                    ;        /* Offset = 0x846028 */
    uint32_t    L2EDCEN                            ;        /* Offset = 0x846030 */
    uint32_t    RESTRICTED35[244]                  ;        /* Offset = 0x846034 */
    uint32_t    L1PEDSTAT                          ;        /* Offset = 0x846404 */
    uint32_t    L1PEDCMD                           ;        /* Offset = 0x846408 */
    uint32_t    L1PEDADDR                          ;        /* Offset = 0x84640C */
    uint32_t    RESTRICTED36[1788]                 ;        /* Offset = 0x846410 */
    uint32_t    MAR_0                              ;        /* Offset = 0x848000 */
    uint32_t    MAR_1                              ;        /* Offset = 0x848004 */
    uint32_t    MAR_2                              ;        /* Offset = 0x848008 */
    uint32_t    MAR_3                              ;        /* Offset = 0x84800C */
    uint32_t    MAR_4                              ;        /* Offset = 0x848010 */
    uint32_t    MAR_5                              ;        /* Offset = 0x848014 */
    uint32_t    MAR_6                              ;        /* Offset = 0x848018 */
    uint32_t    MAR_7                              ;        /* Offset = 0x84801C */
    uint32_t    MAR_8                              ;        /* Offset = 0x848020 */
    uint32_t    MAR_9                              ;        /* Offset = 0x848024 */
    uint32_t    MAR_10                             ;        /* Offset = 0x848028 */
    uint32_t    MAR_11                             ;        /* Offset = 0x84802C */
    uint32_t    MAR_12                             ;        /* Offset = 0x848030 */
    uint32_t    MAR_13                             ;        /* Offset = 0x848034 */
    uint32_t    MAR_14                             ;        /* Offset = 0x848038 */
    uint32_t    MAR_15                             ;        /* Offset = 0x84803C */
    uint32_t    MAR_16                             ;        /* Offset = 0x848040 */
    uint32_t    MAR_17                             ;        /* Offset = 0x848044 */
    uint32_t    MAR_18                             ;        /* Offset = 0x848048 */
    uint32_t    MAR_19                             ;        /* Offset = 0x84804C */
    uint32_t    MAR_20                             ;        /* Offset = 0x848050 */
    uint32_t    MAR_21                             ;        /* Offset = 0x848054 */
    uint32_t    MAR_22                             ;        /* Offset = 0x848058 */
    uint32_t    MAR_23                             ;        /* Offset = 0x84805C */
    uint32_t    MAR_24                             ;        /* Offset = 0x848060 */
    uint32_t    MAR_25                             ;        /* Offset = 0x848064 */
    uint32_t    MAR_26                             ;        /* Offset = 0x848068 */
    uint32_t    MAR_27                             ;        /* Offset = 0x84806C */
    uint32_t    MAR_28                             ;        /* Offset = 0x848070 */
    uint32_t    MAR_29                             ;        /* Offset = 0x848074 */
    uint32_t    MAR_30                             ;        /* Offset = 0x848078 */
    uint32_t    MAR_31                             ;        /* Offset = 0x84807C */
    uint32_t    MAR_32                             ;        /* Offset = 0x848080 */
    uint32_t    MAR_33                             ;        /* Offset = 0x848084 */
    uint32_t    MAR_34                             ;        /* Offset = 0x848088 */
    uint32_t    MAR_35                             ;        /* Offset = 0x84808C */
    uint32_t    MAR_36                             ;        /* Offset = 0x848090 */
    uint32_t    MAR_37                             ;        /* Offset = 0x848094 */
    uint32_t    MAR_38                             ;        /* Offset = 0x848098 */
    uint32_t    MAR_39                             ;        /* Offset = 0x84809C */
    uint32_t    MAR_40                             ;        /* Offset = 0x8480A0 */
    uint32_t    MAR_41                             ;        /* Offset = 0x8480A4 */
    uint32_t    MAR_42                             ;        /* Offset = 0x8480A8 */
    uint32_t    MAR_43                             ;        /* Offset = 0x8480AC */
    uint32_t    MAR_44                             ;        /* Offset = 0x8480B0 */
    uint32_t    MAR_45                             ;        /* Offset = 0x8480B4 */
    uint32_t    MAR_46                             ;        /* Offset = 0x8480B8 */
    uint32_t    MAR_47                             ;        /* Offset = 0x8480BC */
    uint32_t    MAR_48                             ;        /* Offset = 0x8480C0 */
    uint32_t    MAR_49                             ;        /* Offset = 0x8480C4 */
    uint32_t    MAR_50                             ;        /* Offset = 0x8480C8 */
    uint32_t    MAR_51                             ;        /* Offset = 0x8480CC */
    uint32_t    MAR_52                             ;        /* Offset = 0x8480D0 */
    uint32_t    MAR_53                             ;        /* Offset = 0x8480D4 */
    uint32_t    MAR_54                             ;        /* Offset = 0x8480D8 */
    uint32_t    MAR_55                             ;        /* Offset = 0x8480DC */
    uint32_t    MAR_56                             ;        /* Offset = 0x8480E0 */
    uint32_t    MAR_57                             ;        /* Offset = 0x8480E4 */
    uint32_t    MAR_58                             ;        /* Offset = 0x8480E8 */
    uint32_t    MAR_59                             ;        /* Offset = 0x8480EC */
    uint32_t    MAR_60                             ;        /* Offset = 0x8480F0 */
    uint32_t    MAR_61                             ;        /* Offset = 0x8480F4 */
    uint32_t    MAR_62                             ;        /* Offset = 0x8480F8 */
    uint32_t    MAR_63                             ;        /* Offset = 0x8480FC */
    uint32_t    MAR_64                             ;        /* Offset = 0x848100 */
    uint32_t    MAR_65                             ;        /* Offset = 0x848104 */
    uint32_t    MAR_66                             ;        /* Offset = 0x848108 */
    uint32_t    MAR_67                             ;        /* Offset = 0x84810C */
    uint32_t    MAR_68                             ;        /* Offset = 0x848110 */
    uint32_t    MAR_69                             ;        /* Offset = 0x848114 */
    uint32_t    MAR_70                             ;        /* Offset = 0x848118 */
    uint32_t    MAR_71                             ;        /* Offset = 0x84811C */
    uint32_t    MAR_72                             ;        /* Offset = 0x848120 */
    uint32_t    MAR_73                             ;        /* Offset = 0x848124 */
    uint32_t    MAR_74                             ;        /* Offset = 0x848128 */
    uint32_t    MAR_75                             ;        /* Offset = 0x84812C */
    uint32_t    MAR_76                             ;        /* Offset = 0x848130 */
    uint32_t    MAR_77                             ;        /* Offset = 0x848134 */
    uint32_t    MAR_78                             ;        /* Offset = 0x848138 */
    uint32_t    MAR_79                             ;        /* Offset = 0x84813C */
    uint32_t    MAR_80                             ;        /* Offset = 0x848140 */
    uint32_t    MAR_81                             ;        /* Offset = 0x848144 */
    uint32_t    MAR_82                             ;        /* Offset = 0x848148 */
