0xastro/fmcw-RADAR/mmwave_sdk/packages/ti/drivers/soc/include/reg_dspicfg.h
    uint32_t    MAR_83                             ;        /* Offset = 0x84814C */
    uint32_t    MAR_84                             ;        /* Offset = 0x848150 */
    uint32_t    MAR_85                             ;        /* Offset = 0x848154 */
    uint32_t    MAR_86                             ;        /* Offset = 0x848158 */
    uint32_t    MAR_87                             ;        /* Offset = 0x84815C */
    uint32_t    MAR_88                             ;        /* Offset = 0x848160 */
    uint32_t    MAR_89                             ;        /* Offset = 0x848164 */
    uint32_t    MAR_90                             ;        /* Offset = 0x848168 */
    uint32_t    MAR_91                             ;        /* Offset = 0x84816C */
    uint32_t    MAR_92                             ;        /* Offset = 0x848170 */
    uint32_t    MAR_93                             ;        /* Offset = 0x848174 */
    uint32_t    MAR_94                             ;        /* Offset = 0x848178 */
    uint32_t    MAR_95                             ;        /* Offset = 0x84817C */
    uint32_t    MAR_96                             ;        /* Offset = 0x848180 */
    uint32_t    MAR_97                             ;        /* Offset = 0x848184 */
    uint32_t    MAR_98                             ;        /* Offset = 0x848188 */
    uint32_t    MAR_99                             ;        /* Offset = 0x84818C */
    uint32_t    MAR_100                            ;        /* Offset = 0x848190 */
    uint32_t    MAR_101                            ;        /* Offset = 0x848194 */
    uint32_t    MAR_102                            ;        /* Offset = 0x848198 */
    uint32_t    MAR_103                            ;        /* Offset = 0x84819C */
    uint32_t    MAR_104                            ;        /* Offset = 0x8481A0 */
    uint32_t    MAR_105                            ;        /* Offset = 0x8481A4 */
    uint32_t    MAR_106                            ;        /* Offset = 0x8481A8 */
    uint32_t    MAR_107                            ;        /* Offset = 0x8481AC */
    uint32_t    MAR_108                            ;        /* Offset = 0x8481B0 */
    uint32_t    MAR_109                            ;        /* Offset = 0x8481B4 */
    uint32_t    MAR_110                            ;        /* Offset = 0x8481B8 */
    uint32_t    MAR_111                            ;        /* Offset = 0x8481BC */
    uint32_t    MAR_112                            ;        /* Offset = 0x8481C0 */
    uint32_t    MAR_113                            ;        /* Offset = 0x8481C4 */
    uint32_t    MAR_114                            ;        /* Offset = 0x8481C8 */
    uint32_t    MAR_115                            ;        /* Offset = 0x8481CC */
    uint32_t    MAR_116                            ;        /* Offset = 0x8481D0 */
    uint32_t    MAR_117                            ;        /* Offset = 0x8481D4 */
    uint32_t    MAR_118                            ;        /* Offset = 0x8481D8 */
    uint32_t    MAR_119                            ;        /* Offset = 0x8481DC */
    uint32_t    MAR_120                            ;        /* Offset = 0x8481E0 */
    uint32_t    MAR_121                            ;        /* Offset = 0x8481E4 */
    uint32_t    MAR_122                            ;        /* Offset = 0x8481E8 */
    uint32_t    MAR_123                            ;        /* Offset = 0x8481EC */
    uint32_t    MAR_124                            ;        /* Offset = 0x8481F0 */
    uint32_t    MAR_125                            ;        /* Offset = 0x8481F4 */
    uint32_t    MAR_126                            ;        /* Offset = 0x8481F8 */
    uint32_t    MAR_127                            ;        /* Offset = 0x8481FC */
    uint32_t    MAR_128                            ;        /* Offset = 0x848200 */
    uint32_t    MAR_129                            ;        /* Offset = 0x848204 */
    uint32_t    MAR_130                            ;        /* Offset = 0x848208 */
    uint32_t    MAR_131                            ;        /* Offset = 0x84820C */
    uint32_t    MAR_132                            ;        /* Offset = 0x848210 */
    uint32_t    MAR_133                            ;        /* Offset = 0x848214 */
    uint32_t    MAR_134                            ;        /* Offset = 0x848218 */
    uint32_t    MAR_135                            ;        /* Offset = 0x84821C */
    uint32_t    MAR_136                            ;        /* Offset = 0x848220 */
    uint32_t    MAR_137                            ;        /* Offset = 0x848224 */
    uint32_t    MAR_138                            ;        /* Offset = 0x848228 */
    uint32_t    MAR_139                            ;        /* Offset = 0x84822C */
    uint32_t    MAR_140                            ;        /* Offset = 0x848230 */
    uint32_t    MAR_141                            ;        /* Offset = 0x848234 */
    uint32_t    MAR_142                            ;        /* Offset = 0x848238 */
    uint32_t    MAR_143                            ;        /* Offset = 0x84823C */
    uint32_t    MAR_144                            ;        /* Offset = 0x848240 */
    uint32_t    MAR_145                            ;        /* Offset = 0x848244 */
    uint32_t    MAR_146                            ;        /* Offset = 0x848248 */
    uint32_t    MAR_147                            ;        /* Offset = 0x84824C */
    uint32_t    MAR_148                            ;        /* Offset = 0x848250 */
    uint32_t    MAR_149                            ;        /* Offset = 0x848254 */
    uint32_t    MAR_150                            ;        /* Offset = 0x848258 */
    uint32_t    MAR_151                            ;        /* Offset = 0x84825C */
    uint32_t    MAR_152                            ;        /* Offset = 0x848260 */
    uint32_t    MAR_153                            ;        /* Offset = 0x848264 */
    uint32_t    MAR_154                            ;        /* Offset = 0x848268 */
    uint32_t    MAR_155                            ;        /* Offset = 0x84826C */
    uint32_t    MAR_156                            ;        /* Offset = 0x848270 */
    uint32_t    MAR_157                            ;        /* Offset = 0x848274 */
    uint32_t    MAR_158                            ;        /* Offset = 0x848278 */
    uint32_t    MAR_159                            ;        /* Offset = 0x84827C */
    uint32_t    MAR_160                            ;        /* Offset = 0x848280 */
    uint32_t    MAR_161                            ;        /* Offset = 0x848284 */
    uint32_t    MAR_162                            ;        /* Offset = 0x848288 */
    uint32_t    MAR_163                            ;        /* Offset = 0x84828C */
    uint32_t    MAR_164                            ;        /* Offset = 0x848290 */
    uint32_t    MAR_165                            ;        /* Offset = 0x848294 */
    uint32_t    MAR_166                            ;        /* Offset = 0x848298 */
    uint32_t    MAR_167                            ;        /* Offset = 0x84829C */
    uint32_t    MAR_168                            ;        /* Offset = 0x8482A0 */
    uint32_t    MAR_169                            ;        /* Offset = 0x8482A4 */
    uint32_t    MAR_170                            ;        /* Offset = 0x8482A8 */
    uint32_t    MAR_171                            ;        /* Offset = 0x8482AC */
    uint32_t    MAR_172                            ;        /* Offset = 0x8482B0 */
    uint32_t    MAR_173                            ;        /* Offset = 0x8482B4 */
    uint32_t    MAR_174                            ;        /* Offset = 0x8482B8 */
    uint32_t    MAR_175                            ;        /* Offset = 0x8482BC */
    uint32_t    MAR_176                            ;        /* Offset = 0x8482C0 */
    uint32_t    MAR_177                            ;        /* Offset = 0x8482C4 */
    uint32_t    MAR_178                            ;        /* Offset = 0x8482C8 */
    uint32_t    MAR_179                            ;        /* Offset = 0x8482CC */
    uint32_t    MAR_180                            ;        /* Offset = 0x8482D0 */
    uint32_t    MAR_181                            ;        /* Offset = 0x8482D4 */
    uint32_t    MAR_182                            ;        /* Offset = 0x8482D8 */
    uint32_t    MAR_183                            ;        /* Offset = 0x8482DC */
    uint32_t    MAR_184                            ;        /* Offset = 0x8482E0 */
    uint32_t    MAR_185                            ;        /* Offset = 0x8482E4 */
    uint32_t    MAR_186                            ;        /* Offset = 0x8482E8 */
    uint32_t    MAR_187                            ;        /* Offset = 0x8482EC */
    uint32_t    MAR_188                            ;        /* Offset = 0x8482F0 */
    uint32_t    MAR_189                            ;        /* Offset = 0x8482F4 */
    uint32_t    MAR_190                            ;        /* Offset = 0x8482F8 */
    uint32_t    MAR_191                            ;        /* Offset = 0x8482FC */
    uint32_t    MAR_192                            ;        /* Offset = 0x848300 */
    uint32_t    MAR_193                            ;        /* Offset = 0x848304 */
    uint32_t    MAR_194                            ;        /* Offset = 0x848308 */
    uint32_t    MAR_195                            ;        /* Offset = 0x84830C */
    uint32_t    MAR_196                            ;        /* Offset = 0x848310 */
    uint32_t    MAR_197                            ;        /* Offset = 0x848314 */
    uint32_t    MAR_198                            ;        /* Offset = 0x848318 */
    uint32_t    MAR_199                            ;        /* Offset = 0x84831C */
    uint32_t    MAR_200                            ;        /* Offset = 0x848320 */
    uint32_t    MAR_201                            ;        /* Offset = 0x848324 */
    uint32_t    MAR_202                            ;        /* Offset = 0x848328 */
    uint32_t    MAR_203                            ;        /* Offset = 0x84832C */
    uint32_t    MAR_204                            ;        /* Offset = 0x848330 */
    uint32_t    MAR_205                            ;        /* Offset = 0x848334 */
    uint32_t    MAR_206                            ;        /* Offset = 0x848338 */
    uint32_t    MAR_207                            ;        /* Offset = 0x84833C */
    uint32_t    MAR_208                            ;        /* Offset = 0x848340 */
    uint32_t    MAR_209                            ;        /* Offset = 0x848344 */
    uint32_t    MAR_210                            ;        /* Offset = 0x848348 */
    uint32_t    MAR_211                            ;        /* Offset = 0x84834C */
    uint32_t    MAR_212                            ;        /* Offset = 0x848350 */
    uint32_t    MAR_213                            ;        /* Offset = 0x848354 */
    uint32_t    MAR_214                            ;        /* Offset = 0x848358 */
    uint32_t    MAR_215                            ;        /* Offset = 0x84835C */
    uint32_t    MAR_216                            ;        /* Offset = 0x848360 */
    uint32_t    MAR_217                            ;        /* Offset = 0x848364 */
    uint32_t    MAR_218                            ;        /* Offset = 0x848368 */
    uint32_t    MAR_219                            ;        /* Offset = 0x84836C */
    uint32_t    MAR_220                            ;        /* Offset = 0x848370 */
    uint32_t    MAR_221                            ;        /* Offset = 0x848374 */
    uint32_t    MAR_222                            ;        /* Offset = 0x848378 */
    uint32_t    MAR_223                            ;        /* Offset = 0x84837C */
    uint32_t    MAR_224                            ;        /* Offset = 0x848380 */
    uint32_t    MAR_225                            ;        /* Offset = 0x848384 */
    uint32_t    MAR_226                            ;        /* Offset = 0x848388 */
    uint32_t    MAR_227                            ;        /* Offset = 0x84838C */
    uint32_t    MAR_228                            ;        /* Offset = 0x848390 */
    uint32_t    MAR_229                            ;        /* Offset = 0x848394 */
    uint32_t    MAR_230                            ;        /* Offset = 0x848398 */
    uint32_t    MAR_231                            ;        /* Offset = 0x84839C */
    uint32_t    MAR_232                            ;        /* Offset = 0x8483A0 */
    uint32_t    MAR_233                            ;        /* Offset = 0x8483A4 */
    uint32_t    MAR_234                            ;        /* Offset = 0x8483A8 */
    uint32_t    MAR_235                            ;        /* Offset = 0x8483AC */
    uint32_t    MAR_236                            ;        /* Offset = 0x8483B0 */
    uint32_t    MAR_237                            ;        /* Offset = 0x8483B4 */
    uint32_t    MAR_238                            ;        /* Offset = 0x8483B8 */
    uint32_t    MAR_239                            ;        /* Offset = 0x8483BC */
    uint32_t    MAR_240                            ;        /* Offset = 0x8483C0 */
    uint32_t    MAR_241                            ;        /* Offset = 0x8483C4 */
    uint32_t    MAR_242                            ;        /* Offset = 0x8483C8 */
    uint32_t    MAR_243                            ;        /* Offset = 0x8483CC */
    uint32_t    MAR_244                            ;        /* Offset = 0x8483D0 */
    uint32_t    MAR_245                            ;        /* Offset = 0x8483D4 */
    uint32_t    MAR_246                            ;        /* Offset = 0x8483D8 */
    uint32_t    MAR_247                            ;        /* Offset = 0x8483DC */
    uint32_t    MAR_248                            ;        /* Offset = 0x8483E0 */
    uint32_t    MAR_249                            ;        /* Offset = 0x8483E4 */
    uint32_t    MAR_250                            ;        /* Offset = 0x8483E8 */
    uint32_t    MAR_251                            ;        /* Offset = 0x8483EC */
    uint32_t    MAR_252                            ;        /* Offset = 0x8483F0 */
    uint32_t    MAR_253                            ;        /* Offset = 0x8483F4 */
    uint32_t    MAR_254                            ;        /* Offset = 0x8483F8 */
    uint32_t    MAR_255                            ;        /* Offset = 0x8483FC */
    uint32_t    RESTRICTED37[1792]                 ;        /* Offset = 0x848400 */
    uint32_t    L2MPFAR                            ;        /* Offset = 0x84A000 */
    uint32_t    L2MPFSR                            ;        /* Offset = 0x84A004 */
    uint32_t    L2MPFCR                            ;        /* Offset = 0x84A008 */
    uint32_t    RESTRICTED38[125]                  ;        /* Offset = 0x84A00C */
    uint32_t    L2MPPA0                            ;        /* Offset = 0x84A200 */
    uint32_t    L2MPPA1                            ;        /* Offset = 0x84A204 */
    uint32_t    L2MPPA2                            ;        /* Offset = 0x84A208 */
    uint32_t    L2MPPA3                            ;        /* Offset = 0x84A20C */
    uint32_t    L2MPPA4                            ;        /* Offset = 0x84A210 */
    uint32_t    L2MPPA5                            ;        /* Offset = 0x84A214 */
    uint32_t    L2MPPA6                            ;        /* Offset = 0x84A218 */
    uint32_t    L2MPPA7                            ;        /* Offset = 0x84A21C */
    uint32_t    L2MPPA8                            ;        /* Offset = 0x84A220 */
    uint32_t    L2MPPA9                            ;        /* Offset = 0x84A224 */
    uint32_t    L2MPPA10                           ;        /* Offset = 0x84A228 */
    uint32_t    L2MPPA11                           ;        /* Offset = 0x84A22C */
    uint32_t    L2MPPA12                           ;        /* Offset = 0x84A230 */
    uint32_t    L2MPPA13                           ;        /* Offset = 0x84A234 */
    uint32_t    L2MPPA14                           ;        /* Offset = 0x84A238 */
    uint32_t    L2MPPA15                           ;        /* Offset = 0x84A23C */
    uint32_t    L2MPPA16                           ;        /* Offset = 0x84A240 */
    uint32_t    L2MPPA17                           ;        /* Offset = 0x84A244 */
    uint32_t    L2MPPA18                           ;        /* Offset = 0x84A248 */
    uint32_t    L2MPPA19                           ;        /* Offset = 0x84A24C */
    uint32_t    L2MPPA20                           ;        /* Offset = 0x84A250 */
    uint32_t    L2MPPA21                           ;        /* Offset = 0x84A254 */
    uint32_t    L2MPPA22                           ;        /* Offset = 0x84A258 */
    uint32_t    L2MPPA23                           ;        /* Offset = 0x84A25C */
    uint32_t    L2MPPA24                           ;        /* Offset = 0x84A260 */
    uint32_t    L2MPPA25                           ;        /* Offset = 0x84A264 */
    uint32_t    L2MPPA26                           ;        /* Offset = 0x84A268 */
    uint32_t    L2MPPA27                           ;        /* Offset = 0x84A26C */
    uint32_t    L2MPPA28                           ;        /* Offset = 0x84A270 */
    uint32_t    L2MPPA29                           ;        /* Offset = 0x84A274 */
    uint32_t    L2MPPA30                           ;        /* Offset = 0x84A278 */
    uint32_t    L2MPPA31                           ;        /* Offset = 0x84A27C */
    uint32_t    RESTRICTED39[96]                   ;        /* Offset = 0x84A280 */
    uint32_t    L1PMPFAR                           ;        /* Offset = 0x84A400 */
    uint32_t    L1PMPFSR                           ;        /* Offset = 0x84A404 */
    uint32_t    L1PMPFCR                           ;        /* Offset = 0x84A408 */
    uint32_t    RESTRICTED40[141]                  ;        /* Offset = 0x84A40C */
    uint32_t    L1PMPPA16                          ;        /* Offset = 0x84A640 */
    uint32_t    L1PMPPA17                          ;        /* Offset = 0x84A644 */
    uint32_t    L1PMPPA18                          ;        /* Offset = 0x84A648 */
    uint32_t    L1PMPPA19                          ;        /* Offset = 0x84A64C */
    uint32_t    L1PMPPA20                          ;        /* Offset = 0x84A650 */
    uint32_t    L1PMPPA21                          ;        /* Offset = 0x84A654 */
    uint32_t    L1PMPPA22                          ;        /* Offset = 0x84A658 */
    uint32_t    L1PMPPA23                          ;        /* Offset = 0x84A65C */
    uint32_t    L1PMPPA24                          ;        /* Offset = 0x84A660 */
    uint32_t    L1PMPPA25                          ;        /* Offset = 0x84A664 */
    uint32_t    L1PMPPA26                          ;        /* Offset = 0x84A668 */
    uint32_t    L1PMPPA27                          ;        /* Offset = 0x84A66C */
    uint32_t    L1PMPPA28                          ;        /* Offset = 0x84A670 */
    uint32_t    L1PMPPA29                          ;        /* Offset = 0x84A674 */
    uint32_t    L1PMPPA30                          ;        /* Offset = 0x84A678 */
    uint32_t    L1PMPPA31                          ;        /* Offset = 0x84A67C */
    uint32_t    RESTRICTED41[352]                  ;        /* Offset = 0x84A680 */
    uint32_t    L1DMPFAR                           ;        /* Offset = 0x84AC00 */
    uint32_t    L1DMPFSR                           ;        /* Offset = 0x84AC04 */
    uint32_t    L1DMPFCR                           ;        /* Offset = 0x84AC08 */
    uint32_t    RESTRICTED42[61]                   ;        /* Offset = 0x84AC0C */
    uint32_t    MPLK0                              ;        /* Offset = 0x84AD00 */
    uint32_t    MPLK1                              ;        /* Offset = 0x84AD04 */
    uint32_t    MPLK2                              ;        /* Offset = 0x84AD08 */
    uint32_t    MPLK3                              ;        /* Offset = 0x84AD0C */
    uint32_t    MPLKCMD                            ;        /* Offset = 0x84AD10 */
    uint32_t    MPLKSTAT                           ;        /* Offset = 0x84AD14 */
    uint32_t    RESTRICTED43[74]                   ;        /* Offset = 0x84AD18 */
    uint32_t    L1DMPPA16                          ;        /* Offset = 0x84AE40 */
    uint32_t    L1DMPPA17                          ;        /* Offset = 0x84AE44 */
    uint32_t    L1DMPPA18                          ;        /* Offset = 0x84AE48 */
    uint32_t    L1DMPPA19                          ;        /* Offset = 0x84AE4C */
    uint32_t    L1DMPPA20                          ;        /* Offset = 0x84AE50 */
    uint32_t    L1DMPPA21                          ;        /* Offset = 0x84AE54 */
    uint32_t    L1DMPPA22                          ;        /* Offset = 0x84AE58 */
    uint32_t    L1DMPPA23                          ;        /* Offset = 0x84AE5C */
    uint32_t    L1DMPPA24                          ;        /* Offset = 0x84AE60 */
    uint32_t    L1DMPPA25                          ;        /* Offset = 0x84AE64 */
    uint32_t    L1DMPPA26                          ;        /* Offset = 0x84AE68 */
    uint32_t    L1DMPPA27                          ;        /* Offset = 0x84AE6C */
    uint32_t    L1DMPPA28                          ;        /* Offset = 0x84AE70 */
    uint32_t    L1DMPPA29                          ;        /* Offset = 0x84AE74 */
    uint32_t    L1DMPPA30                          ;        /* Offset = 0x84AE78 */
    uint32_t    L1DMPPA31                          ;        /* Offset = 0x84AE7C */
} DSPICFGRegs;

#ifdef __cplusplus
}
#endif

#endif /* REG_DSPICFG_H */
/* END OF REG_DSPICFG_H */

